[
  {
    "number": "دعاء اليوم الأول",
    "text": "",
    "label": "اَللّهُمَّ اجْعَلْ صِيامي فيهِ صِيامَ الصّائِمينَ وَ قِيامي فيِهِ قِيامَ القائِمينَ ، وَ نَبِّهْني فيهِ عَن نَوْمَةِ الغافِلينَ ، وَهَبْ لي جُرمي فيهِ يا اِلهَ العالمينَ ، وَاعْفُ عَنّي يا عافِياً عَنِ المُجرِمينَ .",
    "number-en": "First day prayer",
    "label-en": "Oh God, make my fast therein the fast of those who fast and my standing therein the standing of those who stand up therein, and alert me therein from the sleep of the heedless, grant me my crime therein, O God of the worlds, and pardon me, O Pardoner of sins. Criminals."
  },
  {
    "number": "دعاء اليوم الثاني",
    "text": "",
    "label": "اَللّهُمَّ قَرِّبْني فيهِ اِلى مَرضاتِكَ ، وَجَنِّبْني فيهِ مِن سَخَطِكَ وَنَقِماتِكَ ، وَ وَفِّقني فيهِ لِقِرائَةِ اياتِِكَ ، بِرَحمَتِكَ يا أرحَمَ الرّاحمينَ .",
    "number-en": "Prayer of the second day",
    "label-en": "Oh God, bring me closer to Your pleasure, protect me from Your anger and wrath, and grant me success in reciting Your verses, by Your mercy, O Most Merciful of the Merciful."
  },
  {
    "number": "دعاء اليوم الثالث",
    "text": "",
    "label": "اَللّهُمَّ ارْزُقني فيهِ الذِّهنَ وَالتَّنْبيهِ ، وَ باعِدْني فيهِ مِنَ السَّفاهَةِ وَالتَّمْويهِ ، وَ اجْعَل لي نَصيباً مِن كُلِّ خَيْرٍ تُنْزِلُ فيهِ ، بِجودِكَ يا اَجوَدَ الأجْوَدينَ .",
    "number-en": "Prayer of the third day",
    "label-en": "Oh God, grant me reason and alertness, keep me away from foolishness and deceit, and grant me a share of every good thing You send down in it, with Your generosity, O Most Generous."
  },
  {
    "number": "دعاء اليوم الرابع",
    "text": "",
    "label": "اَللّهُمَّ قَوِّني فيهِ عَلى اِقامَةِ اَمرِكَ ، وَ اَذِقني فيهِ حَلاوَةِ ذِكْرِكَ ، وَ اَوْزِعْني فيهِ لِأداءِ شُكْرِكَ بِكَرَمِكَ ، وَ احْفَظْني فيهِ بِحِفظِكَ و َسَتْرِكَ يا اَبصَرَ النّاظِرينَ .",
    "number-en": "Prayer of the fourth day",
    "label-en": "Oh God, strengthen me in this day to carry out Your command, and give me a taste of the sweetness of your remembrance, and enable me in it to express my gratitude to you with your generosity, and preserve me in it with your protection and I will protect you, O most discerning of those who see."
  },
  {
    "number": "دعاء اليوم الخامس",
    "text": "",
    "label": "اَللّهُمَّ اجعَلني فيهِ مِنَ المُستَغْفِرينَ ، وَ اجعَلني فيهِ مِن عِبادِكَ الصّالحينَ القانِتينَ ، وَ اجعَلني فيهِ مِن اَوْليائِكَ المُقَرَّبينَ ، بِرَأفَتِكَ يا اَرحَمَ الرّاحمينَ .",
    "number-en": "Prayer of the fifth day",
    "label-en": "Oh God, make me among those who seek forgiveness, and make me among your righteous and obedient servants, and make me among your close friends, with your compassion, O Most Merciful of the Merciful."
  },
  {
    "number": "دعاء اليوم السادس",
    "text": "",
    "label": "اَللّهُمَّ لا تَخْذُلني فيهِ لِتَعَرُّضِ مَعصِيَتِكَ ، وَ لاتَضرِبني بِسِياطِ نَقِمَتِكَ ، وَ زَحْزِحني فيهِ مِن موُجِبات سَخَطِكَ بِمَنِّكَ وَ اَياديكَ يا مُنتَهى رَغْبَةِ الرّاغِبينَ .",
    "number-en": "Prayer of the sixth day",
    "label-en": "O God, do not let me down on this day for disobeying You, and do not strike me with the whips of Your vengeance, and remove me from the causes of Your wrath by Your grace and your hands, O the utmost desire. Those who wish."
  },
  {
    "number": "دعاء اليوم السابع ",
    "text": "",
    "label": "اَللّهُمَّ اَعِنّي فيهِ عَلى صِيامِهِ وَ قِيامِهِ ، وَ جَنِّبني فيهِ مِن هَفَواتِهِ وَاثامِهِ ، وَ ارْزُقني فيهِ ذِكْرَكَ بِدَوامِهِ ، بِتَوْفيقِكَ يا هادِيَ المُضِّلينَ .",
    "number-en": "Seventh day prayer",
    "label-en": "Oh God, help me in his fasting and prayers, protect me from his mistakes and sins, and grant me constant remembrance of you, with your success, O Guide of those who go astray."
  },
  {
    "number": "دعاء اليوم الثامن ",
    "text": "",
    "label": "اَللّهُمَّ ارْزُقْني فيهِ رَحمَةَ الأَيْتامِ وَ اِطعامَ الطَّعامِ وَاِفْشاءَ وَصُحْبَةَ الكِرامِ بِطَوْلِكَ يا مَلْجَاَ الأمِلينَ .",
    "number-en": "Prayer of the eighth day",
    "label-en": "O God, on this day, grant me mercy for orphans, provision of food, good news, and companionship with honorable people through your greatness, O refuge for the hopeless."
  },
  {
    "number": "دعاء اليوم التاسع ",
    "text": "",
    "label": "اَللّهُمَّ اجْعَل لي فيهِ نَصيباً مِن رَحمَتِكَ الواسِعَةِ ، وَ اهْدِني فيهِ لِبَراهينِكَ السّاطِعَةِ ، وَ خُذْ بِناصِيَتي إلى مَرْضاتِكَ الجامِعَةِ بِمَحَبَّتِكَ يا اَمَلَ المُشتاقينَ .",
    "number-en": "Prayer of the ninth day",
    "label-en": "Oh God, grant me a share of your vast mercy, guide me to your bright proofs, and lead me to your comprehensive pleasures with your love, O the hope of the longing."
  },
  {
    "number": "دعاء اليوم العاشر ",
    "text": "",
    "label": "اَللّهُمَّ اجْعَلني فيهِ مِنَ المُتَوَكِلينَ عَلَيْكَ ، وَ اجْعَلني فيهِ مِنَ الفائِزينَ لَدَيْكَ ، وَ اجعَلني فيه مِنَ المُقَرَّبينَ اِليكَ بِاِحْسانِكَ يا غايَةَ الطّالبينَ .",
    "number-en": "Prayer of the tenth day",
    "label-en": "Oh God, make me among those who trust in You, and make me among those who are victorious with You, and make me among those who are close to You through Your benevolence, O the goal of seekers."
  },
  {
    "number": "دعاء اليوم الحادي عشر ",
    "text": "",
    "label": "اَللّهُمَّ حَبِّبْ اِلَيَّ فيهِ الْإحسانَ ، وَ كَرِّهْ فيهِ الْفُسُوقَ وَ العِصيانَ وَ حَرِّمْ عَلَيَّ فيهِ السَخَطَ وَ النّيرانَ بعَوْنِكَ ياغياثَ المُستَغيثينَ .",
    "number-en": "Prayer of the eleventh day",
    "label-en": "Oh God, make me love goodness, hate immorality and disobedience, and forbid anger and fires from me, with Your help, O help of those who seek help."
  },
  {
    "number": "دعاء اليوم الثاني عشر ",
    "text": "",
    "label": "اَللّهُمَّ زَيِّنِّي فيهِ بالسِّترِ وَ الْعَفافِ ، وَ اسْتُرني فيهِ بِلِِِباسِ الْقُنُوعِ و َالكَفافِ ، وَ احْمِلني فيهِ عَلَى الْعَدْلِ وَ الْإنصافِ ، وَ آمنِّي فيهِ مِنْ كُلِّ ما اَخافُ بِعِصْمَتِكَ ياعصمَةَ الْخائفينَ .",
    "number-en": "Prayer of the twelfth day",
    "label-en": "Oh God, adorn me with cover and chastity, cover me with the clothing of contentment and modesty, make me adhere to justice and fairness, and protect me from everything I fear. With your protection, O protector of the fearful."
  },
  {
    "number": "دعاء اليوم الثالث عشر ",
    "text": "",
    "label": "اَللّهُمَّ طَهِّرْني فيهِ مِنَ الدَّنسِ وَ الْأقْذارِ ، وَ صَبِّرْني فيهِ عَلى كائِناتِ الْأَقدارِ ، وَ وَفِّقْني فيهِ لِلتُّقى وَ صُحْبَةِ الْأبرارِ بِعَوْنِكَ ياقُرَّةَ عَيْن الْمَساكينِ .",
    "number-en": "Prayer of the thirteenth day",
    "label-en": "O God, purify me from filth and filth, and grant me patience over the creatures of fate, and enable me to be pious and to be in the company of the righteous, with Your help, O comfort of the eyes of the poor."
  },
  {
    "number": "دعاء اليوم الرابع عشر ",
    "text": "",
    "label": "اَللّهُمَّ لاتُؤاخِذْني فيهِ بالْعَثَراتِ ، وَ اَقِلْني فيهِ مِنَ الْخَطايا وَ الْهَفَواتِ ، وَ لا تَجْعَلْني فيهِ غَرَضاً لِلْبَلايا وَ الأفاتِ بِعزَّتِكَ ياعِزَّ المُسْلمينَ .",
    "number-en": "Prayer of the fourteenth day",
    "label-en": "Oh God, do not hold me accountable for my stumbles, free me from sins and lapses, and do not make me an object of afflictions and calamities due to Your glory, O Mighty of Muslims."
  },
  {
    "number": "دعاء اليوم الخامس عشر ",
    "text": "",
    "label": "اَللّهُمَّ ارْزُقْني فيهِ طاعةَ الخاشعينَ ، وَ اشْرَحْ فيهِ صَدري بِانابَةِ المُخْبِتينَ ، بِأمانِكَ ياأمانَ الخائفينَ .",
    "number-en": "Prayer of the fifteenth day",
    "label-en": "O God, grant me the obedience of the humble on this day, and expand my chest with the repentance of those who are hidden, with Your security, O security of the fearful."
  },
  {
    "number": "دعاء اليوم السادس عشر ",
    "text": "",
    "label": "اَللّهُمَّ وَفِّقْني فيهِ لِمُوافَقَةِ الْأبرارِ ، وَ جَنِّبْني فيهِ مُرافَقَةِ الأشرارِ ، وَآوني فيهِ برَحمَتِكَ إلى دارِ القَرارِ بإلهيَّتِكَ يا إله العالمينَ .",
    "number-en": "Prayer of the sixteenth day",
    "label-en": "O God, grant me success in this day to be in agreement with the righteous, spare me from the company of the evil people, and lead me, by your mercy, to the abode of abode in your divinity, O God of the worlds."
  },
  {
    "number": "دعاء اليوم السابع عشر ",
    "text": "",
    "label": "اَللّهُمَّ اهدِني فيهِ لِصالِحِ الأعْمالِ ، وَ اقضِ لي فيهِ الحوائِجَ وَ الآمالِ يا مَنْ لا يَحتاجُ إلى التَّفسيرِ وَ السُّؤالِ ، يا عالِماً بِما في صُدُورِ العالمينَ صَلِّ عَلى مُحَمَّدٍ وَ آله الطّاهرينَ .",
    "number-en": "Prayer of the seventeenth day",
    "label-en": "O God, guide me to good deeds, and satisfy my needs and hopes, O He who does not need explanation or questioning, O Knower of what is in the breasts of the worlds. Bless Muhammad and his pure family."
  },
  {
    "number": "دعاء اليوم الثامن عشر ",
    "text": "",
    "label": "اَللّهُمَّ نَبِّهني فيهِ لِبَرَكاتِ أسحارِهِ ، وَ نوِّرْ قَلْبي بِضِياءِ أنوارِهِ ، وَ خُذْ بِكُلِّ أعْضائِي إلى اتِّباعِ آثارِهِ بِنُورِكَ يا مُنَوِّرَ قُلُوبِ العارفينَ .",
    "number-en": "Prayer of the eighteenth day",
    "label-en": "Oh God, make me aware of the blessings of its dawning days, enlighten my heart with the radiance of its lights, and lead all my limbs to follow its effects with your light, O enlightener of the hearts of those who know."
  },
  {
    "number": "دعاء اليوم التاسع عشر ",
    "text": "",
    "label": "أللّهُمَّ وَفِّر فيهِ حَظّي مِن بَرَكاتِهِ ، وَ سَهِّلْ سَبيلي إلى خيْراتِهِ ، وَ لا تَحْرِمْني قَبُولَ حَسَناتِهِ يا هادِياً إلى الحَقِّ المُبينِ .",
    "number-en": "Prayer of the nineteenth day",
    "label-en": "Oh God, provide me with His blessings, make my path easy to His good deeds, and do not deprive me of accepting His good deeds, O Guide to the clear truth."
  },
  {
    "number": "دعاء اليوم العشرون ",
    "text": "",
    "label": "أللّهُمَّ افْتَحْ لي فيهِ أبوابَ الجِنان ، وَ أغلِقْ عَنَّي فيهِ أبوابَ النِّيرانِ ، وَ وَفِّقْني فيهِ لِتِلاوَةِ القُرانِ يامُنْزِلَ السَّكينَةِ في قُلُوبِ المؤمنين .",
    "number-en": "Prayer of the twentieth day",
    "label-en": "Oh God, open for me the gates of Paradise, close the gates of Hell for me, and grant me success in reciting the Qur’an, O You Who sends tranquility into the hearts of believers."
  },
  {
    "number": "دعاء اليوم الحادي والعشرون ",
    "text": "",
    "label": "أللّهُمَّ اجْعَلْ لي فيهِ إلى مَرضاتكَ دَليلاً ، و لا تَجعَلْ لِلشَّيْطانِ فيهِ عَلَيَّ سَبيلاً ، وَ اجْعَلِ الجَنَّةَ لي مَنْزِلاً وَ مَقيلاً ، يا قاضِيَ حَوائج الطالبينَ .",
    "number-en": "Prayer of the twenty-first day",
    "label-en": "Oh God, make me a guide to Your pleasure therein, and do not allow Satan a way over me therein, and make Paradise a place for me and a resting place, O Judge of the needs of the seekers."
  },
  {
    "number": "دعاء اليوم الثاني والعشرون ",
    "text": "",
    "label": "أللّهُمَّ افْتَحْ لي فيهِ أبوابَ فَضْلِكَ ، وَ أنزِل عَلَيَّ فيهِ بَرَكاتِكَ ، وَ وَفِّقْني فيهِ لِمُوجِباتِ مَرضاتِكَ ، وَ أسْكِنِّي فيهِ بُحْبُوحاتِ جَنّاتَكَ ، يا مَجيبَ دَعوَةِ المُضْطَرِّينَ .",
    "number-en": "Prayer of the twenty-second day",
    "label-en": "Oh God, open for me the doors of Your grace, and send down Your blessings upon me, and grant me success in the times of Your illnesses, and make me dwell in the bliss of Your Paradise, O Answerer of the supplication. المُضْطَرِّينَ ."
  },
  {
    "number": "دعاء اليوم الثالث والعشرون ",
    "text": "",
    "label": "أللّهُمَّ اغْسِلني فيهِ مِنَ الذُّنُوبِ ، وَ طَهِّرْني فيهِ مِنَ العُيُوبِ ، وَ امْتَحِنْ قَلبي فيهِ بِتَقْوى القُلُوبِ ، يامُقيلَ عَثَراتِ المُذنبين .",
    "number-en": "Prayer of the twenty-third day",
    "label-en": "Oh God, wash me away from sins, purify me from blemishes, and test my heart with the piety of hearts, O Remover of the stumbling blocks of sinners."
  },
  {
    "number": "دعاء اليوم الرابع والعشرون ",
    "text": "",
    "label": "أللّهُمَّ إنِّي أسألُكَ فيهِ مايُرضيكَ ، وَ أعُوذُ بِكَ مِمّا يُؤذيكَ ، وَ أسألُكَ التَّوفيقَ فيهِ لِأَنْ اُطيعَكَ وَلا أعْصِيَكَ ، يا جواد السّائلينَ .",
    "number-en": "Prayer of the twenty-fourth day",
    "label-en": "Oh God, I ask You in it for what pleases You, and I seek refuge in You from what harms You, and I ask You for success in it so that I can obey You and not disobey You, O the Granter of those who ask."
  },
  {
    "number": "دعاء اليوم الخامس والعشرون ",
    "text": "",
    "label": "أللّهُمَّ اجْعَلني فيهِ مُحِبّاً لِأوْليائكَ ، وَ مُعادِياً لِأعْدائِكَ ، مُسْتَنّاً بِسُنَّةِ خاتمِ أنبيائكَ ، يا عاصمَ قٌلٌوب النَّبيّينَ .",
    "number-en": "Prayer of the twenty-fifth day",
    "label-en": "Oh God, make me a lover of Your saints and a friend of Your enemies, adhering to the Sunnah of the Seal of Your Prophets, O Protector of the hearts of the Prophets."
  },
  {
    "number": "دعاء اليوم السادس والعشرون ",
    "text": "",
    "label": "أللّهُمَّ اجْعَلْ سَعْيي فيهِ مَشكوراً ، وَ ذَنبي فيهِ مَغفُوراً ، وَ عَمَلي فيهِ مَقبُولاً ، وَ عَيْببي فيهِ مَستوراً يا أسمَعَ السّامعينَ .",
    "number-en": "Prayer of the twenty-sixth day",
    "label-en": "Oh God, make my endeavors in it grateful, my sins in it forgiven, my deeds in it accepted, and my faults in it hidden, O Most Hearing of all who hear."
  },
  {
    "number": "دعاء اليوم السابع والعشرون ",
    "text": "",
    "label": "أللّهُمَّ ارْزُقني فيهِ فَضْلَ لَيلَةِ القَدرِ ، وَ صَيِّرْ اُمُوري فيهِ مِنَ العُسرِ إلى اليُسرِ ، وَ اقبَلْ مَعاذيري وَ حُطَّ عَنِّي الذَّنب وَ الوِزْرَ ، يا رَؤُفاً بِعِبادِهِ الصّالحينَ .",
    "number-en": "Prayer of the twenty-seventh day",
    "label-en": "O God, grant me the bounty of Laylat al-Qadr, change my affairs from hardship to ease, accept my apologies, and remove from me my sin and burden, O Most Merciful to His righteous servants."
  },
  {
    "number": "دعاء اليوم الثامن والعشرون ",
    "text": "",
    "label": "أللّهُمَّ وَفِّرْ حَظِّي فيهِ مِنَ النَّوافِلِ ، وَ أكْرِمني فيهِ بِإحضارِ المَسائِلِ ، وَ قَرِّبْ فيهِ وَسيلَتي إليكَ مِنْ بَيْنِ الوَسائِلِ ، يا مَن لا يَشْغَلُهُ إلحاحُ المُلِحِّينَ .",
    "number-en": "Prayer of the twenty-eighth day",
    "label-en": "Oh God, provide my share of voluntary acts of worship, honor me by presenting the supplications, and make my approach to You nearer among the means, O He who is not distracted by the insistence of the pressing ones."
  },
  {
    "number": "دعاء اليوم التاسع والعشرون ",
    "text": "",
    "label": "أللّهُمَّ غَشِّني فيهِ بالرَّحْمَةِ ، وَ ارْزُقني فيهِ التَّوفيقَ وَ العِصْمَةَ ، وَ طَهِّر قَلبي مِن غياهِبِ التُّهمَةِ ، يارَحيماً بِعبادِهِ المُؤمنينَ .",
    "number-en": "Prayer of the twenty-ninth day",
    "label-en": "Oh God, cover me with mercy, grant me success and infallibility, and purify my heart from the clouds of accusation, O Merciful to His faithful servants."
  },
  {
    "number": "دعاء اليوم الثلاثون",
    "text": "",
    "label": "أللّهُمَّ اجْعَلْ صِيامي فيهِ بالشُّكرِ وَ القَبولِ عَلى ما تَرضاهُ وَ يَرضاهُ الرَّسولُ مُحكَمَةً فُرُوعُهُ بِالأُصُولِ ، بِحَقِّ سَيِّدِنا مُحَمَّدٍ وَآلهِ الطّاهِرينَ ، وَ الحَمدُ للهِ رَبِّ العالمينَ .",
    "number-en": "Prayer of the thirtieth day",
    "label-en": "Oh God, make my fast on this day with gratitude and acceptance for what You are pleased with and which the Messenger is pleased with, with its branches tightly connected to the roots, for the sake of our master Muhammad and his pure family, and praise be to God, Lord of the worlds."
  }
]