[
  {
    "number": "ما هو الإيمان",
    "text": "",
    "label": "تعريف الإيمان لغة واصطلاحا\n\nيُعرَّف الإيمان في اللُّغة: بأنه مُطلق التصديق،وأمّا في الاصطلاح فهو: تصديقُ القلبِ وإذعانُه وقَبوله بِكُلّ ما جاء به النّبي -عليه الصّلاة والسّلام-، وجعل الله -تعالى- الشّهادتين العلامة الظَّاهرة التي تدُلُّ عليه؛ لإجراء أحكام الإسلام على الشَّخص المؤمن، كالصَّلاة عليه وصحة التَّوارث منه وله وغيرها من الأحكام.\n\nأركان الإيمان\n\nللإيمان ستةُ أركان، وهي كما يلي:\n\nالإيمان بالله -تعالى-، وأنه واحد لا شريك له، فلا تقرن معه غيره في العبادات، والتشريع.\nالإيمان بالملائكة، وأنّها مخلوقات نورانية؛ أوْجدها الله لتنفيذِ أوامره.\nالإيمان بالكُتُب، وهي التَّوراة والإنجيل والزبور والقُرآن وهو أفضلُها.\nالإيمان بالرُّسل، وخاتمهم النَّبي محمد -عليه الصَّلاة والسَّلام-.\nالإيمان باليوم الآخر، وهو يوم القيامة؛ لمُحاسبة الإنسان على أعماله.\nالإيمان بالقضاء والقَدَر خيره وشره؛ لأنه قدر الله -تعالى-، وقع بحكمته ومشيئته.\nالإسلام والإيمان والاحسان\n\nالدِّين الإسلاميُّ له عدة مراتب ودرجات، وهي الإسلام ويكون بالاستسلام لله -تعالى-، وتوحيدِه، وطاعتِه، والبراءة من الشرك وأهله، فإذا فُقدت صفةٌ منها يُصبح الإنسان غير مُسلماً، ثُمّ الإيمان وقد سبق تعريفه في بداية المقال، ثُمّ الإحسان ويكون بتحسين العبد العلاقة بينه وبين خالقه في العبادة، وقد عرَّفه النبي -عليه الصلاة والسلام- بقوله: (الإحْسَانُ أنْ تَعْبُدَ اللَّهَ كَأنَّكَ تَرَاهُ، فإنْ لَمْ تَكُنْ تَرَاهُ فإنَّه يَرَاكَ)،وفيما يأتي بيانٌ لكُلٍ من الإسلام والإحسان وقد سبق بيان الإيمان:\n\nالإسلام: ويُعرف في اللُغة : أنه الإستسلام والإنقياد، وفي الإصطلاح فهو: الإستسلام والانقياد لأمر الله -تعالى- طوعاً وكراهية، لقوله تعالى: (أَفَغَيْرَ دِينِ اللَّهِ يَبْغُونَ وَلَهُ أَسْلَمَ مَن فِي السَّمَاوَاتِ وَالْأَرْضِ طَوْعًا وَكَرْهًا وَإِلَيْهِ يُرْجَعُونَ)، وأمّا أركانه فقد جاءت في حديث النَّبي -عليه الصلاة والسلام-: (بُنِيَ الإسْلامُ علَى خَمْسٍ، شَهادَةِ أنْ لا إلَهَ إلَّا اللَّهُ، وأنَّ مُحَمَّدًا عَبْدُهُ ورَسولُهُ، وإقامِ الصَّلاةِ، وإيتاءِ الزَّكاةِ، وحَجِّ البَيْتِ، وصَوْمِ رَمَضانَ)، فأوَّلها الشهادتيْن وتكون بإخلاص العمل لله -تعالى-، وموافقته لشرعه، ثُمّ إقامة الصلاة والقيام بها بجميع واجباتها وشُروطها وأركانها، ثُمّ إيتاء الزكاة وصرفها لمُستحقيها، ثُمّ صوْم رمضان، ثُمّ حجُ البيت.\nالإحسان: وهو مُراقبة العبد لخالقه في جميع أحواله، سواءً أكان في السر أو العلن، والمُبادرة إلى فعل الخير؛ مع قصد الله -تعالى- في كلِّ امره، ويكون الإحسان بإخلاص الأعمال لله -تعالى-، وفعل ما يُحبه، وأداؤه على الوجه الأكمل، لقوله تعالى: (وَمَنْ أَحْسَنُ دِينًا مِمَّنْ أَسْلَمَ وَجْهَهُ لِلَّهِ وَهُوَ مُحْسِنٌ وَاتَّبَعَ مِلَّةَ إبْرَاهِيمَ حَنِيفًا وَاتَّخَذَ اللَّهُ إبْرَاهِيمَ خَلِيلًا).",
    "number-en": "What is faith?",
    "label-en": "Definition of faith linguistically and idiomatically\n\nFaith is defined in language: as absolute belief, but in terminology it is: the heart’s belief, submission, and acceptance of everything that the Prophet - may the peace and blessings of God be upon him - brought, and God Almighty made the two testimonies the visible sign that indicates it. To implement the rulings of Islam on the believer, such as praying for him, the validity of inheritance from him and for him, and other rulings.\n\nPillars of faith\n\nFaith has six pillars, which are as follows:\n\nBelief in God Almighty, and that He is One and has no partner, so do not combine anything else with Him in worship and legislation.\nBelief in angels, and that they are luminous creatures; God created it to carry out His commands.\nBelief in the Books, which are the Torah, the Gospel, the Psalms, and the Qur’an, which is the best of them.\nBelief in the Messengers, and their seal, the Prophet Muhammad - may blessings and peace be upon him -.\nBelief in the Last Day, which is the Day of Resurrection; To hold people accountable for their actions.\nBelief in destiny and destiny, good and evil; Because it was God Almighty’s decree, it occurred by His wisdom and will.\nIslam, faith and charity\n\nThe Islamic religion has several ranks and degrees, which are Islam, which is submission to God Almighty, His monotheism, obedience to Him, and disavowal of polytheism and its people. If one of these qualities is lost, the person becomes a non-Muslim, then faith, which was previously defined at the beginning of the article, then charity, which is the servant improving the relationship between him and his Creator in worship, and the Prophet, peace and blessings be upon him, defined it by saying: (Ihsan is that you worship God as if you see Him, and if you do not see Him, then He sees you.) And what follows is an explanation of both Islam and Ihsan, and the explanation of faith has previously been mentioned:\n\nIslam: It is known in language as: surrender and submission, and in terminology it is: surrender and submission to the command of God - the Almighty - willingly or unwillingly, according to the Almighty’s saying: (Is it other than the religion of God that they seek? And to Him do all who are in the heavens and the earth submit willingly. And as for its pillars, it came in the hadith of the Prophet - peace and blessings be upon him -: (Islam is built on five things: bearing witness that there is no god but God, and that Muhammad is His servant and Messenger, establishing prayer, and performing Zakat, Hajj to the House, and fasting in Ramadan. The first of these is the two testimonies, which consist of sincerity of the work to God Almighty and its conformity with His law, then establishing prayer and performing it with all its duties, conditions and pillars, then paying zakat and disbursing it to those who deserve it, then fasting Ramadan, then Hajj to the House.\nIhsan: It is the servant’s observance of his Creator in all his circumstances, whether in secret or in public, and taking the initiative to do good. With the intention of God - the Almighty - in all his affairs, and ihsan consists of deeds being sincere to God - the Almighty - and doing what He loves and performing it in the most perfect manner, according to the Almighty’s saying: (And who is better in religion than he who submits his face to God and is a doer of good and follows the religion of Abraham was upright, and God took Abraham as a friend."
  },
  {
    "number": "أسباب ضعف الإيمان",
    "text": "",
    "label": "الحمد الله رب العالمين، المعبود في كل وقت وحين، المتصرف في الكون، القائل للشيء كن فيكون، سبحانه وبحمده, والصلاة والسلام على النبي الكريم صلى الله عليه وعلى آله وصحبه أجمعين، أما بعد:\n\nفإن من المعلوم في عقيدتنا أن الإيمان بالله – تبارك وتعالى – يزيد وينقص قال الإمام النووي – رحمه الله -: \"مذهب جماعة أهل السنة من سلف الأمة وخلفها أن الإيمان قول وعمل، يزيد وينقص، والحجة على زيادته ونقصانه ما أورده البخاري من الآيات يعنى قوله – عز وجل -: {لِيَزْدَادُوا إِيمَاناً مَّعَ إِيمَانِهِمْ}1, وقوله – تعالى -: {وَزِدْنَاهُمْ هُدًى}2, وقوله – تعالى -:{وَيَزِيدُ اللَّهُ الَّذِينَ اهْتَدَوْا هُدًى}3, وقوله – تعالى -: {وَالَّذِينَ اهْتَدَوْا زَادَهُمْ هُدًى}4, وقوله – تعالى -: {وَيَزْدَادَ الَّذِينَ آمَنُوا إِيمَاناً}5, وقوله – تعالى –: {أَيُّكُمْ زَادَتْهُ هَذِهِ إِيمَاناً فَأَمَّا الَّذِينَ آمَنُواْ فَزَادَتْهُمْ إِيمَاناً}6، وقوله – تعالى -: {فَزَادَهُمْ إِيمَاناً}7, وقوله – تعالى –:{وَمَا زَادَهُمْ إِلَّا إِيمَاناً وَتَسْلِيماً}8, قال ابن بطال: فإيمان من لم تحصل له الزيادة ناقص9\".\n\nولتلك الزيادة أو ذلك النقص أسباب, سوف نذكر في هذه العجالة بعضاً من الأسباب التي تؤدي إلى ضعف الإيمان وفي المقابل فإن عكسها هي أسباب لزيادة الإيمان:\n\nأولاً: عدم مراقبة الله – تبارك وتعالى –: وجهل الإنسان بأن الله – تبارك وتعالى – مطلعٌ عليه, رقيب يعلم كل شيء {إِنَّ اللّهَ كَانَ عَلَيْكُمْ رَقِيباً}10, {وَكَانَ اللَّهُ عَلَى كُلِّ شَيْءٍ رَّقِيباً }11, {وَللّهِ مَا فِي السَّمَاوَاتِ وَمَا فِي الأَرْضِ وَكَانَ اللّهُ بِكُلِّ شَيْءٍ مُّحِيطاً}12, وكذا جهل الإنسان بأن الله على كل شيء قدير لا يعجزه شيء في الأرض ولا في السماء {مَا نَنسَخْ مِنْ آيَةٍ أَوْ نُنسِهَا نَأْتِ بِخَيْرٍ مِّنْهَا أَوْ مِثْلِهَا أَلَمْ تَعْلَمْ أَنَّ اللّهَ عَلَىَ كُلِّ شَيْءٍ قَدِيرٌ}13, وقال:{وَلِكُلٍّ وِجْهَةٌ هُوَ مُوَلِّيهَا فَاسْتَبِقُواْ الْخَيْرَاتِ أَيْنَ مَا تَكُونُواْ يَأْتِ بِكُمُ اللّهُ جَمِيعاً إِنَّ اللّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ}14, وقال:{وَلِلّهِ مُلْكُ السَّمَاوَاتِ وَالأَرْضِ وَاللّهُ عَلَىَ كُلِّ شَيْءٍ قَدِيرٌ}15, وتناسيه أن الله – تبارك وتعالى – هو الذي بيده الموت والحياة، وهو على كل شيء قدير قال الله: {ذَلِكَ بِأَنَّ اللَّهَ هُوَ الْحَقُّ وَأَنَّهُ يُحْيِي الْمَوْتَى وَأَنَّهُ عَلَى كُلِّ شَيْءٍ قَدِيرٌ }16, وقال: {وَهُوَ عَلَى كُلِّ شَيْءٍ شَهِيدٌ}17, وقال:{تَبَارَكَ الَّذِي بِيَدِهِ الْمُلْكُ وَهُوَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ}18, فتجاهل الإنسان لصفات الله – تبارك وتعالى – تجعل الإنسان بعيداً عن استشعار مراقبته لله – جل وعلا -، وإذا لم يراقب العبد ربه – تعالى – وقع في المعاصي والآثام، وهذا يكون سبباً في ضعف الإيمان بالله – تبارك وتعالى -.\n\nثانياً: فعل المعاصي: فإن للمعاصي آثاراً عظيمة على القلب وعلى الإيمان، وجاء عن أبي هريرة – رضي الله عنه – قال: قال النبي – صلى الله عليه وسلم -: ((لا يزني الزاني حين يزني وهو مؤمن، ولا يشرب الخمر حين يشرب وهو مؤمن، ولا يسرق حين يسرق وهو مؤمن، ولا ينتهب نهبة يرفع الناس إليه فيها أبصارهم حين ينتهبها وهو مؤمن))19, فهذا دليل على أن فعل المعاصي يضعف الإيمان، ومعنى قوله: ((وهو مؤمن)) أي كامل الإيمان، وليس المراد نفي الإيمان بالكلية قال ابن عبد البر – رحمه الله -: \"يريد مستكمل الإيمان، ولم يرد به نفي جميع الإيمان عن فاعل ذلك؛ بدليل الإجماع على توريث الزاني والسارق وشارب الخمر إذا صلوا للقبلة، وانتحلوا دعوة الإسلام من قرابتهم المؤمنين الذين آمنوا بتلك الأحوال، وفي إجماعهم على ذلك مع إجماعهم على أن الكافر لا يرث المسلم؛ أوضح الدلائل على صحة قولنا أن مرتكب الذنوب ناقص الإيمان بفعله ذلك وليس بكافر20\"، وقال الإمام النووي – رحمه الله -: \"فالقول الصحيح الذي قاله المحققون أن معناه: لا يفعل هذه المعاصي وهو كامل الإيمان، وهذا من الألفاظ التي تطلق على نفى الشيء ويراد نفى كماله21\"؛ وقال العيني – رحمه الله -: \"أن المراد بحديث \"لا يشرب الخمر وهو مؤمن\" نفي كمال الإيمان، لا أنه يخرج عن الإيمان22\", وقال: \"وفيه تنبيه على جميع أنواع المعاصي لأنها إما بدنية كالزنا، أو مالية إما سراً كالسرقة أو جهراً كالنهب، أو عقلية كالخمر فإنها مزيلة له، قوله \"نُهبة\" بضم النون وهو المال المنهوب\"23.\n\nثالثاً: الاشتغال بالدنيا حتى يصبح القلب عبداً لها – والعياذ بالله -: من انشغال بالمال أو زوجة وأولاد يقول الله – تبارك وتعالى -: {وَاعْلَمُواْ أَنَّمَا أَمْوَالُكُمْ وَأَوْلاَدُكُمْ فِتْنَةٌ وَأَنَّ اللّهَ عِندَهُ أَجْرٌ عَظِيمٌ}24, وقال: {اعْلَمُوا أَنَّمَا الْحَيَاةُ الدُّنْيَا لَعِبٌ وَلَهْوٌ وَزِينَةٌ وَتَفَاخُرٌ بَيْنَكُمْ وَتَكَاثُرٌ فِي الْأَمْوَالِ وَالْأَوْلَادِ كَمَثَلِ غَيْثٍ أَعْجَبَ الْكُفَّارَ نَبَاتُهُ ثُمَّ يَهِيجُ فَتَرَاهُ مُصْفَرّاً ثُمَّ يَكُونُ حُطَاماً وَفِي الْآخِرَةِ عَذَابٌ شَدِيدٌ وَمَغْفِرَةٌ مِّنَ اللَّهِ وَرِضْوَانٌ وَمَا الْحَيَاةُ الدُّنْيَا إِلَّا مَتَاعُ الْغُرُورِ}25, ومن المعلوم أن الإنسان مجبول على حب المال والولد والزوجة, وهذا لا شيء فيه إذا لم يلهه ذلك ويشغله عن طاعة الله – تبارك وتعالى – قال الله: {زُيِّنَ لِلنَّاسِ حُبُّ الشَّهَوَاتِ مِنَ النِّسَاء وَالْبَنِينَ وَالْقَنَاطِيرِ الْمُقَنطَرَةِ مِنَ الذَّهَبِ وَالْفِضَّةِ وَالْخَيْلِ الْمُسَوَّمَةِ وَالأَنْعَامِ وَالْحَرْثِ ذَلِكَ مَتَاعُ الْحَيَاةِ الدُّنْيَا وَاللّهُ عِندَهُ حُسْنُ الْمَآبِ}26, فإذا شغله ذلك عن طاعة الله – تبارك وتعالى – كان ماله وولده وزوجته أعداء بين يدي الله – تبارك وتعالى – قال الله: {يَا أَيُّهَا الَّذِينَ آمَنُوا إِنَّ مِنْ أَزْوَاجِكُمْ وَأَوْلَادِكُمْ عَدُوّاً لَّكُمْ فَاحْذَرُوهُمْ وَإِن تَعْفُوا وَتَصْفَحُوا وَتَغْفِرُوا فَإِنَّ اللَّهَ غَفُورٌ رَّحِيمٌ}27.\n\nرابعاً: ترك الطاعة: فإن ترك الطاعة سبب لنقص الإيمان, فإن كانت الطاعة واجبة وتركها بلا عذر فهو نقص يلام عليه ويعاقب, بل بعضها قد يصل به إلى الكفر – والعياذ بالله – كترك الصلاة, وإن كانت الطاعة غير واجبة كالنوافل، أو واجبة لكن تركها بعذر؛ فإنه نقص لا يلام عليه.\n\nخامساً: الإفراط في الأكل والنوم والسهر والكلام في ما لا يعنيه: فالإفراط في الأكل يؤدي إلى كثرة النوم والغفلة والكسل عن فعل الطاعات, والإفراط في النوم والسهر يسبب نومه عن الصلوات وبخاصة صلاة الفجر, والإفراط في الكلام فيما لا يعنيه حتى ولو كان في المباح فإنه يجره إلى الحرام فيقع في الغيبة والآثام نسأل الله العافية.\n\nسادساً: الابتعاد عن طلب العلم الشرعي، وهجر القرآن, وعدم مطالعة سير السلف، والكتب الإيمانية التي تحيي القلب: وذلك لأن طلب العلم وقراءة القرآن يجعل المسلم يتعرف على عظمة الله – تبارك وتعالى -، وما الذي يجب عليه تجاه خالقه – سبحانه وبحمده -, وبمطالعة سير السلف ينبعث النشاط والهمة على عبادة الله – تبارك وتعالى -، فإذا أكثر الإنسان من العبادة زاد إيمانه.\n\nسابعاً: عدم الإكثار من ذكر الله – تبارك وتعالى -: فهو مدعاة لضعف الإيمان، فإن ذكر الله يحيي القلوب ويطمئنها قال الله: {الَّذِينَ آمَنُواْ وَتَطْمَئِنُّ قُلُوبُهُم بِذِكْرِ اللّهِ أَلاَ بذِكْرِ اللّهِ تَطْمَئِنُّ الْقُلُوبُ}28, وقال: {أَلَمْ يَأْنِ لِلَّذِينَ آمَنُوا أَن تَخْشَعَ قُلُوبُهُمْ لِذِكْرِ اللَّهِ وَمَا نَزَلَ مِنَ الْحَقِّ وَلَا يَكُونُوا كَالَّذِينَ أُوتُوا الْكِتَابَ مِن قَبْلُ فَطَالَ عَلَيْهِمُ الْأَمَدُ فَقَسَتْ قُلُوبُهُمْ وَكَثِيرٌ مِّنْهُمْ فَاسِقُونَ}29, والإعراض عن ذكر الله سبب في عيشة الضنك – والعياذ بالله – قال الله: {وَمَنْ أَعْرَضَ عَن ذِكْرِي فَإِنَّ لَهُ مَعِيشَةً ضَنكاً وَنَحْشُرُهُ يَوْمَ الْقِيَامَةِ أَعْمَى}30.\n\nفهذه جملة من الأسباب التي تضعف الإيمان، والذي يجب على المسلم أنه إذا شعر بأن إيمانه خَلُقَ وضَعُفَ أن يكثر من النوافل والمحافظة على الفرائض, ويكثر من ذكر الله – تبارك وتعالى -، حيث قد ثبت الأمر بتجديد الإيمان في حديث عبد الله بن عمرو بن العاص – رضي الله عنهما – قال: قال رسول الله – صلى الله عليه وسلم -: ((إن الإيمان ليخلق في جوف أحدكم كما يخلق الثوب الخلق، فاسألوا الله أن يجدد الإيمان في قلوبكم))31.\n\nنسأل الله – تبارك وتعالى – أن يعيننا على طاعته وطاعة رسوله – صلى الله عليه وعلى آله وسلم -، وأن يزيد إيماننا قوة وثباتاً حتى نلقاه، بمنَّه وكرمه، والحمد لله رب العالمين، والصلاة والسلام على نبينا محمد وآله وصحبه أجمعين.",
    "number-en": "Reasons for weak faith",
    "label-en": "Praise be to God, Lord of the Worlds, who is worshiped at all times and times, who disposes of the universe, who says to a thing, “Be” and it is, Glory be to Him and praise be to Him, and may blessings and peace be upon the Noble Prophet, may God’s prayers and peace be upon him and all his family and companions, as for what follows:\n\nIt is known in our belief that faith in God - Blessed and Most High - increases and decreases. Imam Al-Nawawi - may God have mercy on him - said: “The doctrine of the Sunni group from the predecessors of the nation and its successors is that faith is word and deed, it increases and decreases. The evidence for its increase and decrease is what Al-Bukhari mentioned from the verses, meaning his saying - the Almighty -: {that they may increase in faith with their faith}1, and his saying - the Most High -: {And We have increased them in guidance}2, and his saying - the Most High -: {and God increases those who They were guided to guidance}3, and His saying - the Almighty -: {And those who are guided - He increased their guidance}4, and His saying - the Most High -: {And those who believe will increase in faith}5, and His saying - the Most High -: {Which of you? This has increased his faith. As for those who believe, it has increased their faith.}6 And His saying - the Almighty -: {And He increased them in faith}7, and His saying - the Most High -: {And He did not increase them except in faith and submission}8, Ibn Battal said: The faith of the one who did not receive the increase is incomplete9.”\n\nThere are reasons for this increase or decrease. We will briefly mention some of the reasons that lead to weak faith, and on the other hand, their opposite are reasons for increasing faith: First: Not observing God - Blessed and Most High: and man’s ignorance that God - Blessed and Most High - is aware of him, a Watcher who knows everything. Earth, and God has all things encompassing.} 12 And likewise man’s ignorance that God has power over all things, and nothing on earth or in heaven is incapable of Him. You know that God is over everything Almighty}13, and He said: {And for every destination He is its Master, so strive for good deeds wherever you may be. God will bring you all together. Indeed, God has power over all things}14, And he said: {And to God belongs the dominion of the heavens and the earth, and God has power over all things}15, and he forgot that God - Blessed and Most High - is the one in whose hands is death and life. And He is Able to do all things. God said: {That is because God is the Truth, and He gives life to the dead, and He is Able to do all things}16, and He said: {And He is Witness over all things}17, And he said: {Blessed is He in whose hand is the dominion, and He has power over all things.}18 So a person’s ignorance of the attributes of God - Blessed and Most High - makes a person far from sensing his monitoring of God - the Most High - and if the servant does not watch his Lord - the Most High - he falls into disobedience and sins, and this is a reason for weak faith in God - the Most High. -. Second: Committing sins: Sins have great effects on the heart and on faith. It was narrated on the authority of Abu Hurairah - may God be pleased with him - that he said: The Prophet - may God’s prayers and peace be upon him - said: ((The adulterer does not commit adultery when he commits adultery while he is a believer, and he does not drink alcohol when he drinks while he is a believer, and he does not steal when he steals while he is a believer, and he does not plunder plunder in which people raise their eyes to him when he plunders it while he is a believer))19, so this is evidence that he did it. Sins weaken faith, and the meaning of his saying: ((and he is a believer)) means complete faith, and the intent is not to negate faith completely. Ibn Abd al-Barr - may God have mercy on him - said: “He means the one with complete faith, It was not intended to deny all faith from the one who did that; Evidenced by the consensus on the inheritance of the adulterer, the thief, and the drinker of alcohol if they pray towards the Qiblah, and assume the call to Islam from their believing relatives who believe in those conditions, and in their consensus on that with their consensus that the infidel does not inherit from the Muslim; The clearest evidence for the validity of our saying is that the one who commits sins lacks faith by doing that and is not an infidel20.” Imam al-Nawawi - may God have mercy on him - said: “The correct statement that the investigators said is that its meaning is: He does not commit these sins while he has complete faith. This is one of the expressions used to negate a thing and what is meant is to deny its perfection21.\" Al-Aini - may God have mercy on him - said: “What is meant by the hadith “He does not drink alcohol while he is a believer” is to deny the perfection of faith, not that it deviates from faith22.” And he said: “It contains a warning about all types of sins because they are either physical, such as adultery, or financial, either secretly, such as theft, or openly, such as looting, or mental, such as wine, for it removes it. It is stolen money.”23 Third: Preoccupation with the world until the heart becomes a slave to it - and God forbid -: From preoccupation with money or a wife and children, God - Blessed and Most High - says: {And know that your wealth and your children are only a test, and that with God is a reward. Great} 24, and He said: {Know that the life of this world is only play and amusement and adornment and boasting among you and an abundance of wealth and children, like a rain shower that descends. The unbelievers plant it, then it becomes turbid and you see it turn yellow, then it becomes rubble, and in the Hereafter it will be rewarded. A severe punishment and forgiveness from God and His satisfaction, and the life of this world is nothing but the enjoyment of delusion.}25 It is known that man is born to love money, children, and wife, and this has nothing to do with it if that does not distract him and distract him from obeying God - Blessed and Most High - God said: {Adorned to mankind is the love of desires, such as women and children, and hoisted heaps of gold and silver, and trained horses, and livestock, and crops. That is the enjoyment of the life of this world, and with God is the best of return.}26 If that distracted him from obeying God - Blessed and Most High - then his wealth, his children and his wife would be enemies before God - Blessed and Most High - God said: {O you who have believed! Indeed, among your wives and your children are enemies to you, so beware of them. Pardon, pardon, and forgive, for God is Forgiving, Merciful.}27. Fourth: Leaving obedience: Leaving obedience is a reason for a lack of faith. If obedience is obligatory and he leaves it without an excuse, then it is a deficiency for which he will be blamed and punished. In fact, some of it may lead to disbelief - God forbid - such as abandoning prayer, even if obedience is not obligatory like voluntary prayers, or obligatory but left with an excuse. It is a deficiency that cannot be blamed. Fifth: Excessive eating, sleeping, staying up late, and talking about things that do not concern him: Excessive eating leads to excessive sleep, inattention, and laziness in performing obediences, and excessive sleeping and staying up late causes him to fall asleep from prayers, especially the dawn prayer, and talking excessively about things that do not concern him, even if it is permissible, will lead him to what is forbidden, so he will fall into backbiting and sins. We ask God for wellness. Sixth: Staying away from seeking legal knowledge, abandoning the Qur’an, and not reading the biographies of the predecessors and the faith-based books that revive the heart: This is because seeking knowledge and reading the Qur’an makes the Muslim recognize the greatness of God - Blessed and Most High - and what he is obligated to do towards his Creator - Glory be to Him and praise be to Him - and by reading the biographies of the predecessors, activity and enthusiasm are energized to worship God - Blessed and Most High -, so if a person does more worship, his faith increases. Seventh: Not mentioning God - Blessed and Most High - frequently: it is a reason for weak faith, for the remembrance of God revives the hearts and reassures them. God said: {Those who believe and whose hearts are reassured by the remembrance of God. Indeed, in the remembrance of God are hearts reassured}28, and He said: {Has not the time come for those who have believed that their hearts should submit to the remembrance of God and what has been sent down of the truth, and not be like those who were given the Scripture before? Their hearts have hardened, and many of them are transgressors}29, and turning away from the remembrance of God. A reason for a straitened life - God forbid - God said: {And whoever turns away from My remembrance - indeed, for him will be a straitened living, and We will raise him blind on the Day of Resurrection}30.\n\nThis is a number of reasons that weaken faith, and what a Muslim must do is that if he feels that his faith is weak and weak, he should do many voluntary acts of worship and adhere to the obligatory prayers, and often remember God - Blessed and Most High -. The matter of renewing faith has been proven in the hadith of Abdullah bin Amr bin Al-Aas - may God be pleased with them both - who said: The Messenger of God - may God bless him and grant him peace - said: ((Indeed, faith is created in the inside of one of you just as a garment creates character, so ask God to renew faith in your hearts))31.\n\nWe ask God - Blessed and Most High - to help us obey Him and His Messenger - may God bless him and his family and grant them peace - and to increase our faith in strength and stability until we meet Him, with His blessings and generosity. Praise be to God, Lord of the Worlds, and may blessings and peace be upon our Prophet Muhammad, his family and all his companions."
  },
  {
    "number": "مظاهر ضعف الإيمان",
    "text": "",
    "label": "لضعف الإيمان العديد من المظاهر، وهي كما يأتي:\n\nارتكاب المعاصي واستصغارها والإصرار عليها، ممّا يؤدي إلى قسوة القلب وعدم الخوف من الله -تعالى-، وبالتالي إلى ضعف الإيمان، وقد قرن النبي -عليه الصلاة والسلام- بين المعصية وضعف الإيمان بقوله: (لَا يَزْنِي الزَّانِي حِينَ يَزْنِي وَهو مُؤْمِنٌ، وَلَا يَسْرِقُ حِينَ يَسْرِقُ وَهو مُؤْمِنٌ، وَلَا يَشْرَبُ حِينَ يَشْرَبُهَا وَهو مُؤْمِنٌ).[٢٤]\n\nالتثاقل عن الطاعات والتقاعس عنها؛ كتأخير الصلوات، وهجران القُرآن، والغفلة عن ذكر الله -تعالى- وغير ذلك، والميل إلى الراحة والشهوات، وقد ذكرها الله -تعالى- أنّها من صفات المُنافقين بقوله: (إِنَّ الْمُنَافِقِينَ يُخَادِعُونَ اللَّـهَ وَهُوَ خَادِعُهُمْ وَإِذَا قَامُوا إِلَى الصَّلَاةِ قَامُوا كُسَالَى يُرَاءُونَ النَّاسَ وَلَا يَذْكُرُونَ اللَّـهَ إِلَّا قَلِيلًا).[٢٥]\n\nالتنافس في الدُنيا، والانشغال بها، والانخداع بزخرفها؛ ممّا يؤدّي إلى تعلّق القلب بها.\n\nظُهور الأخلاق السيئة؛ كالكبر والحسد وغيرها، وقد بيّن النبي -عليه السلام- أنّها من علامات نقص الإيمان، بقوله: (لَا يُؤْمِنُ أحَدُكُمْ، حتَّى يُحِبَّ لأخِيهِ ما يُحِبُّ لِنَفْسِهِ).[٢٦]\n\nالاستئناس بالمعاصي ومُجالسة أصحابها؛ وذلك يؤثّر على الإيمان وعلى القلب فيمرضه.\n\nالشعور بقسوة القلب بحيث لا يتأثّر بشيء، وعدم إتقان العبادات؛ كشرود الذهن في الصلاة وعند تلاوة القُرآن، والفزع عند المصائب، وعدم الاهتمام بقضايا المُسلمين، أو التفاعل معها سواءً بالدعاء أو بالصدقة، والشحّ والبخل.",
    "number-en": "Manifestations of weak faith",
    "label-en": "Weak faith has many manifestations, which are as follows:\n\nCommitting sins, belittling them, and insisting on them, which leads to hardness of heart and lack of fear of God Almighty, and thus to weak faith. The Prophet, peace and blessings be upon him, linked sin with weak faith by saying: (The adulterer does not commit adultery when he commits adultery while he is a believer, and he does not steal when he steals while he is a believer.) He is a believer, and he does not drink it while he drinks it while he is a believer.[24]\n\nHesitation in obedience and failure to perform it; Such as delaying prayers, abandoning the Qur’an, neglecting to remember God Almighty, etc., and inclination toward comfort and desires. God Almighty mentioned these as being among the characteristics of hypocrites, saying: (Indeed, the hypocrites deceive God, and He is deceiving them, and when they rise up to They stood up lazily during prayer, showing off to the people, but not mentioning God except a little.)[25]\n\nCompeting in this world, being preoccupied with it, and being deceived by its embellishments; Which leads to the heart becoming attached to it.\n\nThe appearance of bad morals; Such as arrogance, envy, etc., and the Prophet - peace be upon him - explained that they are signs of a lack of faith, saying: (None of you believes until he desires for his brother what he desires for himself).[26]\n\nRefusing to commit sins and sitting with those who commit them; This affects faith and the heart and makes it sick.\n\nFeeling so hard-hearted that it is not affected by anything, and not mastering acts of worship; Such as absent-mindedness during prayer and when reciting the Qur’an, panic at calamities, lack of interest in Muslim issues, or interaction with them, whether through supplication or charity, and stinginess and miserliness."
  },
  {
    "number": "كيف تقوي الإيمان",
    "text": "",
    "label": "الإيمان بالله تعالى هو ذلكم الرابط الثمين الذي يربط العبد بالله، ويجعله دائم الصلة به والتفكر في نعمه وآلائه.. وبدون ذلك الرباط يوكل الإنسان لنفسه التي لا تكاد تسلمه إلا إلى المهالك.\n والايمان معناه لا يقتصر على التصديق الجازم بوجود الله وتعالى وملائكته ورسوله واليوم الآخر والقضاء والقدر  فحسب، بل يزيد على ذلك تغيّر السلوك والأخلاق بحسب الاعتقاد، لذا  فقد عرّف العلماء الإيمان بأنّه اعتقاد بالقلب يؤكّد استقراره عمل الجوارح وقول اللسان.\nكيف تقوي إيمانك بالله؟\nتقوية الصلة بالله بأداء الطاعات والبعد عن المنككرات بعامة هي الطريقة المثلى لزيادة الإيمان الذي يزيز بالطاعة ويل بالمعصية، وفصّل العلماء في أسباب زيادة الإيمان في القلب فقالوا:\n1-تتأتى زيادة الإيمان بمعرفة الله -تعالى- بأسمائه وصفاته.\n فمن تجلّت له معرفة الله -تعالى- وتعرّف على أسمائه وصفاته فإنّ ذلك يزيد الخشوع واليقين في قلبه، وبالتالي يزيد ويفيض إيمانه بالله تعالى.\n2 -طلب العلم؛ فطلب العلم النافع يُوصل صاحبه إلى الزيادة في الخشوع والمعرفة التي تزيد الإيمان في القلب، قال الله تعالى: (إِنَّمَا يَخْشَى اللَّهَ مِنْ عِبَادِهِ الْعُلَمَاءُ)، وأحسن العلوم علوم الحلال والحرام والأخلاق والقرآن.\n 3-الإكثار من قراءة القرآن الكريم وتعلّمه وتدبّره؛ فالقرآن الكريم كلام الله -تعالى- ولا يوجد شيء أنفع للمسلم من تلاوته وتدبّره ممّا يوصل الإنسان إلى القيام بأوامر ربه ومناجاته والشعور بقُربه.\n4- التفكّر في خلق الله تعالى؛ فمَن يُمعن النظر في آيات الله -تعالى- في الخلق يُدرك قدره وحقيقة نفسه، وقدرة الله -تعالى- وعظمته في إيجاد التناسق والتوازن في الكون، ممّا يزيد الإيمان بالله -تعالى- وعظمته.\n5-ذكرُ الله تعالى عامة؛ فذكر المسلم لربّه يُطمئن القلب ويحييه، حيث قال عمير بن حبيب حين سُئل عن زيادة الإيمان ونقصانه: (إذا ذكرنا ربّنا وخشِيناه فذلك زيادته، وإذا غفلنا ونسِيناه وضيّعنا فذلك نقصانه).\n6- الإكثار من الأعمال الصالحة والطاعات؛ فمن يُمعن النظر يجد أنّ الله -تعالى- قرن بين الإيمان والعمل الصالح مِراراً، وقرن كذلك بين الإيمان وهنيء العيش وراحته، ومن ذلك قول الله تعالى: (مَنْ عَمِلَ صَالِحاً مِنْ ذَكَرٍ أَوْ أُنثَى وَهُوَ مُؤْمِنٌ فَلَنُحْيِيَنَّهُ حَيَاةً طَيِّبَةً وَلَنَجْزِيَنَّهُمْ أَجْرَهُمْ بِأَحْسَنِ مَا كَانُوا يَعْمَلُونَ).\n7-تجنّب المعاصي؛ فالمعاصي تُنقص الإيمان بخلاف الطاعات والصالحات، وقد يتنافس الأصحاب على طاعةٍ ما فتكون الصحبة بذلك سبباً لزيادة الإيمان لكليهما.\n8-كثرة الدعاء والتضرّع إلى الله تعالى؛ بالثّبات والهداية، حيث أرشد الرّسول -صلّى الله عليه وسلّم- إلى ذلك بقوله: (إنَّ الإيمانَ لَيَخْلَقُ في جَوْفِ أحدِكُمْ كَما يَخلَقُ الثّوبُ، فاسْألُوا اللهَ -تعالَى- أنْ يُجَدِّدَ الإيمانَ في قُلوبِكمْ).",
    "number-en": "How to strengthen faith",
    "label-en": "Faith in God Almighty is that precious bond that connects the servant to God, and makes him constantly connected to Him and contemplating His blessings and blessings. Without that bond, a person is entrusted to himself, which almost delivers him to perdition.\n Faith means not only the firm belief in the existence of God Almighty, His angels, His Messenger, the Last Day, and predestination, but more than that, it changes behavior and morals according to belief. Therefore, scholars have defined faith as a belief in the heart whose stability is confirmed by the actions of the limbs and the words of the tongue.\nHow to strengthen your faith in God?\nStrengthening the connection with God by performing obedience and staying away from evil in general is the best way to increase faith, which grows with obedience and woe with disobedience. The scholars detailed the reasons for increasing faith in the heart, saying:\n1- Increased faith comes from knowing God Almighty through His names and attributes.\n Whoever has the knowledge of God Almighty clear to him and recognizes His names and attributes, this increases humility and certainty in his heart, and thus his faith in God Almighty increases and overflows.\n2- Seeking knowledge; Seeking useful knowledge leads its possessor to an increase in humility and knowledge that increases faith in the heart. God Almighty said: (Only those of His servants fear God are the scholars), and the best sciences are the sciences of the permissible and forbidden, morals, and the Qur’an.\n 3-Read, learn and reflect on the Holy Qur’an a lot. The Noble Qur’an is the word of God Almighty, and there is nothing more beneficial for a Muslim than its recitation and contemplation, which leads a person to carry out the commands of his Lord, communicate with him, and feel his closeness.\n4- Contemplating the creation of God Almighty; Whoever carefully considers the signs of God Almighty in creation realizes his destiny and the truth of himself, and the power and greatness of God Almighty in creating harmony and balance in the universe, which increases faith in God Almighty and his greatness.\n5-Remembrance of God Almighty in general; A Muslim’s remembrance of his Lord reassures the heart and revives it, as Umair bin Habib said when he was asked about the increase and decrease of faith: (If we remember our Lord and fear Him, that is its increase, and if we neglect, forget, and neglect it, that is its decrease).\n6- Increase good deeds and obedience; Whoever looks closely will find that God Almighty has repeatedly linked faith with good deeds, and has also linked faith with a comfortable and comfortable life, and from that is the saying of God Almighty: (Whoever does righteousness, whether male or female, and is a believer - We will surely give him a good life.) And We will certainly give them their reward according to the best of what they used to do.)\n7-Avoid sins; Sins decrease faith, unlike obedience and good deeds. Companions may compete for an act of obedience, so companionship thus becomes a reason for increasing faith for both of them.\n8- Frequent supplication and supplication to God Almighty. With steadfastness and guidance, as the Messenger - may God bless him and grant him peace - guided this by saying: (Indeed, faith is created within one of you just as a garment is created, so ask God - the Almighty - to renew faith in your hearts)."
  },
  {
    "number": "ادعية لتقوية الايمان",
    "text": "",
    "label": "اللهم إني أعوذ بك من العجز والكسل والجبن والهرم والبخل ، وأعوذ بك من عذاب القبر ومن فتنة المحيا والممات .\nالله أهدني وسددني ، اللهم إني أسالك الهدى والسداد.\n*********\nاللهم إني أعوذ بك من منكرات الأخلاق ، والأعمال والأهواء. اللهم إني أعوذ بك من قلب لا يخشع ، ودعاء لا يُسمع ، ومن نفس لا تشبع ، ومن علم لا ينفع . أعوذ بك من هؤلاء الأربع .\n*********\nاللهم إني أعوذ بك من زوال نعمتك ، وتحول عافيتك ، وفجأة نقمتك ، وجميع سخطك .\nاللهم إني أعوذ بك من جار السوء في الدار المقامة ، فإن جار البادية يتحول .\nاللهم إني أسألك علماً نافعاً ورزقاً طيباً متقبلاً .\n*********\nاللهم إني أعوذ بك من شر ما عملت ومن شر ما لم أعمل .\nاللهم إني أعوذ بك من يوم السوء ، ومن ليلة السوء ، ومن ساعة السوء ، ومن صاحب السوء ، ومن جار السوء في دار المقامة .\n*********\nاللهم أكثر مالي وولدي وبارك لي فيما أعطيتني .\nاللهم إني أسألك يا الله بأنك الواحد الأحد الصمد الذي لم يلد ولم يولد ولم يكن له كفواً أحد أن تغفر لي ذنوبي إنك أنت الغفور الرحيم .\n*********\nلا إله إلا الله العظيم الحليم ، لا إله إلا الله رب العرش العظيم ، لا إله إلا الله رب السماوات ورب الأرض ورب العرش الكريم . اللهم إني أسألك الجنة وأستجير بك من النار .\n*********\nاللهم رحمتك ارجو فلا تكلني إلى نفسي طرفة عين ، وأصلح لي شأني كله ، لا إله إلا أنت .\nاللهم طهرني من الذنوب والخطايا اللهم نقني منها كما ينقى الثوب الأبيض من الدنس .\nاللهم طهرني بالثلج والبرد والماء البارد.\n*********\nلا إله إلا أنت سبحانك إني كنت من الظالمين .\nاللهم إني أسالك بأن لك الحمد لا إله إلا أنت (وحدك لا شريك لك) المنان يا بديع السموات والأرض ياذا الجلال والإكرام يا حي ياقيوم إني أسألك (الجنة وأعوذ بك من النار).\n*********\nاللهم إنك عفو كريم تحب العفو فاعف عني .\nاللهم ارزقني حُبك وحُب من ينفعني حُبّهُ عندك ، اللهم مارزقتني مما أُحبُ فاجعله قوة لي فيما تحب ، اللهم ما زويت عني مما أُحب فاجعله فراغاً لي فيما تحب.\n*********\nاللهم إني اسألك عيشة نقية وميتة سوية ومرداً غير مخزٍ ولا فاضح.\nاللهم قنعني بما رزقتني وبارك لي فيه واخلف عليَّ كل غائبة لي بخير .\nاللهم ألهمني رشدي وأعذني من شر نفسي .\n*********\nاللهم إني أسألك العافية في الدنيا ولآخرة .\nاللهم متعني بسمعي وبصري واجعلهما الوارث منيِّ وانصرني على من يظلمُني ، وخذ منه بثأري .\nاللهم أعني علي ذكرك وشكرك وحسن عبادتك.\n*********\nاللهم احسن عاقبتنا في الأمور كلها ، وأجرنا من خزي الدنيا وعذاب الآخرة .\n*********\nاللهم إني أعوذ بك من العجز والكسل والبخل والهرم وعذاب القبر ، اللهم آت نفسي تقواها زكها انت خير من زكاها ، أنت وليها ومولاها .\nاللهم إني أعوذ بك من علم لا ينفع ، ومن قلب لا يخشع ، ومن نفس لا تشبع ، ومن دعوة لا يستجاب لها .\n*********\nاللهم إني أسألك من خير ما سألك منه نبيك محمد صلى الله عليه وسلم ونعوذ بك من شر ما استعاذ منه نبيك محمد صلى الله عليه وسلم ، وأنت المستعان وعليك البلاغ . ولا حول ولا قوة إلا بالله .\nاللهم إني أسألك علماً نافعاً وأعوذ بك من علم لا ينفع.\n*********\nاللهم ربَّ جبرائيل وميكائيل وربَّ إسرافيل أعوذ بك من حر النار ومن عذاب القبر .\nاللم إني أعوذ بك من شر سمعي ، ومن شر بصري ، ومن شر لساني ، ومن شر قلبي ومن شر منيي.\n*********\nاللهم إني أعوذ بك من العجز والكسل والجبن والبخل والهرم والقسوة والغفلة والعيلة والذلة والمسكنة ، وأعوذ بك من الفقر والكفر والفسوق والشقاق والنفاق والسمعة والرياء ، وأعوذ بك من الصمم والبكم والجنون والجزام والبرص وسييء الأسقام .\n*********\nاللهم اجعل أوسع رزقك عليّ عند كبر سني ، وانقطاع عمري .\nاللهم إني أسألك بأني اشهد أنك أنت الله لا إله إلا أنت الأحد الصمد الذي لم يلد ولم يولد ولم يكن له كفواً أحد .\n*********\nرب أعني ولا تعن عليّ ، وانصرني ولا تنصر عليّ وامكر لي ولا تمكر عليّ ، وأهدني ويسر الهدي إليّ ، وانصرني على من بغى عليّ ، رب اجعلني لك شكاراً لك ذكاراً ، لك رهَاباَ ، لك مطواعاً إليك مخبتاَ أوّاهاً منيباَ ، رب تقبل توبتي ، واغسل حوبتي ، وأجب دعوتي ، وثبت حُجتي واهد قلبي ، وسدد لساني ، وأسْلُلْ سخيمة قلبي .\n*********\nاللهم إني أعوذ بك من البرص والجنون والجذام ، ومن سيئ الأسقام .\nاللهم قني شر نفسي واعزم لي على ارشد أمري ، اللهم اغفر لي ما اسررتُ وما أعلنتُ ، وما أخطأتُ وما عملتُ وما جهلتُ.\n*********\nاللهم حاسبني حساباً يسيراَ .\nاللهم إني أسألك فعل الخيرات وترك المنكرات حُب المساكين ، وأن تغفر لي وترحمني ، وإذا أردت فتنة قوم فتوفني غير مفتون ، وأسألك حُبّك ، وحب من يُحبِك ، وحُب عمل يقربني إلى حُبك .\n*********\nاللهم فقهني في الدين .\nاللهم احفظني بالإسلام قائماً ، واحفظني بالإسلام قاعداً واحفظني بالإسلام راقداً ولا تشمت بي عدواً ولا حاسداً . اللهم إني أسألك من كل خير خزائنه بيدك ، وأعوذ بك من كل شر خزائنه بيدك .\n*********\nاللهم إني أعوذ بك من الجبن وأعوذ بك من البخل ، وأعوذ بك من أن أُرد إلى أرذل العمر ، وأعوذ بك من فتنة الدنيا وعذاب القبر .\nاللهم جنبني منكرات الأخلاق ، والأهواء ، والأعمال ، والأدواء.\n*********\nاللهم أغفر لي خطيئتي وجهلي وإسرافي في أمري ، ما أنت أعلم به مني . اللهم اغفر لي هزلي وجدي ، وخطئي وعمدي وكل ذلك عندي .\nاللهم إني أعوذ بك من غلبة الدَّين ، وغلبة العدوِّ ، وشمائة الأعداء .\n*********\nاللهم إني ظلمت نفسي ظلماً كثيرا ولا يغفر الذنوب إلا أنت . فاغفر لي مغفرة من عندك ، وارحمني إنك أنت الغفور الرحيم .\nاللهم اغفر لي واهدني وارزقني وعافني ، أعوذ بالله من ضيق المقام يوم القيامة .\n*********\nرب اغفر لي وتب عليّ إنك انت التواب الغفور.\nاللهم لك أسلمت وبك آمنت وعليك توكلت وإليك أنبت وبك خاصمت .\nاللهم إني أعوذ بعزتك لا إله إلا أنت أن تضلني أنت الحي الذي لا يموت والجن والإنس يموتن.\n*********\nاللهم إنّا نسألك موجبات رحمتك ، وعزائم مغفرتك ، والسلامة من كل إثم ، والغنيمة من كل بر ، والفوز بالجنة والنجاة من النار.\nاللهم إني أعوذ بك من البخل والجبن وسوء العمر وفتنة الصدر وعذاب القبر .\n*********\nاللهم مصرف القلوب صرف قلوبنا على طاعتك .\nاللهم إني أعوذ بك من التردي والهدم والغرق والحرق ، وأعوذ بك أن يتخبطني الشيطان عند الموت ، وأعوذ بك أن أموت في سبيلك مُدْبراً وأعوذ بك ان أموت لديغا .\n*********\nاللهم إني أعوذ بك أن اشرك بك وأنا أعلم وأستغفرك لما لا اعلم .\nاللهم إني أعوذ بك من الجوع فإنه بئس الضجيع ، واعوذ بك من الخيانة فإنها بئست البطانة .\n*********\nاللهم اصلح لي ديني الذي هو عصمة أمري ، واصلح لي دنياي التي فيها معاشي واصلح لي آخرتي التي فيها معادي ، واجعل الحياة زيادة لي في كل خير ، واجعل الموت راحة لي من كل شر .\n*********\nاللهم ألف بين قلوبنا ، واصلح ذات بيننا ، واهدنا سبل السلام ، ونجنا من الظلمات إلى النور , وجنبنا الفواحش ما ظهر منها ومابطن ، وبارك لنا في أسماعنا وأبصارنا وقلوبنا وأزواجنا وذرياتنا ، وتب علينا إنك أنت التواب الرحيم ، واجعلنا شاكرين لنعمك مثنين بها عليك قابلين لها وأتممها علينا .\n*********\nاللهم آتنا في الدنيا حسنة وفي الآخرة حسنة وقنا عذاب النار .\nاللهم إني أعوذ بك من الفقر والقِلة والذِلة ، وأعوذ بك من أن أَظلم أو أَظلم ، يا مُقلب القلوب ثبت قلبي على دينك .\n*********\nاللهم إني أعوذ بك من شر ما عملت ، ومن شر ما لم أعمل .\nاللهم إني أعوذ بك من يوم السوء ، ومن ليلة السوء ، ومن ساعة السوء ، ومن صاحب السوء ، ومن جار السوء في دار المقامة.\n*********\nلا إله إلا أنت سبحانك إني كنت من الظالمين . اللهم إني أسألك بان لك الحمد لا إله إلا أنت وحدك لا شريك لك المنان (يا) بديع السماوات والأرض ياذا الجلال والإكرام ياحي يا قيوم إني اسالك الجنة وأعوذ بك من النار .\n*********\nاللهم إني أعوذ بك من العجز والكسل والجبن والهرم والبخل وأعوذ بك من عذاب القبر ومن فتنة المحيا والممات . اللهم اهدني وسددني ، اللهم إني أسألك الهدى والسداد .\n*********\nاللهم أكثر مالي وولدي وبارك لي فيما اعطيتني ، اللهم إني أسالك يالله بأنك الواحد الأحد الصمد الذي لم يلد ولم يولد ولم يكن له كفوا أحد أن تغفر لي ذنوبي إنك أنت الغفور الرحيم .\n*********\nاللهم إنك عفو كريم تحب العفو فاعف عني . اللهم ارزقني حبك وحب من ينفعني حبه عندك . اللهم وارزقني مما احب فاجعله قوة لي فيما تحب . اللهم ما زويت عني مما احب فاجعله فراغاً لي فيما تحب.\n*********\nاللهم إني أعوذ بك من منكرات الأخلاق والأعمال والأهواء . اللهم إني أعوذ بك من قلب لا يخشع ودعاء لا يسمع ومن نفسع لا تشبع ومن علم لا ينفع .\nاعوذ بك من هؤلاء الأربع .\n*********\nلا إله إلا الله العظيم الحليم ، لا إله إلا الله رب العرش العظيم لا إلا الله رب السموات ورب الأرض ورب العرش الكريم .\nالله إني أسالك الجنة وستجير بك من النار .\n*********\nاللهم إني أسألك عيشةً نقية وميتة سوية ومرداً غير مخز ولا فاضح.\nاللهم قنعني بما رزقتني وبارك لي فيه واخلف على كل غائبة لي بخير . اللهم الهمني رشدي واعذني من شر نفسي .\n*********\nاللهم إني اعوذ من زوال نعمتك وتحول عافيتك وفجأة نقمتك ، وجميع سخطك. اللهم إني اعوذ بك من جار السوء في دار المقامة فإن جار البادية يتحول . اللهم إني اسالك علماً نافعاً ورزقاً طيباً ، وعملاً متقبلاً.\n*********\nاللهم رحمتك أرجو فلا تكلني إلى نفسي طرفة عين ، واصلح لي شأني كله ، لا إله إلا أنت ، طهرني من الذنوب والخطايا ، اللهم نقني منها كما ينقى الثوب الأبيض من الدنس ، اللهم طهرني بالثلج وبالبرد والماء البارد .\n*********\nاللهم إني أعوذ بك من العجز والكسل والجبن والبخل والهرم ، وعذاب القبر . اللهم أتي نفسي تقواها وزكها أنت خير من زكَّها ، أنت وليها ومولاها .\nاللهم إني أعوذ بك من علم لا ينفع ومن قلب لا يخشع ومن نفس لا تشبع ومن دعوة لا يستجاب لها",
    "number-en": "Prayers to strengthen faith",
    "label-en": "O God, I seek refuge in You from inability, laziness, cowardice, senility, and miserliness, and I seek refuge in You from the torment of the grave and from the trials of life and death.\nMay God guide me and guide me. Oh God, I ask you for guidance and payment.\n*********\nOh God, I seek refuge in You from evil morals, deeds and desires. Oh God, I seek refuge in You from a heart that is not humble, a supplication that is not heard, a soul that is not satisfied, and knowledge that is not beneficial. I seek refuge in You from these four.\n*********\nOh God, I seek refuge in You from the disappearance of Your grace, the change in Your well-being, the suddenness of Your vengeance, and all of Your anger.\nOh God, I seek refuge in You from the evil neighbor in the established house, for the neighbor of the desert is transformed.\nOh God, I ask you for useful knowledge and good and acceptable sustenance.\n*********\nOh God, I seek refuge in You from the evil of what I have done and from the evil of what I have not done.\nOh God, I seek refuge in You from a bad day, from a bad night, from a bad hour, from a bad friend, and from a bad neighbor in the abode of residence.\n*********\nOh God, increase my wealth and my children, and bless me with what you have given me. Oh God, I ask you, O God, that you are the One, the One, the Eternal, the One who did not give birth, nor was born, and there is no one equal to Him, to forgive me my sins. Indeed, you are the Forgiving, the Merciful.\n*********\nThere is no god but God, the Great, the Forbearing, there is no god but God, Lord of the Great Throne, there is no god but God, Lord of the heavens, Lord of the Earth, and Lord of the Noble Throne. Oh God, I ask You for Paradise and I seek refuge in You from Hell.\n*********\nOh God, I hope for your mercy, so do not leave me to myself for the blink of an eye, and set right all my affairs for me. There is no god but You.\nOh God, purify me from sins and sins. Oh God, purify me from them as a white garment is purified from filth.\nOh God, purify me with ice, cold, and cold water.\n*********\nThere is no god but You, Glory be to You. Indeed, I have been of the wrongdoers.\nOh God, I ask You that praise be to You, there is no god but You (You alone have no partner). Benevolence, O Creator of the heavens and the earth, O Possessor of majesty and honor, O Ever-Living, O Ever-Living. I ask You (Paradise and I seek refuge in You from Hell). *********\nO God, You are the Most Merciful and You love forgiveness, so forgive me.\nOh God, grant me your love and the love of those whose love will benefit me with you. Oh God, you have provided me with what I love, so make it strength for me in what you love. Oh God, whatever you have removed from me from what I love, make it a void for me in what you love.\n*********\nOh God, I ask you for a pure and healthy life and a return that is neither shameful nor scandalous.\nOh God, satisfy me with what You have provided for me, bless me with it, and grant me well-being for all my absences.\nOh God, inspire me with guidance and protect me from the evil of myself.\n*********\nOh God, I ask you for wellness in this world and the hereafter. Oh God, grant me pleasure with my hearing and sight, make them my heirs, grant me victory over those who oppress me, and take my revenge from him.\nOh God, help me to remember You, thank You, and worship You well.\n*********\nOh God, grant us the best punishment in all matters, and protect us from the shame of this world and the torment of the hereafter.\n*********\nOh God, I seek refuge in You from incapacity, laziness, miserliness, old age, and the torment of the grave. Oh God, grant my soul its piety. Purify it. You are better than those who purify it. You are its guardian and protector.\nOh God, I seek refuge in You from knowledge that is not useful, from a heart that is not humble, from a soul that is not satisfied, and from an invocation that is not answered. *********\nOh God, I ask you for the best of what your Prophet Muhammad, may God’s prayers and peace be upon him, asked you, and we seek refuge in You from the evil of which your Prophet Muhammad, may God’s prayers and peace be upon him, sought refuge from you. There is no power nor strength except in God.\nOh God, I ask You for useful knowledge and I seek refuge in You from knowledge that is of no benefit.\n*********\nO God, Lord of Gabriel and Michael, and Lord of Israfil, I seek refuge in You from the heat of the fire and from the torment of the grave.\nI seek refuge in You from the evil of my hearing, from the evil of my sight, from the evil of my tongue, from the evil of my heart and from the evil of my semen. *********\nO God, I seek refuge in You from incapacity, laziness, cowardice, miserliness, senility, cruelty, heedlessness, poverty, humiliation, and poverty, and I seek refuge in You from poverty, disbelief, immorality, discord, hypocrisy, reputation, and hypocrisy, and I seek refuge in You from deafness, mutism, madness, leprosy, leprosy, and bad diseases.\n*********\nOh God, make your provision abundant upon me as I grow old and my life ends.\nOh God, I ask you that I bear witness that you are God, there is no god but you, the One, the Eternal, the One who does not give birth or be born, and there is no one equal to Him. *********\nMy Lord, help me and do not help me, grant me victory and do not support me, scheme for me and do not plot against me, guide me and facilitate guidance for me, and grant me victory over those who transgress against me. My Lord, make me thankful to You, remembering You, fearful of You, obedient to You, hidden and sheltered, repentant. My Lord, accept my repentance, wash away my sins, answer my supplication, confirm my proof, and guide my heart. And restrain my tongue, and remove the greediness of my heart.\n*********\nOh God, I seek refuge in You from leprosy, madness, leprosy, and other bad diseases. O God, protect me from the evil of my soul and resolve for me to guide my affairs. O God, forgive me for what I have concealed and what I have declared, what I have sinned and what I have done and what I have been ignorant of.\n*********\nOh God, give me an easy account.\nOh God, I ask you to do good deeds and leave evil deeds out of love for the poor, and to forgive me and have mercy on me, and if you want to tempt a people, let me die without being tempted, and I ask you for your love, for the love of whoever loves you, and for the love of a deed that will bring me closer to your love.\n*********\nOh God, make me understand the religion.\nOh God, protect me with Islam while standing, protect me with Islam while sitting, protect me with Islam while lying down, and do not let any enemy or envier gloat over me. Oh God, I ask you from all the good that is stored in your hand, and I seek refuge in you from all the evil that is stored in your hand.\n*********\nOh God, I seek refuge in You from cowardice, I seek refuge in You from miserliness, I seek refuge in You from being sent back to the most miserable age, and I seek refuge in You from the temptation of this world and the torment of the grave.\nOh God, protect me from evil morals, whims, deeds, and diseases.\n*********\nOh God, forgive me for my sin, my ignorance, and my extravagance in my affairs, for you know better than me. Oh God, forgive me for my jest and seriousness, my mistakes and my intentionality, and all of that.\nOh God, I seek refuge in You from the dominance of debt, the dominance of the enemy, and the hatred of enemies.\n*********\nOh God, I have wronged myself greatly, and no one can forgive sins except You. So grant me forgiveness from You, and have mercy on me, for You are the Forgiving, the Merciful.\nO God, forgive me, guide me, provide for me, and grant me well-being. I seek refuge in God from a narrow position on the Day of Resurrection.\n*********\nMy Lord, forgive me and accept my repentance. You are the Forgiver.\nOh God, to You I have submitted, and in You I have believed, and in You I have put my trust, and to You I repent, and with You I have disputed. Oh God, I seek refuge in Your glory, there is no god but You, that You lead me astray, You are the Living One who does not die, and the jinn and humans die.\n*********\nOh God, we ask you for the reasons for your mercy, the assurances of your forgiveness, safety from every sin, the spoils of every righteousness, winning Paradise and salvation from Hell.\nOh God, I seek refuge in You from miserliness, cowardice, bad life, temptation in the chest, and torment in the grave.\n*********\nOh God, the channel of hearts, direct our hearts to obey you.\nOh God, I seek refuge in You from deterioration, demolition, drowning, and burning, and I seek refuge in You from Satan knocking me down upon death, and I seek refuge in You from dying in Your cause, retreating, and I seek refuge in You from dying as a destroyer. *********\nOh God, I seek refuge in You from associating partners with You while I know, and I seek Your forgiveness for what I do not know.\nOh God, I seek refuge in You from hunger, for it is miserable to be lost, and I seek refuge in You from betrayal, for it is miserable to be in.\n*********\nO God, improve for me my religion, which is the protection of my affairs, and improve for me my world, which contains my livelihood, and improve my afterlife, which contains my hostility, and make life an increase for me in all goodness, and make death a relief for me from all evil. *********\nOh God, reconcile our hearts, reconcile our souls, guide us to the paths of peace, deliver us from darkness to light, keep us away from immoral acts, both apparent and hidden, and bless our hearing, our sight, our hearts, our spouses, and our offspring, and accept our repentance, for You are the Most Merciful, and make us thankful for Your blessings, praising You for them, accepting them, and completing them for us.\n*********\nOh God, give us good in this world and good in the hereafter, and protect us from the torment of the Fire.\nOh God, I seek refuge in You from poverty, poverty, and humiliation, and I seek refuge in You from being wronged or wronged, O Turner of hearts, make my heart steadfast in Your religion. *********\nOh God, I seek refuge in You from the evil of what I have done, and from the evil of what I have not done.\nOh God, I seek refuge in You from a bad day, from a bad night, from a bad hour, from a bad friend, and from a bad neighbor in the abode of residence.\n*********\nThere is no god but You, Glory be to You. Indeed, I have been of the wrongdoers. Oh God, I ask You that praise be to You. There is no god but You alone, with no partner. You have the best of grace (O), Creator of the heavens and the earth, O Possessor of majesty and honor, O Ever-Living, O Sustaining One. I ask You for Paradise and I seek refuge in You from Hell. *********\nO God, I seek refuge in You from inability, laziness, cowardice, senility, and miserliness, and I seek refuge in You from the torment of the grave and from the trials of life and death. Oh God, guide me and guide me. Oh God, I ask you for guidance and payment.\n*********\nOh God, increase my wealth and my children and bless me with what You have given me. Oh God, I ask you, O God, that you are the One, the One, the Eternal, the One who did not give birth, nor was born, and there is no one equal to Him, to forgive me my sins. Indeed, you are the Forgiving, the Merciful.\n*********\nO God, You are the Most Merciful and You love forgiveness, so forgive me. Oh God, grant me your love and the love of those whose love for you will benefit me. Oh God, grant me what I love, so make it strength for me in what you love. Oh God, what you have removed from me from what I love, make it a free space for me in what you love.\n*********\nOh God, I seek refuge in You from evil morals, deeds, and desires. Oh God, I seek refuge in You from a heart that is not humble, from a supplication that is not heard, from a soul that is never satisfied, and from knowledge that is not beneficial.\nI seek refuge in You from these four.\n*********\nThere is no god but God, the Great, the Forbearing. There is no god but God, Lord of the Great Throne. There is no god but God, Lord of the heavens, Lord of the Earth, and Lord of the Noble Throne.\nGod, I ask you for Paradise and He will protect you from Hell.\n*********\nOh God, I ask you for a pure and healthy life and a return that is neither shameful nor scandalous. Oh God, satisfy me with what You have provided for me, bless me with it, and grant all my absences well. Oh God, inspire me with guidance and protect me from the evil of myself.\n*********\nOh God, I seek refuge from the disappearance of your blessings, the change in your well-being, and the suddenness of your vengeance, and all of your anger. Oh God, I seek refuge in You from the evil neighbor in the residence, for the neighbor of the desert is transformed. Oh God, I ask you for useful knowledge, good provision, and acceptable deeds. *********\nOh God, I hope for your mercy, so do not leave me to myself for the blink of an eye, and set right all my affairs for me. There is no god but You. Purify me from sins and sins. Oh God, purify me from them as a white garment is purified from filth. Oh God, purify me with snow, cold, and cold water.\n*********\nOh God, I seek refuge in You from inability, laziness, cowardice, miserliness, senility, and the torment of the grave. Oh God, give my soul piety and purify it. You are the best of those who purify it. You are its guardian and protector.\nO God, I seek refuge in You from knowledge that is not beneficial, from a heart that is not humble, from a soul that is not satisfied, and from an invitation that is not answered."
  }
]