[
  {
    "number": "تعريف الجنة",
    "text": "",
    "label": "الجَنَّة في اللغة هي البُسْتان، ومنه الجَنّات، وتصغيرها جنينة، والعرب تسمّي النخيل جَنَّة، والجَنَّةُ الحَديقةُ ذات الشجر والنخل، وجمعها جِنان، وفيها تخصيص، ويقال للنخل وغيرها.[1] والكلمة مشتقة من جَنَّ أي سَتَرَ وأظْلَمَ وخَفَى. سميت بذلك لسترها الأرض بظلالها. وقد وردت بهذا المعنى في سورة الكهف مثلا في الآية:   وَاضْرِبْ لَهُمْ مَثَلًا رَجُلَيْنِ جَعَلْنَا لِأَحَدِهِمَا جَنَّتَيْنِ مِنْ أَعْنَابٍ وَحَفَفْنَاهُمَا بِنَخْلٍ وَجَعَلْنَا بَيْنَهُمَا زَرْعًا \n\nويقصد عادة في السياق العام «تلك الجنة التي وعد الله عباده بالغيب» وهي نقيض النار. والجنة مصطلح للدلالة على مكان فيه رخاء ونعيم وحياة رغيدة كاملة الملذات.\n\nالجنة في العقيدة الإسلامية:\nلقد ورد في القرآن الكثير من الآيات التي تشير إلى الجنة وهي بالتحديد 66 آية. ووردت كمسكن للصالحين والعابدين الله وحده لاشريك له يؤمن المسلمون بأنها الحياة الخالدة في الجنة دار النعيم في الآخرة وهي حياة لا موت بعدها. قال الله تعالى:   مَثَلُ الْجَنَّةِ الَّتِي وُعِدَ الْمُتَّقُونَ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ أُكُلُهَا دَائِمٌ وَظِلُّهَا تِلْكَ عُقْبَى الَّذِينَ اتَّقَوْا وَعُقْبَى الْكَافِرِينَ النَّارُ \n\nمعني الجنة في الإسلام:\nيؤمن المسلمون أن في الجنة أنهارًا وخضرة وفواكه وثمارًا دانية وأشجارًا كثيرة. وفيها أكل وشرب وكل ما تشتهيه النفس كما ذكر في القرآن، وكما قال رسول الله صلى الله عليه وسلم: \"إن في الجنة ما لا عين رأت ولا أذن سمعت ولا خطر على قلب بشر\". لذلك فهم يتبعون أوامر دينهم من آداء الصلاة والصيام ومساعدة المحتاجين بدفع الزكاة والحج ونصرة المظلوم وفعل الصالحات ليرضى عنهم الله ويدخلهم الجنة.                      ",
    "number-en": "Definition of heaven",
    "label-en": "Paradise in the language is the garden, and it includes gardens, and its diminutive form is garden. The Arabs call palm trees a garden, and paradise is the garden with trees and palm trees, and its plural is jinan, and it has a specification, and it is said for palm trees and others. [1] The word is derived from jinn, which means concealment, darkness, and concealment. It was called that because it covers the earth with its shadows. It was mentioned in this sense in Surah Al-Kahf, for example, in the verse: And present to them an example of two men: We made for one of them two gardens of grapes, and surrounded them with palm trees, and placed between them crops. \n\nIn the general context, it usually means “that Paradise which God promised His servants in the unseen,” which is the opposite of Hell. Paradise is a term to denote a place of prosperity, bliss, and a comfortable life full of pleasures.\n\nHeaven in the Islamic faith:\nThere are many verses in the Qur’an that refer to Paradise, specifically 66 verses. It is mentioned as a dwelling place for the righteous and those who worship God alone with no partner. Muslims believe that it is the eternal life in Paradise, the abode of bliss in the afterlife, and it is a life after which there is no death. God Almighty said: The likeness of Paradise which the righteous are promised, beneath which rivers flow; its food is everlasting, and its shadow is the end of those who fear and the afterward. The unbelievers are the Fire \n\nThe meaning of heaven in Islam:\nMuslims believe that there are rivers, greenery, fruits, low-hanging fruits, and trees in Paradise. It contains food and drink and everything that the soul desires, as mentioned in the Qur’an, and as the Messenger of God, may God bless him and grant him peace, said: “Indeed, in Paradise there is what no eye has seen, no ear has heard, and no human heart has ever thought of.” Therefore, they follow the orders of their religion, such as performing prayers, fasting, helping the needy, paying zakat, performing Hajj, supporting the oppressed, and doing good deeds, so that God will be pleased with them and admit them to Paradise."
  },
  {
    "number": "درجات الجنة",
    "text": "",
    "label": "درجات الجنة\tعدل\nفي الجنة مائة درجة ما بين كل درجتين كما بين الأرض والسماء، أعلاها الفردوس. روى مسلم بن الحجاج في صحيحه من حديث المغيرة بن شعبة رضي الله عنه أن النبي صلى الله عليه وسلم قال: «سأل موسى بن عمران ربه جل وعلا وقال: يا رب! ما أدنى أهل الجنة منزلة؟ فقال الله جل وعلا: يا موسى! ذلك رجل يجيء بعدما أدخل أهل الجنة الجنة فيقال له: ادخل الجنة، فيقول: يا رب! كيف وقد نزل الناس منازلهم وأخذوا أخذاتهم؟ فيقول الله جل وعلا: أما ترضى أن يكون لك مثل مُلْك مَلِك من ملوك الدنيا؟ فيقول العبد: رضيت يا رب! رضيت يا رب! فيقول الرب: لك ذلك ومثله ومثله ومثله ومثله فيقول العبد في الخامسة: رضيت يا رب! رضيت يا رب! فيقول الرب جل وعلا: لك ذلك وعشرة أمثاله معه، ولك فيها ما اشتهت نفسك، ولذت عينك».\n\nوقال أحمد : حدثنا فزارة، أخبرني فليح، عن هلال - يعني ابن علي - عن عطاء، عن أبي هريرة، أن رسول الله ﷺ قال: «إن أهل الجنة ليتراءون في الجنة كما تراءون - أو ترون - الكوكب الدري الغابر في الأفق، الطالع، في تفاضل الدرجات. \" قالوا: يا رسول الله، أولئك النبيون؟\" قال: بلى، والذي نفسي بيده، وأقوام آمنوا بالله وصدقوا المرسلين». قال الحافظ الضياء: وهذا على شرط البخاري.",
    "number-en": "Degrees of heaven",
    "label-en": "The degrees of Paradise are fair\nIn Paradise there are a hundred levels, the distance between every two levels is as between the earth and the sky, the highest of which is Paradise. Muslim bin Al-Hajjaj narrated in his Sahih from the hadith of Al-Mughirah bin Shu’bah, may God be pleased with him, that the Prophet, may God’s prayers and peace be upon him, said: “Musa bin Imran asked his Lord, the Almighty, and said: O Lord! What is the lowest status among the people of Paradise? Then God Almighty said: O Moses! That is a man who comes after the people of Paradise have entered Paradise, and it is said to him: Enter Paradise, and he says: O Lord! How did people come down to their homes and take their belongings? Then God Almighty says: Aren’t you satisfied to have the kingdom of one of the kings of the world? Then the servant says: I am satisfied, O Lord! You are satisfied, Lord! Then the Lord says: You have that, and the like, and the like, and the like, and the like. Then the servant says at the fifth: You are satisfied, O Lord! You are satisfied, Lord! Then the Lord Almighty says: You get that and ten times more like it, and you get in it whatever your soul desires and what pleases your eye.\n\nAhmad said: Fazara told us, Falih told me, on the authority of Hilal - meaning Ibn Ali - on the authority of Ata’, on the authority of Abu Hurairah, that the Messenger of God, peace and blessings of God be upon him, said: “The people of Paradise will be seen in Paradise as you see - or see - the pearly star hidden on the horizon, rising, in the differentiation of degrees. They said: O Messenger of God, are those the prophets? He said: Yes, by the One in whose hand is my soul, and people who believed in God and believed in the messengers. Al-Hafiz Al-Dia’ said: This is according to Al-Bukhari’s conditions."
  },
  {
    "number": "وصف الجنة",
    "text": "",
    "label": "وصف الجنة في الإسلام\tعدل\nومن أفضل ما وُصف عن الجنة، ما ألفه ابن القيم في خاتمة نونيته الشهيرة \"نونية ابن القيم\" واسمها الكامل هو \"الكافية الشافية في الانتصار للفرقة الناجية\"، ويبدأ وصف الجنة في نونيته من البيت رقم 4931 وتنتهي بنهاية القصيدة في البيت رقم 5698.                      ",
    "number-en": "Description of paradise",
    "label-en": "Description of Paradise in Islam is fair\nOne of the best descriptions of Paradise is what Ibn al-Qayyim composed in the conclusion of his famous Nauniyah, “Ibn al-Qayyim’s Nauniyah,” the full name of which is “Al-Kafiyah al-Shifa fi al-Intisar fi al-Salaf al-Najiya.” The description of Paradise in his Nauniyya begins from verse No. 4931 and ends at the end of the poem in verse No. 5698."
  },
  {
    "number": "من أسماء الجنة",
    "text": "",
    "label": "من أسماء الجنة ودرجاتها\tعدل\nدار السلام: قال تعالى:   لَهُمْ دَارُ السَّلَامِ عِنْدَ رَبِّهِمْ وَهُوَ وَلِيُّهُمْ بِمَا كَانُوا يَعْمَلُونَ    [4] (سورة الأنعام، الآية 127).\n\nجنات عدن: قال عزّ وجلّ:   جَنَّاتِ عَدْنٍ الَّتِي وَعَدَ الرَّحْمَنُ عِبَادَهُ بِالْغَيْبِ إِنَّهُ كَانَ وَعْدُهُ مَأْتِيًّا    [5] (سورة مريم، الآية 61).\n\nجنات النعيم: قال عزّ وجلّ:   إِنَّ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ لَهُمْ جَنَّاتُ النَّعِيمِ    [6] (سورة لقمان، الآية 8).\n\nدار المقامة: قال عزّ وجلّ:   وَقَالُوا الْحَمْدُ لِلَّهِ الَّذِي أَذْهَبَ عَنَّا الْحَزَنَ إِنَّ رَبَّنَا لَغَفُورٌ شَكُورٌ   الَّذِي أَحَلَّنَا دَارَ الْمُقَامَةِ مِنْ فَضْلِهِ لَا يَمَسُّنَا فِيهَا نَصَبٌ وَلَا يَمَسُّنَا فِيهَا لُغُوبٌ    [7] (سورة فاطر، الآيات 34-35).\n\nدار الخلد: قال عزّ وجلّ:   وَأَمَّا الَّذِينَ سُعِدُوا فَفِي الْجَنَّةِ خَالِدِينَ فِيهَا مَا دَامَتِ السَّمَاوَاتُ وَالْأَرْضُ إِلَّا مَا شَاءَ رَبُّكَ عَطَاءً غَيْرَ مَجْذُوذٍ    [8] (سورة هود، الآية 108) وقال كذلك:   مَثَلُ الْجَنَّةِ الَّتِي وُعِدَ الْمُتَّقُونَ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ أُكُلُهَا دَائِمٌ وَظِلُّهَا تِلْكَ عُقْبَى الَّذِينَ اتَّقَوْا وَعُقْبَى الْكَافِرِينَ النَّارُ    [2] (سورة الرعد، الآية 35) وقال:   لَا يَمَسُّهُمْ فِيهَا نَصَبٌ وَمَا هُمْ مِنْهَا بِمُخْرَجِينَ    [9] (سورة الحجر، الآية 48) وقال:   ادْخُلُوهَا بِسَلَامٍ ذَلِكَ يَوْمُ الْخُلُودِ    [10] (سورة ق، الآية 34).\n\nجنة المأوى: قال عزّ وجلّ:   عِنْدَهَا جَنَّةُ الْمَأْوَى    [11] (سورة النجم، الآية 15). قال عطاء عن ابن عباس هي جنة التي يأوي إليها جبريل والملائكة وقال مقاتل هي جنة تأوي إليها أرواح الشهداء وقال كعب هي جنة فيها طير خضر ترتع فيها أرواح الشهداء.\n\nدار الحيوان: قال عزّ وجلّ:   وَمَا هَذِهِ الْحَيَاةُ الدُّنْيَا إِلَّا لَهْوٌ وَلَعِبٌ وَإِنَّ الدَّارَ الْآخِرَةَ لَهِيَ الْحَيَوَانُ لَوْ كَانُوا يَعْلَمُونَ    [12] (سورة العنكبوت، الآية 64).\n\nالفردوس: قال عزّ وجلّ:   أُولَئِكَ هُمُ الْوَارِثُونَ   الَّذِينَ يَرِثُونَ الْفِرْدَوْسَ هُمْ فِيهَا خَالِدُونَ    [13] (سورة المؤمنون، الآية 10-11).\n\nالمقام الأمين: قال عزّ وجلّ:   إِنَّ الْمُتَّقِينَ فِي مَقَامٍ أَمِينٍ    [14] (سورة الدخان، الآية 51).\nمقعد صدق: قال عزّ وجلّ:   إِنَّ الْمُتَّقِينَ فِي جَنَّاتٍ وَنَهَرٍ   فِي مَقْعَدِ صِدْقٍ عِنْدَ مَلِيكٍ مُقْتَدِرٍ    [15] (سورة القمر، الآية 54-55).                      ",
    "number-en": "One of the names of Paradise",
    "label-en": "Among the names and degrees of Paradise is justice\nAbode of Peace: God Almighty said: Theirs is an abode of peace with their Lord, and He is their guardian because of what they used to do [4] (Surat Al-An’am, verse 127).\n\nGardens of Eden: The Almighty said: The Gardens of Eden which the Most Gracious promised His servants in the unseen. Indeed, His promise was to come [5] (Surat Maryam, verse 61).\n\nGardens of Bliss: The Almighty said: Indeed, those who believe and do righteous deeds will have Gardens of Bliss [6] (Surat Luqman, verse 8).\n\nThe House of Resurrection: The Almighty said: And they said: Praise be to God who has removed from us sorrow. Indeed, our Lord is Forgiving and Grateful. Therein is a habitation and no turmoil will touch us therein [7] (Surat Fatir, verses 34-35).\n\nAbode of Eternity: The Almighty said: As for those who are happy, they will be in Paradise, abiding therein as long as the heavens and the earth endure, except as your Lord wills, a giving that is not withheld [8] (Surat Hud, verse 108) And he also said: Like the Paradise that was promised to the righteous, beneath which rivers flow, its food is everlasting and its shadow is the end of those who feared. And after the disbelievers will be the Fire [2] (Surat al-Ra’d, verse 35) and He said: No hardship therein shall touch them, and they will not escape from it [9] (Surat al-Hijr, verse 48) And He said: Enter it in peace. That is the Day of Eternity [10] (Surat Q, verse 34).\n\nThe Garden of Refuge: The Almighty said: With it is the Garden of Refuge [11] (Surat An-Najm, verse 15). Ata’ said, on the authority of Ibn Abbas, “It is a garden to which Gabriel and the angels take shelter.” Muqatil said, “It is a garden to which the souls of the martyrs are sheltered.” Ka’b said, “It is a garden in which there are green birds, in which the souls of the martyrs graze.”\n\nAbode of Animals: God Almighty said: And this life of this world is nothing but amusement and amusement, but indeed the abode of the Hereafter is the Animal, if they only knew [12] (Surat Al-Ankabut, verse 64).\n\nParadise: The Almighty said: Those are the heirs who inherit Paradise. They will abide therein forever [13] (Surat Al-Mu’minun, verse 10-11).\n\nThe Trustworthy Station: The Almighty said: Indeed, the righteous are in a trustworthy station [14] (Surat Ad-Dukhan, verse 51).\nA seat of truthfulness: The Almighty said: Indeed, the righteous will be in gardens and rivers, in a seat of truthfulness with an all-powerful King [15] (Surat Al-Qamar, verses 54-55)."
  },
  {
    "number": "أنهار الجنة",
    "text": "",
    "label": "أنهار الجنة\tعدل\nفي الجنة نهر من ماء ونهر من عسل ونهر من اللبن ونهر من الخمر يختلف عن خمر الدنيا كما ورد في الأحاديث النبوية، وفي سنن الترمذي أن رسول الله صلى الله عليه وسلم قال: \" إن في الجنة بحر العسل، وبحر الخمر، وبحر اللبن، وبحر الماء، ثم تنشق الأنهار بعد \".[16]\n\nقال عزّ وجلّ:   وَبَشِّرِ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ أَنَّ لَهُمْ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ كُلَّمَا رُزِقُوا مِنْهَا مِنْ ثَمَرَةٍ رِزْقًا قَالُوا هَذَا الَّذِي رُزِقْنَا مِنْ قَبْلُ وَأُتُوا بِهِ مُتَشَابِهًا وَلَهُمْ فِيهَا أَزْوَاجٌ مُطَهَّرَةٌ وَهُمْ فِيهَا خَالِدُونَ    [17] (سورة البقرة، الآية 25).\nقال عزّ وجلّ:   مَثَلُ الْجَنَّةِ الَّتِي وُعِدَ الْمُتَّقُونَ فِيهَا أَنْهَارٌ مِنْ مَاءٍ غَيْرِ آسِنٍ وَأَنْهَارٌ مِنْ لَبَنٍ لَمْ يَتَغَيَّرْ طَعْمُهُ وَأَنْهَارٌ مِنْ خَمْرٍ لَذَّةٍ لِلشَّارِبِينَ وَأَنْهَارٌ مِنْ عَسَلٍ مُصَفًّى وَلَهُمْ فِيهَا مِنْ كُلِّ الثَّمَرَاتِ وَمَغْفِرَةٌ مِنْ رَبِّهِمْ كَمَنْ هُوَ خَالِدٌ فِي النَّارِ وَسُقُوا مَاءً حَمِيمًا فَقَطَّعَ أَمْعَاءَهُمْ    [18] (سورة محمد، الآية 15).\n\nنهر الكوثر: وهو نهر أعطى لرسول الله ﷺ في الجنة ويشرب منه المسلمون في الموقف يوم القيامة شربة لا يظمأون بعدها أبدًا بحمد الله وقد سميت إحدى سور القرآن باسمه ووصفه رسول الله صلى الله عليه وسلم بأن حافتاه من قباب اللؤلؤ المجوف وترابه المسك وحصباؤه اللؤلؤ وماؤه أشد بياضًا من الثلج وأحلى من السكر وآنيته من الذهب والفضة.\n\nنهر البيدخ: وهو نهر يغمس فيه الشهداء فيخرجون منه كالقمر ليلة البدر وقد ذهب عنهم ما وجدوه من أذى الدنيا.\n\nنهر بارق: وهو نهر على باب الجنة يجلس عنده الشهداء فيأتيهم رزقهم من الجنة بكرة وعشيًا.\nعيون الجنة\tعدل\n\nعين من كافور:   إِنَّ الْأَبْرَارَ يَشْرَبُونَ مِنْ كَأْسٍ كَانَ مِزَاجُهَا كَافُورًا   عَيْنًا يَشْرَبُ بِهَا عِبَادُ اللَّهِ يُفَجِّرُونَهَا تَفْجِيرًا    [19] (سورة الإنسان، الآيتين 5-6).\n\nالتسنيم:   إِنَّ الْأَبْرَارَ لَفِي نَعِيمٍ   عَلَى الْأَرَائِكِ يَنْظُرُونَ   تَعْرِفُ فِي وُجُوهِهِمْ نَضْرَةَ النَّعِيمِ   يُسْقَوْنَ مِنْ رَحِيقٍ مَخْتُومٍ   خِتَامُهُ مِسْكٌ وَفِي ذَلِكَ فَلْيَتَنَافَسِ الْمُتَنَافِسُونَ   وَمِزَاجُهُ مِنْ تَسْنِيمٍ   عَيْنًا يَشْرَبُ بِهَا الْمُقَرَّبُونَ    [20] (سورة المطففين، الآيات 22-28).\n\nالسلسبيل:   وَيُسْقَوْنَ فِيهَا كَأْسًا كَانَ مِزَاجُهَا زَنْجَبِيلًا   عَيْنًا فِيهَا تُسَمَّى سَلْسَبِيلًا    [21] (سورة الإنسان، الآيتين 17-18).                      ",
    "number-en": "Rivers of paradise",
    "label-en": "The rivers of Paradise are fair\nIn Paradise there is a river of water, a river of honey, a river of milk, and a river of wine that differs from the wine of this world, as stated in the Prophetic hadiths, and in Sunan al-Tirmidhi that the Messenger of God, may God bless him and grant him peace, said: “Indeed, in Paradise there is a sea of honey, a sea of wine, a sea of milk, and a sea of water, and then the rivers will open afterward.”[16]\n\nGod Almighty said: And give good tidings to those who believe and do righteous deeds that for them will be gardens under which rivers flow, whenever they are provided therefrom as a sustenance of fruit. They said, “This is what we were provided with before,” and they were brought with it resembling it. And they will have therein purified wives, and they will abide therein forever [17] (Surat Al-Baqarah, verse 25).\nThe Almighty said: The example of Paradise in which the righteous are promised are rivers of water that is not stagnant, and rivers of milk whose taste does not change, and rivers of Pleasant wine to the drinkers, and rivers of refined honey, and for them therein are of all kinds of fruits, and forgiveness from their Lord, as if he is eternally in the fire, and they are given water to drink. He cut off their intestines [18] (Surat Muhammad, verse 15).\n\nAl-Kawthar River: It is a river given to the Messenger of God, may God bless him and grant him peace, in Paradise, and Muslims will drink from it in the situation on the Day of Resurrection, a drink after which they will never be thirsty, thank God. One of the surahs of the Qur’an is named after him, and the Messenger of God, may God bless him and grant him peace, described it as having two sides of hollow pearl domes, its soil being musk, its pebbles being pearls, and its water being whiter than snow and sweeter than sugar, and its vessels being of gold and silver.\n\nAl-Baydakh River: It is a river in which the martyrs immerse themselves and emerge from it like the moon on a full moon night, with whatever harm they found in this world gone.\n\nBariq River: It is a river at the gate of Paradise where the martyrs sit and their sustenance from Paradise comes to them morning and evening.\nThe eyes of heaven are fair\n\nA spring of camphor: Indeed, the righteous drink from a cup mixed with camphor, a spring with which the servants of God drink, making them explode [19] (Surat Al-Insan, verses 5-6).\n\nAl-Tasnim: Indeed, the righteous are in bliss on couches, watching, and you will recognize on their faces the glow of bliss. They will be made to drink of a sealed nectar whose finish is musk. That is, let the competitors compete, and his mood is to drink from a spring from which those who are close to each other drink [20] (Surat Al-Muttaffin, verses 22-28).\n\nSalsabil: And they are given to drink therein a cup mixed with ginger. It is called Salsabil [21] (Surat Al-Insan, verses 17-18)."
  },
  {
    "number": "نساء الجنة",
    "text": "",
    "label": "نساء الجنة\tعدل\nونساء الجنة هن الحور العين وهن مطهرات من الحيض، والبول، النفاس، الغائط، المخاط، البصاق، وكل قذر وأذى نساء الدنيا، فطهر مع ذلك بدنها من الأخلاق السيئة والصفات المذمومة وطهر لسانها من الفحش والبذاء وطهر طرفها من أن تطمع في غير زوجها وطهر أثوابها من يعرض لدنس أو وسخ. والحور جمع حوراء وهي المرأة الشابة الجميلة البيضاء الشديدة البياض.\n\nقال عزّ وجلّ :   كَأَنَّهُنَّ الْيَاقُوتُ وَالْمَرْجَانُ    [22] (سورة الرحمن، الآية 58).\nقال عزّ وجلّ :   كَأَمْثَالِ اللُّؤْلُؤِ الْمَكْنُونِ    [23] (سورة الواقعة، الآية 23).\nقال عزّ وجلّ :   قَالُوا بَلْ لَمْ تَكُونُوا مُؤْمِنِينَ    [24] (سورة الصافات، الآية 29).    ",
    "number-en": "Women of Paradise",
    "label-en": "Women of Paradise Justice\nThe women of Paradise are the beautiful houris, and they are purified from menstruation, urine, postpartum, defecation, mucus, spit, and every filth and harm of the women of this world. With that, her body will be purified of bad morals and reprehensible qualities, her tongue will be purified of obscenity and obscenity, her limbs will be purified from coveting anything other than her husband, and her garments will be purified of anyone exposed to filth or filth. Al-Hoor is the plural of Hawra, which is a beautiful, very white, young woman.\n\nThe Almighty said: It is as if they were rubies and coral [22] (Surat Ar-Rahman, verse 58).\nThe Almighty said: Like hidden pearls [23] (Surat Al-Waqi’ah, verse 23).\nGod Almighty said: They said, “Rather, you are not believers” [24] (Surat As-Saffat, verse 29)."
  },
  {
    "number": "بناء الجنة",
    "text": "",
    "label": "بناء الجنة\tعدل\nوبناء الجنة لبنة من فضة ولبنة من ذهب، وملاطها المسك، وحصباؤها اللؤلؤ والياقوت، وترابها الزعفران، ومن صلى في اليوم إثنتي عشرة ركعة (النوافل) بني له بيت في الجنة، كما ذكر في الحديث.                  ",
    "number-en": "Building paradise",
    "label-en": "Building paradise is fair\nThe building of Paradise is made of bricks of silver and bricks of gold, its mortar is musk, its pebbles are pearls and rubies, and its soil is saffron. And whoever prays twelve rak’ahs (voluntary rak’ahs) a day, a house will be built for him in Paradise, as mentioned in the hadith."
  },
  {
    "number": "أبواب الجنة ",
    "text": "",
    "label": "للجنة ثمانية أبواب ومن بينها باب الريان لا يدخله إلا الصائمون، وعرض الباب مسيرة الراكب السريع قيل أربعين عامًا. ومن أبواب الجنة أيضًا باب الصلاة لأهل الصلاة، وباب الصدقة لأهل الصدقة، وباب الجهاد للمجاهدين في سبيل الله، وباب الأيمن، وباب الكاظمين الغيظ.       ",
    "number-en": "Gates of heaven",
    "label-en": "Paradise has eight gates, and among them is the Gate of Al-Rayyan, which only those who are fasting can enter, and the width of the gate is said to be a speedy rider’s journey, for forty years. Among the gates of Paradise are also the gate of prayer for those who pray, the gate of charity for those who give charity, the gate of jihad for those who strive for the sake of God, the gate of the right hand, and the gate of those who suppress their anger."
  },
  {
    "number": "أشجار الجنة",
    "text": "",
    "label": "ذكر في أحاديث نبوية أن فيها شجرة يسير الراكب في ظلها مائة سنة لا يقطعها، وإن أشجارها دائمة العطاء قريبة دانية مذللة وقد ذكر منها شجرة طوبى وسدرة المنتهى.\n\nشجرة طوبى: قال عنها رسول الله ﷺ أنها تشبه شجرة الجوز وهي بالغة العظم في حجمها وتتفتق ثمارها عن ثياب أهل الجنة في كل ثمرة سبعين ثوبًا ألوانًا ألوان من السندس والأستبرق لم ير مثلها أهل الدنيا ينال منها المؤمن ما يشاء وعندها يجتمع أهل الجنة فيتذكرون لهو الدنيا فيبعث الله ريحًا من الجنة تحرك تلك الشجرة بكل لهو كان في الدنيا.\n\nسدرة المنتهى: وهي شجرة عظيمة تحت عرش الرحمن ويخرج من أصلها أربعة أنهار ويغشاها نور الله والعديد من الملائكة وهي مقام سيدنا إبراهيم عليه السلام ومعه أطفال المؤمنين الذين ماتوا وهم صغار يرعاهم كأب لهم جميعًا وأوراقها تحمل علم الخلائق وما لا يعلمه إلا الله سبحانه وتعالى وفي الجنة أشجار من جميع أنواع الفواكه المعروفة في الدنيا ليس منها إلا الأسماء أما الجوهر فهو ما لا يعلمه إلا الله.\nقال عزّ وجلّ:   وَبَشِّرِ الَّذِينَ آمَنُوا وَعَمِلُوا الصَّالِحَاتِ أَنَّ لَهُمْ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ كُلَّمَا رُزِقُوا مِنْهَا مِنْ ثَمَرَةٍ رِزْقًا قَالُوا هَذَا الَّذِي رُزِقْنَا مِنْ قَبْلُ وَأُتُوا بِهِ مُتَشَابِهًا وَلَهُمْ فِيهَا أَزْوَاجٌ مُطَهَّرَةٌ وَهُمْ فِيهَا خَالِدُونَ    [17] (سورة البقرة، الآية 25).  ",
    "number-en": "Trees of paradise",
    "label-en": "It was mentioned in prophetic hadiths that there is a tree in whose shade a rider travels for a hundred years without cutting it, and that its ever-giving trees are near, close, and humiliated. Among them were mentioned the Tree of Blessing and the Sidra of the End.\n\nThe Tree of Blessed: The Messenger of God, peace and blessings of God be upon him, said about it that it resembles a walnut tree, and it is very large in size, and its fruits emerge from the clothes of the people of Paradise, and in each fruit there are seventy garments of colors, colors of sandalwood and ivory, the likes of which the people of this world have not seen. The believer gets from it whatever he wants, and then the people of Paradise gather and remember the fun of the world, and God sends a wind from Paradise that moves that tree with all the fun that was in this world.\n\nSidra Al-Muntaha: It is a great tree under the Throne of the Most Merciful, and from its root flow four rivers, and the light of God and many angels cover it. It is the shrine of our master Abraham, peace be upon him, and with him are the children of the believers who died when they were young. He takes care of them as a father to all of them. Its leaves carry the knowledge of creation and what only God Almighty knows. In Paradise there are trees of all types of fruits known in this world, none of them except the names. As for the essence, it is what only God knows.\nGod Almighty said: And give good tidings to those who believe and do righteous deeds that for them will be gardens under which rivers flow, whenever they are provided therefrom as a sustenance of fruit. They said, “This is what we were provided with before,” and they were brought with it resembling it. And they will have therein purified wives, and they will abide therein forever [17] (Surat Al-Baqarah, verse 25)."
  },
  {
    "number": "خيام الجنة",
    "text": "",
    "label": "خيام الجنة\tعدل\nتضرب فيها للمؤمن خيمة مجوفة من اللؤلؤ عرضها ستون ميلًا في كل زاوية فيها أهل يطوف عليهم.        ",
    "number-en": "Paradise tents",
    "label-en": "The tents of Paradise are fair\nIn it, a hollow tent of pearls will be set up for the believer, sixty miles wide, in every corner of which there will be people walking around."
  },
  {
    "number": "أماني الجنة",
    "text": "",
    "label": "أماني الجنة\tعدل\nيقال لداخلها تمنى فلك الذي تمنيت وعشرة أضعاف الدنيا.                      ",
    "number-en": "Paradise wishes",
    "label-en": "The wishes of heaven are fair\nIt is said to the person inside it: wish for what you wished for and ten times the world."
  },
  {
    "number": "خازن الجنة",
    "text": "",
    "label": "خازن الجنة\tعدل\nوكما أن للنار خازنًا من الملائكة يدعى مالك؛ فإن للجنة خازنًا من الملائكة يدعى رضوان.                      ",
    "number-en": "Keeper of Paradise",
    "label-en": "The keeper of Paradise is just\nJust as fire has a guardian among the angels called Malik; Paradise has a guardian among the angels called Ridwan."
  },
  {
    "number": "غرف الجنة",
    "text": "",
    "label": "وَصَفَ الله -تعالى- غُرفَ الجنَّة ومساكنِها بقوله: (لَكِنِ الَّذِينَ اتَّقَوْا رَبَّهُمْ لَهُمْ غُرَفٌ مِّن فَوْقِهَا غُرَفٌ مَّبْنِيَّةٌ تَجْرِي مِن تَحْتِهَا الأَنْهَارُ وَعْدَ الله لا يُخْلِفُ الله الْمِيعَادَ)؛[٨] فقال ابنُ كثير في تفسيره: إنَّ هذه الغُرف تكون قُصوراً شاهقة، وتكونُ طبقاتٍ بعضها فوق بعض، مبنيّةٌ بإحْكام، وهي عالية ومُزخرفةٌ، ووصفها النبيّ -عليه الصلاةُ والسلام- بقوله: (إنَّ في الجنَّةِ غرفًا يُرى ظاهرُها من باطنِها وباطنُها من ظاهرِها)،[٩][١٠] ففي الجنَّة غُرفٌ، وبيوتٌ، وقُصورٌ، وخيام، لِقولهِ -تعالى- على لسان امرأة فرعون: (رَبِّ ابْنِ لِي عِندَكَ بَيْتًا فِي الْجَنَّةِ)،[١١] وأمّا بالنسبة للخيام، فجاء ذِكرُها في قولهِ -تعالى-: (حُورٌ مَّقْصُورَاتٌ فِي الْخِيَامِ)،[١٢] ويُمكن لأهلِ الجنَّة الذهاب فيها حيثُ يشاؤون.[١٣]                      ",
    "number-en": "Paradise rooms",
    "label-en": "God Almighty described the rooms of Paradise and its dwellings by saying: (But those who fear their Lord will have rooms, above which are built rooms, beneath which rivers flow. God has promised not God will break the promise);[8] Ibn Katheer said in his interpretation: These rooms are towering palaces, and they are levels one above the other, built tightly, and they are high and decorated. The Prophet - peace and blessings be upon him - described them by saying: (Indeed, in Paradise there are rooms whose outside can be seen from their inside and whose inside can be seen from their outside),[9][10] In Paradise there are rooms, houses, palaces, and tents, according to what God Almighty said on the tongue of Pharaoh’s wife: (My Lord, build for me a house with You in Paradise),[11] As for tents, they were mentioned in His Almighty’s saying: (Hoor enclosures in Tents),[12] and the people of Paradise can go wherever they want in them.[13]"
  },
  {
    "number": "فرش الجنة",
    "text": "",
    "label": "تُعدُّ فُرش الجنَّة من السُرر -جمع سرير- المرفوعة، وتتكوّن من الياقوت الأحمر، ولها جناحان من الزُمُرّد الأخضر، وعليها سبعون فِراشاً محشوةً بالنور، وظاهرها السُندس، ومن داخلها الاستبرق، وطولها مسيرة أربعين عاماً، وأرائكها من اللؤلؤ، قال الله -تعالى-: (هُمْ وَأَزْوَاجُهُمْ فِي ظِلَالٍ عَلَى الْأَرَائِكِ مُتَّكِئُونَ)،[٣٠][٣١] كما أنَّ من فُرشها العبقري؛ وهو الفِراش المُطرَّز، وكذلك الزرابيّ، والرفرف، وهي المفارش التي تكون فوق السُّرر، لِقولهِ -تعالى-: (فِيهَا سُرُرٌ مَّرْفُوعَةٌ* وَأَكْوَابٌ مَّوْضُوعَةٌ* وَنَمَارِقُ مَصْفُوفَةٌ* وَزَرَابِيُّ مَبْثُوثَةٌ)،[٣٢] وتصعد هذه السُّرر بصاحبها حيثُ يُريد.[٣٣]                      ",
    "number-en": "Paradise furnishings",
    "label-en": "The furnishings of Paradise are considered to be raised beds - the plural of bed - and they are made of red rubies, and have two wings of green emeralds, and on them are seventy beds stuffed with light, and their outsides are made of silk, and their insides are brocade, and their length is a distance of forty years, and their couches are made of pearls. God Almighty said: (They and their wives are in Shadows on the sofas, people reclining),[30][31] and among its ingenious furnishings; It is the embroidered bed, as well as the carpets and the flaps, which are the bedspreads that are placed over the beds, according to the Almighty’s saying: (In them are beds raised* and cups placed* and carpets arranged in array* and carpets. spread out),[32] and these ladders ascend to their owner wherever he wants.[33]"
  },
  {
    "number": "نور الجنة",
    "text": "",
    "label": "أجواء الجنَّة من نور، حيث لا يوجد شمسٌ أو قمرٌ، أو ليلٌ أو نهارٌ، أو صيفٌ أو شِتاءٌ، وجاء عن بعض السلف قوله: إنَّ جَوَّها كالنور الذي يكون عند الفجر وقبل طُلوع الشمس، كما أنَّه لا يوجد بها نوم، وفيها سوقٌ يدخله الإنسانُ كُلُّ جُمعةٍ، لِقول النبيّ -عليه الصلاةُ والسلام-: (إنَّ في الجَنَّةِ لَسُوقًا، يَأْتُونَها كُلَّ جُمُعَةٍ، فَتَهُبُّ رِيحُ الشَّمالِ فَتَحْثُو في وُجُوهِهِمْ وثِيابِهِمْ، فَيَزْدادُونَ حُسْنًا وجَمالًا، فَيَرْجِعُونَ إلى أهْلِيهِمْ وقَدِ ازْدادُوا حُسْنًا وجَمالًا، فيَقولُ لهمْ أهْلُوهُمْ: واللَّهِ لَقَدِ ازْدَدْتُمْ بَعْدَنا حُسْنًا وجَمالًا، فيَقولونَ: وأَنْتُمْ، واللَّهِ لَقَدِ ازْدَدْتُمْ بَعْدَنا حُسْنًا وجَمالًا).[٣٤][٣٥]                      ",
    "number-en": "Light of heaven",
    "label-en": "The atmosphere of Paradise is of light, as there is no sun or moon, or night or day, or summer or winter, and it was reported from some of the predecessors that he said: Its atmosphere is like the light that is at dawn and before sunrise, just as there is no sleep in it, and there is a market in it that a person enters every Friday, according to the saying of the Prophet - peace and blessings be upon him -: (Indeed, in Paradise For a market, they go there every Friday, and the north wind blows and blows on their faces and clothes, and they increase in beauty and beauty, and they return to their families and they have increased. Beauty and beauty. Then their families say to them: By God, you have increased in beauty and beauty after us. They say: And you, by God, you have increased in beauty after us. And beautifully).[34][35]"
  },
  {
    "number": "أول من يدخل الجنة",
    "text": "",
    "label": "روى أنس بن مالك -رضيَ الله عنه- أنّ رسول الله -صلّى الله عليه وسلّم- قال: (آتي بابَ الجَنَّةِ يَومَ القِيامَةِ فأسْتفْتِحُ، فيَقولُ الخازِنُ: مَن أنْتَ؟ فأقُولُ: مُحَمَّدٌ، فيَقولُ: بكَ أُمِرْتُ لا أفْتَحُ لأَحَدٍ قَبْلَكَ)،[١] وقال: (أنا أكْثَرُ الأنْبِياءِ تَبَعًا يَومَ القِيامَةِ، وأنا أوَّلُ مَن يَقْرَعُ بابَ الجَنَّةِ).[٢]\n\nوالرسول الأمين هو أوّل مَن يدخل الجنّة، ويأخذ ما أعدّ الله له ولأمته من النعيم فيها، ثمّ يعود إلى أرض المحشر ليشفع لأمته، ويشهد معهم مشاهد القيامة.[٣]\n\nأول من يشفع بدخول الجنة \n\nتكون الشفاعة الكبرى يوم القيامة عند الله للنبيّ محمّد -صلّى الله عليه وسلّم-، فلا أحد من الخلق أفضل منه وأعظم منه عند الله، وهو أوّل مَن يشفع بدخول الجنّة، فقد روى أنس بن مالك -رضيَ الله عنه- عن النبيّ -صلّى الله عليه وسلّم- فقال: (أنا أوَّلُ النَّاسِ يَشْفَعُ في الجَنَّةِ وأنا أكْثَرُ الأنْبِياءِ تَبَعاً).[٤][٥]\n\nأول من يقرع باب الجنة \n\nأوّل مَن يطرق باب الجنّة يوم القيامة هو رسول الله، فيسأله خازن الجنة عنه، فيخبره أنّه محمد، فيردّ الخازن أنّه قد أمر ألّا يفتح الباب لأحدٍ قبل رسول الله من الناس والأنبياء، ثمّ إذا دخل رسول الله دخل من بعده الذين آمنوا به من أُمته، روى أنس بن مالك -رضي الله عنه- عن الرسول الأمين أنّه قال: (أنا أولُ مَنْ يَأْخُذُ بِحَلْقَةِ بابِ الجنةِ فَأُقَعْقِعُها).[٦][٧]\n\nأول فئات الناس دخولا للجنة\n\nروى عبد الله بن عمرو -رضيَ الله عنه- أنّ رسول الله قال: (هل تدرونَ مَن أوَّلُ مَن يدخُلُ الجنَّةَ مِن خَلْقِ اللهِ؟ قالوا: اللهُ ورسولُه أعلَمُ، قال: أوَّلُ مَن يدخُلُ الجنَّةَ مِن اللهِ الفُقَراءُ المُهاجِرونَ الَّذينَ يُسَدُّ بهم الثُّغورُ وتُتَّقَى بهم المَكارِهُ ويموتُ أحَدُهم وحاجتُه في صدرِه لا يستطيعُ لها قضاءً).[٨][٩]\n\nوجاء أيضاً أنّ أوّل مَن يقرع باب الجنّة بلال بن حمامة، ولا يتنافى أيٌّ من ذلك مع الآخر، فقد يكون المراد أنّ هذه الفئات هي أوّل مَن يدخل الجنة من أمّة محّمد، أو أنّها تقرع الباب الأصليّ للجنة وليس حِلق الجنة.[١٠]\n\nأول من يدخل الجنة من الصحابة\n\nورد في الحديث الضعيف الذي رواه أبو هريرة -رضيَ الله عنه- عن رسول الله -صلّى الله عليه وسلّم- أنّه قال: (أتاني جبريلُ فأخذ بيدِي، فأَرَانِي بابَ الجنةِ الذي يَدْخُلُ منه أُمَّتِي، قال أبو بكرٍ : ودِدْتُ أني كنتُ معك حتى أنظرَ إليه، قال : أَمَا إنك يا أبا بكرٍ أولُ مَن يدخلُ الجنةَ من أُمَّتِي).[١١][١٢]\n\nونُقل عن بعض العلماء أنّ أبا سلمة -رضيَ الله عنه- كان أوّل المهاجرين وهو أوّل مَن يدخل الجنة من أمّة سيدنا محمد، لكن الأصح أنّ أبا بكر -رضيَ الله عنه- هو أوّل مَن يدخل الجنة من الأمّة.[١٣]     ",
    "number-en": "The first to enter heaven",
    "label-en": "Anas bin Malik - may God be pleased with him - narrated that the Messenger of God - may God bless him and grant him peace - said: (I will come to the gate of Paradise on the Day of Resurrection and open it, and the treasurer will say: Who are you? Then I will say: Muhammad, and he will say: By you I have been commanded not to open it for anyone before you),[1] He said: (I will be the most followed of the prophets on the Day of Resurrection, and I will be the first to knock on the door of Paradise).[2]\n\nThe faithful Messenger is the first to enter Paradise, and receive what God has prepared for him and his nation of bliss therein, then he returns to the land of resurrection to intercede for his nation, and to witness with them the scenes of the Resurrection.[3]\n\nThe first to intercede will enter Paradise \n\nThe greatest intercession with God on the Day of Resurrection will be for the Prophet Muhammad - may God bless him and grant him peace. There is no one among creation better than him and greater than him before God, and he will be the first to intercede for entry into Paradise. Anas bin Malik - may God be pleased with him - narrated on the authority of the Prophet - may God bless him and grant him peace - and he said: (I will be the first of people to intercede in Paradise and I am the greatest of the prophets. Accordingly).[4][5]\n\nThe first to knock on Heaven's door \n\nThe first one to knock on the door of Paradise on the Day of Resurrection will be the Messenger of God. The keeper of Paradise will ask him about him and tell him that he is Muhammad. The keeper will reply that he has been ordered not to open the door to anyone before the Messenger of God from among the people and prophets. Then, when the Messenger of God enters, those of his nation who believe in him will enter after him. Anas bin Malik - may God be pleased with him - narrated on the authority of the trustworthy Messenger that he said: (I will be the first to take With the ring of the gate of Paradise, so knock on it.)[6][7]\n\nThe first category of people to enter Paradise\n\nAbdullah bin Amr - may God be pleased with him - narrated that the Messenger of God said: (Do you know who will be the first to enter Paradise among God’s creation? They said: God and His Messenger know best. He said: The first to enter Paradise than God will be the poor and emigrants by whom the borders are blocked and by whom God is protected. Hateful events, and someone dies while his need is in his chest and he cannot fulfill it.)[8][9]\n\nIt also came that the first to knock on the door of Paradise is Bilal bin Hamama, and none of this is incompatible with the other. What is meant may be that these groups are the first to enter Paradise from the nation of Muhammad, or that they knock on the original door of Paradise and not the ring of Paradise.[10]\n\nThe first companions to enter Paradise\n\nIt was mentioned in the weak hadith narrated by Abu Hurairah - may God be pleased with him - on the authority of the Messenger of God - may God bless him and grant him peace - that he said: (Gabriel came to me, took my hand, and showed me the door of Paradise through which my nation will enter. Abu Bakr said: I wish I were with you so that I could look at him. He said: As for you, Abu Bakr, the first to enter Paradise from My nation).[11][12]\n\nIt was reported from some scholars that Abu Salamah - may God be pleased with him - was the first of the immigrants and the first to enter Paradise from the nation of our Master Muhammad, but it is more correct that Abu Bakr - may God be pleased with him - is the first of the nation to enter Paradise.[13]"
  },
  {
    "number": "أسباب دخول الجنة",
    "text": "",
    "label": "صحة العقيدة و العمل\n\nإن صحة العقيدة من الشروط الأساسية لدخول الجنة، بالإضافة إلى صحة العمل، فمن أخذ بأسباب دخول الجنة ولم تكن عقيدته صحيحة لا يدخل الجنة، وذلك لقوله تعالى: (وَقَدِمْنَا إِلَى مَا عَمِلُوا مِنْ عَمَلٍ فَجَعَلْنَاهُ هَبَاءً مَّنثُورًا) [الفرقان: 23]، كما أن الإيمان وحده لا يدخل الجنة، حيث إنّ الله عزّ وجل قرن الإيمان بالعمل الصالح، وبناءً على ذلك فإن العمل الصالح الذي يدخل الجنة هو العمل الخالص لوجه الله، والموافق للسنة.\n\n\nالتقوى\n\nالتقوى تعني الخوف الجليل، والعمل بالتنزيل، والقناعة بالشيء القليل، والاستعداد للقاء الله عزّ وجل يوم القيامة، ويمكن تعريف التقوى على أنها طاعة الله كما جاء في القرآن الكريم والسنة النبوية، بهدف نيل ثوابه، وترك معصيته على نور منه، والأمر بالمعروف والنهي عن المنكر بهدف التقرب منه، قال تعالى: (وَسَارِعُوا إِلَى مَغْفِرَةٍ مِنْ رَبِّكُمْ وَجَنَّةٍ عَرْضُهَا السَّمَوَاتُ وَالْأَرْضُ أُعِدَّتْ لِلْمُتَّقِينَ)[آل عمران: 133].\n\nإيثار طاعة الله على المصلحة الشخصية\n\nينبغي على العبد عندما يشعر بأنّ مصلحته تتعارض مع الحكم الشرعي، أن يلتزم بالحكم الشرعي، وأن يطيع الله ورسوله، قال تعالى: (وَمَنْ يُطِعِ اللَّهَ وَرَسُولَهُ يُدْخِلْهُ جَنَّاتٍ تَجْرِي مِنْ تَحْتِهَا الْأَنْهَارُ) [النساء: 13].\n\nالجهاد في سبيل الله\n\nيعتبر الجهاد من الأعمال التي تدخل صاحبها الجنة، سواءً كان ذلك جهاداً بالنفس أم جهاداً بالدعوة، قال تعالى: (فَلَا تُطِعِ الْكَافِرِينَ وَجَاهِدْهُمْ بِهِ جِهَاداً كَبِيراً) [الفرقان: 52]؛ حيث إنّ الجهاد في سبيل الله أحد أكبر أسباب دخول الجنة، قال تعالى:(إِنَّ اللَّـهَ اشتَرى مِنَ المُؤمِنينَ أَنفُسَهُم وَأَموالَهُم بِأَنَّ لَهُمُ الجَنَّةَ يُقاتِلونَ في سَبيلِ اللَّـهِ فَيَقتُلونَ وَيُقتَلونَ وَعدًا عَلَيهِ حَقًّا فِي التَّوراةِ وَالإِنجيلِ وَالقُرآنِ وَمَن أَوفى بِعَهدِهِ مِنَ اللَّـهِ) [التوبة: 111].\n\nطلب العلم لوجه الله\n\nيكون طلب العلم لوجه الله عزّ وجل بحضور المسلم مجالس العلم لا يبتغي إلا وجه الله عزّ وجل، وأن يكون الهدف منها التعرف إلى الله من خلالها، وأن يعرف أوامره ونواهيه، كما يجب التعرف على سنة النبي صلى الله عليه وسلم، حيث قال: (من سلك طريقا يلتمس فيه علما ، سهل الله له طريقا إلى الجنة) [صحيح].\n\nحسن الخلق\n\nيعتبر الخلق أحد أسباب دخول الجنة، لأنّ الإيمان هو الخلق، فمن زاد في الخلق زاد في الإيمان، حيث إنّ الله عزّ وجل عندما أراد أن يمدح نبيه صلى الله عليه وسلم مدح خلقه فقال: ﴿وَإِنَّكَ لَعَلى خُلُقٍ عَظِيمٍ ﴾[القلم: 4].\n\nأسباب أخرى لدخول الجنة\n\nتعتبر التوبة أحد أبواب دخول الجنة، حيث إنّ الله يحب التوابين، قال تعالى:﴿إِلَّا مَنْ تَابَ وَآَمَنَ وَعَمِلَ صَالِحاً فَأُولَئِكَ يَدْخُلُونَ الْجَنَّةَ وَلَا يُظْلَمُونَ شَيْئاً) [مريم: 60].\nترك المراء.\nالمداومة على صلاة ركعتين بعد كل أذان.\nأداء الصلوات في المسجد مع الجماعة.\nالإكثار من السجود لله عزّ وجل.\nالتطوع في العبادات كالصوم، والصلاة، والصدقات.\nإفشاء السلام، وصلة الأرحام.\nالوفاء بالعهود، والصدق في الحديث.\nكفالة اليتيم، وحسن رعايته، وحفظ ماله.\nعيادة المريض.\nتسبيح الله، وحمده، والتهليل، والتكبير، والدعاء.\nالتجاوز عن المعسر.                      ",
    "number-en": "Reasons for entering heaven",
    "label-en": "The validity of belief and action\n\nThe correctness of the belief is one of the basic conditions for entering Paradise, in addition to the correctness of the deeds. Whoever follows the reasons for entering Paradise and his belief is not correct will not enter Paradise, due to the Almighty’s saying: (And We will advance to whatever deeds they have done, and We will make them for nothing scattered) [Al-Furqan: 23]. Likewise, faith alone will not enter Paradise, since God is Almighty. God has associated faith with good deeds, and based on that, the good deed that enters Paradise is pure deed for the sake of God, and in accordance with the Sunnah.\n\n\nPiety\n\nPiety means great fear, action of revelation, contentment with a little thing, and preparation to meet God Almighty on the Day of Resurrection. Piety can be defined as obedience to God as stated in the Holy Qur’an and the Sunnah of the Prophet, with the aim of attaining His reward, abandoning disobedience to Him in light of Him, and enjoining what is right and forbidding what is wrong with the aim of getting closer to Him. The Almighty said: (And hasten to forgiveness from your Lord. And a Paradise as wide as the heavens and the earth, prepared for the righteous.” [Al Imran: 133].\n\nPrioritize obedience to God over personal interest\n\nWhen the servant feels that his interests conflict with the Shariah ruling, he must adhere to the Shariah ruling and obey God and His Messenger. The Almighty said: (And whoever obeys Allah and His Messenger, He will admit him to Gardens beneath which rivers flow) [An-Nisa: 13].\n\nJihad for the sake of God\n\nJihad is considered one of the deeds that brings its performer into Paradise, whether it is jihad with the soul or jihad by invitation. God Almighty said: (So do not obey the disbelievers, but strive against them therein with a great jihad) [Al-Furqan: 52]; Since jihad for the sake of God is one of the greatest reasons for entering Paradise, God Almighty said: (Indeed, God has purchased from the believers their souls and their possessions, that Paradise will be theirs. They fight in the path of God, so they kill and are killed, a promise that is true upon Him. In the Torah, the Gospel, and the Qur’an, and who is more faithful to his covenant than God?) [At-Tawbah: 111].\n\nSeeking knowledge for the sake of God\n\nThe pursuit of knowledge for the sake of God Almighty should be done by the Muslim attending knowledge gatherings, seeking nothing but the face of God Almighty, and the aim of them should be to get to know God through them, and to know His commands and prohibitions, just as it is necessary to become familiar with the Sunnah of the Prophet, may God bless him and grant him peace, when he said: (Whoever follows a path seeking knowledge, God will make easy for him a path to Paradise) [Sahih].\n\nGood manners\n\nCharacter is considered one of the reasons for entering Paradise, because faith is character, so whoever increases in character increases in faith, as God Almighty, when He wanted to praise His Prophet, may God’s prayers and peace be upon him, praised His creation, saying: “And indeed, you are the most exalted in creation” [Al-Qalam: 4].\n\nOther reasons to enter heaven\n\nRepentance is considered one of the doors to entering Paradise, as God loves those who repent. The Almighty said: “Except him who repents and believes and does righteousness - those will enter Paradise and will not be wronged in the least” [Maryam: 60].\nLeave the dispute.\nContinuing to pray two rak'ahs after every call to prayer.\nPerforming prayers in the mosque with the congregation.\nIncrease your prostration to God Almighty.\nVolunteering in acts of worship such as fasting, prayer, and alms.\nDisclosing peace, connecting relatives.\nFulfillment of promises and honesty in speech.\nSponsoring an orphan, taking good care of him, and preserving his money.\nPatient clinic.\nGlory to God, praise, glorification, glorification, and supplication.\nOvercoming the insolvent."
  },
  {
    "number": "كيف تدخل الجنة",
    "text": "",
    "label": "إنّ من عظيم إحسان الله، وفيض رحمته أنّه يضع لعبده أسهل الطرق لدخول الجنة، فالمحافظة على صلاة الفجر والعصر في وقتهما باب يضمن لك سعادة دائمة، ورسول الله يطمئننا ويقول: \"من صلّى البردين دخل الجنة\".\nصيام التطوع خير وفير، يضمن لك الدخول من باب الريان، وهو باب من أبواب الجنة.\nطاعة الوالدين وبرهما والإحسان إليهما في الكِبر، وهو من أقرب الأعمال إلى الله بعد الصلاة كما أجاب المصطفى صحابته.\nحفظ أسماء الله الحسنى وفهم معانيها دخول للجنة بيسر بإذن الله.\nإماطة الأذى عن الطريق خلقٌ حسن يتحلّى به المسلم المخلص لدينه، وهو عمل يوصلك للجنة.\nدخول الجنة دون حساب أو عذاب\n\nيخبرنا رسول الله أنّ سبعين ألفاً من أمته يدخلون الجنة دون حساب أو عذاب، وهم الذين لا يسترقون، ولا يكتوون، ولا يتطايرون، وعلى ربهم يتوكلون، والذين لا يسترقون هم من لا يطلبون من أحد أن يقرأ عليهم الرقية الشرعية؛ اعتماداً على الله، وعزة لنفوسهم التي تأبى التذلل والخضوع لغيره، وثقة بقوته وقدرته على أن يُحيي العظام وهي رميم، ومعنى لا يتطايرون لا يتشاءمون، ولا يكتوون هم الذين لا يتداوون بالكي توكلاً على الله وفي ذلك دلالة كبيرة على ضرورة التوكل والاعتماد عليه فهو حسبه ووليه وناصره وكافيه، لأنّ المسلم في التوكل عليه جل في علاه لا يخشى إلّاه، ولا يلجأ إلّا إليه، ولا يرجو ويطلب العفو والتذلل إلّا لمن نفث روح الحياة في جسده وصار إنساناً من لحمٍ ودم، ولما يشعر ربنا بأن عبده يُوكله في كل حركة وسكنة ثقة بقوته وكرمه يغدق عليه من واسع رحمته ويفيض عليه من قدرته ورضاه.\n\nأسباب دخول الجنة\n\nكل مسلم على وجه البسيطة يسأل الله في كل صلاة الجنة ويواظب على الخير ما استطاع إلى ذلك سبيلاً للفوز برضا الله وبها:\n\nالعمل الصالح: هو ما يُرضي الله، كالتيسير على المُعسر بتفريج كربته بعد بمشيئة الله، وإماطة الأذى عن الطريق، والأمانة في المأكل والمشرب، والمعاملات التجارية، كذلك بر الوالدين، والعطف على الصغير، واحترام الكبير، وتقديم يد العون له.\nطاعة الله ورسوله في الفرائض والواجبات واجتناب ما نهى عنه، والحرص على أداء الطاعات على أكمل وجه.\nالصبرعلى البلاء حين فقد الأزواج أو الأبناء واحتسابهم عند الله والرضا بالقضاء والقدر، والإيمان بأن الخير فيما قضاه الله والشر فيما صرفه.\nكفالة اليتيم، فلقد أخبرنا رسول الله أنه وكافل اليتيم كهاتين في الجنة وأشار بأصابعه السبابة والإبهام؛ لأن في ذلك رحمة وخير وتيسير حال.\nالتحلي بالصدق وحفظ الفرج وغض البصر، ولقد ضمن رسول الله لمن يتسم بهذه الصفات الحسنة الجنة.\nقيام الليل، وهو اصطفاء يكرمه الله لمن يشتاق لصوته في عتمة الليل وحلكته، ويستجيب لرجائه ودموعه التي ترجو رحمته وكرمه ورضاه.\nقراءة آية الكرسي بعد كل صلاة، من داوم عليها لا يحول بينه وبين الجنة إلّا الموت.\nصلاة اثنتي عشر ركعة كل يوم تطوعاً، وتُقسَّم ركعتين قبل الفجر،أربع ركعات قبل الظهر، وركعتين بعدها، ركعتين بعد المغرب، وركعتين بعد العشاء، ويكون بذلك بُني بيتاً للمسلم في الجنة.\nوشرط كل عمل صالح الإخلاص لله وحده وأن يقصد وجه الله تعالى دون أن يُشرك بذلك عبد مأمور أصلاً من الله وليس بيده حول أو قوة، فالإخلاص يُحقق العبودية التامة ويكون باباً لدخول الجنة بإذن الله، ومحل النية القلب التي يبدأ بها كل عمل يرتجي وجه الله ويطلب جنته، وعلى المسلم الفطن الذي يطمع في رضوان الله ويُسابق في الخيرات ويكون شعاره \"لن يسبقني إلى الجنة أحد\" أن يُوطّن نفسه على أي لحظة مغادرة حياة الدنيا إلى الآخرة وحياة البرزخ، ويكون بذلك ضمن دخول الجنة بكثرة ذكر الله وفعل الصالحات من الأعمال، وسلامة القلب من شوائب السوء والمعاصي تأتي من سماع القرآن وفي مجالس الذكر وأوقات الخلوة، فالحياة حياة القلب والموت موت القلب والمرض مرض القلب، والقلب يحضر كلما خرَّ المسلم ساجداً باكياً متذللاً لربه مع حضور الخوف والرجاء من الله باب لدخول الجنة بإذنه.\n\nأحسنوا الظن بالله، وتفائلوا بالجنة بالعمل الصالح ستنعمون بجنة عرضها السماوات والأرض، فالله عند حسن ظن عبده به، اخلعوا ثوب اليأس والجزع والشر، واعمروا دنياكم بالخير والرضا والطاعة.                      ",
    "number-en": "How to enter heaven",
    "label-en": "One of the great benevolence of God and the abundance of His mercy is that He provides for His servant the easiest way to enter Paradise. Maintaining the Fajr and Asr prayers on time is a door that guarantees you eternal happiness. The Messenger of God reassures us and says: “Whoever prays Al-Bardain will enter Paradise.”\nVoluntary fasting is good and abundant, as it guarantees you entry through the gate of Al-Rayyan, which is one of the gates of Paradise.\nObedience to parents, honoring them, and being kind to them in old age, is one of the closest deeds to God after prayer, as the Chosen One answered his companions.\nMemorizing the Most Beautiful Names of God and understanding their meanings will enable you to enter Paradise easily, God willing. Removing harm from the road is a good behavior of a Muslim who is loyal to his religion, and it is an act that will lead you to Paradise.\nEntering Paradise without judgment or torment\n\nThe Messenger of God tells us that seventy thousand of his nation will enter Paradise without judgment or punishment, and they are the ones who do not seek enslavement, do not hide, and do not seek refuge, and in their Lord they put their trust. Relying on God, and the pride of their souls that refuse to be humble and submit to anyone else, and confidence in His strength and ability to revive bones that are old, and the meaning of “they do not fly away, they do not become pessimistic.” They are not those who do not seek treatment with cauterization, relying on God, and this is a great indication of the necessity of trusting and relying on Him, for He is His suffice, guardian, supporter, and sufficiency, because in relying on Him, the Almighty, he does not fear God, does not resort to anyone but Him, and does not hope and ask for pardon and humility except for the one who breathed the spirit of life into his body and became a human being of flesh and blood, and when our Lord feels that His servant entrusts him with confidence in every movement and silence. With His strength and generosity, He bestows upon him His abundant mercy and overflows upon Him with His power and satisfaction. Reasons for entering heaven\n\nEvery Muslim on earth asks God for Paradise in every prayer and perseveres in good deeds as much as he can in order to gain God’s satisfaction and with it:\n\nGood deeds: are what pleases God, such as facilitating the relief of a distressed person by relieving his distress after God wills, removing harm from the way, being honest in food and drink, and commercial transactions, as well as honoring one’s parents, being kind to the young, respecting the old, and offering a helping hand to him.\nObeying God and His Messenger in the obligations and duties, avoiding what he has forbidden, and being careful to perform obedience to the fullest extent. Patience in the face of affliction when spouses or children are lost, seeking their hope from God, being content with decree and destiny, and believing that good is what God has decreed and evil is what He has spent.\nSponsoring an orphan. The Messenger of God told us that he and the sponsor of an orphan are like these two in Paradise, and he pointed with his index fingers and thumb; Because in that there is mercy, goodness, and easing of the situation.\nBe honest, maintain your chastity, and lower your gaze. The Messenger of God guaranteed Paradise for those who possess these good qualities.\nNight prayer is a choice that God honors for the one who longs for his voice in the darkness and darkness of the night, and responds to his hope and tears that hope for His mercy, generosity, and satisfaction. Reciting Ayat al-Kursi after every prayer. Whoever recites it regularly, nothing stands between him and Paradise except death.\nPraying twelve rak'ahs every day voluntarily, divided into two rak'ahs before dawn, four rak'ahs before noon, two rak'ahs after it, two rak'ahs after sunset, and two rak'ahs after dinner, and thus a house will be built for the Muslim in Paradise. The condition for every good deed is sincerity to God alone and that one intends the face of God Almighty without involving a servant who is originally commanded by God and who has no power or strength in his hand. Sincerity achieves complete servitude and is a door to entering Paradise, God willing, and the place of intention is the heart with which every action begins that hopes for the face of God and seeks His Paradise. The wise Muslim who aspires to the pleasure of God and races in good deeds and whose motto is “No one will precede me to Paradise” must reassure himself at any moment of leaving the life of this world to The afterlife and the life of Al-Barzakh, and this will guarantee entry into Paradise by frequently mentioning God and doing good deeds. The heart’s safety from the impurities of evil and transgression comes from listening to the Qur’an, in gatherings of remembrance, and in times of solitude. Life is the life of the heart, death is the death of the heart, and illness is disease of the heart. The heart is present whenever a Muslim prostrates, weeping, and humiliating himself before his Lord, with the presence of fear and hope from God as a door to entering Paradise, with His permission.\n\nThink well of God, and be optimistic about Paradise. By doing good deeds, you will be blessed with a Paradise as wide as the heavens and the earth. God is satisfied with His servant’s good opinion of Him. Take off the garment of despair, anxiety, and evil, and populate your world with goodness, contentment, and obedience."
  }
]