[
  {
    "number": "اليهود ونقض العهد",
    "text": "",
    "number_en": "The Jews and the Violation of the Covenant",
    "label": "لم يحترم اليهود عهودهم مع النبي صلى الله عليه وسلم فحاولوا إشعال الفتنة بين صفوف المسلمين، فهذا شاس بن قيس اليهودي أرسل فتى من فتيان اليهود يُذَكِّرُ الأنصار بما كان بينهم في الجاهلية، ففعل الفتى حتى كادوا أن يتقاتلوا، فخرج إليهم النبي صلى الله عليه وسلم، ونهاهم عن العودة إلى الجاهلية، وذكرهم بالإسلام والحب الذي ربط الله به قلوبهم، فعادوا إلى رشدهم وصوابهم.\nولما نصر الله رسولَه والمسلمين على المشركين في غزوة بدر حسدتهم اليهود على ما أنعم الله تعالى به عليهم، فقال فنحاص اليهودي: لا يغرن محمدًا أن غلب قريشًا وقتلهم، إن قريشًا لا تحسن القتال، فلما بلغ رسول الله صلى الله عليه وسلم ما قاله جمع اليهود في سوق بني قينقاع وحذرهم من الغدر ودعاهم إلى الإسلام، وذكرهم بما عندهم من العلم برسالته ونبوته فقال لهم: (احذروا من الله مثل ما نزل بقريش من النقمة، وأسلموا فإنكم قد عرفتم أني نبي مرسل تجدون ذلك في كتابكم وعهد الله إليكم) فقالوا: يا محمد إنك ترى أنا كقومك؟ لا يغرنك أنك لقيت قومًا لا علم لهم بالحرب فأصبت فرصة، أما والله لئن حاربتنا لتعلمن أنا نحن الناس.\nفأنزل الله -سبحانه- على نبيه من القرآن ما يجيبهم به ويرد عليهم ما قالوا وما بغوا، فقال تعالى: {قل للذين كفروا ستغلبون وتحشرون إلى جهنم وبئس\nالمهاد . قد كان لكم آية في فئتين التقتا فئة تقاتل في سبيل الله وأخرى كافرة يرونهم مثليهم رأي العين والله يؤيد بنصره من يشاء إن في ذلك لعبرة لأولي الأبصار} [آل عمران: 12-13].\nإن كلام اليهود هذا تهديد واضح للرسول صلى الله عليه وسلم بالحرب، وتأكيد لنقضهم للمعاهدة التي بينهم وبينه، ومع ذلك فقد صبر عليهم الرسول صلى الله عليه وسلم ولكنهم أصروا على نقضهم للعهد.\nطرد يهود بني قينقاع من المدينة:\nذات يوم ذهبت امرأة مسلمة إلى سوق بني قينقاع لبيع ذهب معها، فاحتال عليها اليهود لتكشف وجهها فأبت، فأخذ الصائغ طرف ثوبها، وربطه إلى\nظهرها -وهي لا تعلم- فلما قامت انكشفت عورتها، وأخذوا يضحكون\nمنها، فصاحت المرأة تستغيث بعد أن طعنت في كرامتها، فوثب رجل مسلم على اليهودي الذي أهان المرأة فقتله، فقام اليهود بقتل ذلك المسلم، فكان شهيدًا في سبيل الله، فقامت الحرب بين المسلمين واليهود بسبب غدرهم ووقاحتهم وسوء أدبهم. _[الواقدي].\nفلما علم بنو قينقاع بقدوم المسلمين فروا إلى حصونهم واختبئوا فيها؛ فحاصرهم المسلمون وحبسوهم في حصونهم، واستمر هذا الحصار خمسة عشر يومًا، بعدها اضطر اليهود إلى أن يفتحوا الحصون ويستسلموا رعبًا وخوفًا من المسلمين، فجاء عبد الله بن أُبي بن سلول، وقال: (يا محمد أحسن في موالي (حلفائي) وظل\nابن سلول يتشفع لهم عند الرسول حتى اكتفى النبي صلى الله عليه وسلم بطردهم من المدينة، فخرجوا تاركين وراءهم أموالهم غنيمة للمسلمين، وذهبوا إلى بلدة تسمي أذرعات في الشام، وهناك سلط الله عليهم وباء مات فيه أغلبهم.\nقتل كعب بن الأشرف اليهودي:\nبقيت في المدينة طائفتان كبيرتان من اليهود: بنو النضير، وبنو قريظة، وما زالوا يعادون المسلمين رغم العهد الذي قطعه رسول الله صلى الله عليه وسلم\nمعهم، فهذا رجل من أغنيائهم اسمه كعب بن الأشرف، لم يكتفِ بالحزن على قتلى الكفار في بدر، بل ذهب إلى مكة وعزَّاهم، وأخذ يرثي قتلاهم بشِعره ويشعل نار الثأر في قلوبهم كي يحاربوا المسلمين، ولم يكتف بهذا، فقد تطاول بإيذاء المسلمين مباشرة فأخذ يهجو رسول الله صلى الله عليه وسلم\nوالصحابة -رضي الله عنهم- ويقع في أعراضهم.\nفقال رسول الله صلى الله عليه وسلم: (مَنْ لكعب بن الأشرف؛ فإنه قد آذى الله ورسوله؟) فقام محمد بن مسلمة فقال: يا رسول الله، أتحب أن أقتله؟ قال: (نعم) قال: فأذن لي أن أقول شيئًا (أي يعيب الرسول صلى الله عليه وسلم والمسلمين حتى يطمئن إليه كعب) قال صلى الله عليه وسلم: (قل) فذهب محمد بن مسلمة إلى كعب بن الأشرف اليهودي، فقال له: إن هذا الرجل قد سألنا صدقة (أي مالا) وإنه قد عنانا (أتعبنا) وإني قد أتيتك أستسلفك (أي أطلب منك مالا) قال كعب: وأيضًا والله لتملنه (يصيبكم الملل من صحبة محمد) قال محمد بن مسلمة: إنا قد اتبعناه، فلا نحب أن ندعه (نتركه) ننظر إلى أي شيء يصير شأنه، وقد أردنا أن تسلفنا وسقًا أو وسقين (الوسق: كيل معلوم) فقال: نعم ارهنوني.\nقالوا: أي شيء تريد؟ قال: ارهنوني نساءكم، قالوا: كيف نرهنك نساءنا وأنت أجمل العرب، قال: فارهنوني أبناءكم؟ قالوا: كيف نرهنك أبناءنا فيسب أحدهم فيقال: رهن بوسق أو وسقين؟ هذا عار علينا، ولكنا نرهنك اللأمة (السلاح) فواعده أن يأتيه، فجاءه ليلا ومعه أبو نائلة -وهو أخو كعب من\nالرضاعة- فدعاهم إلى الحصن، فنزل إليهم فقالت له امرأته: أين المخرج هذه الساعة؟ قال: إنما هو محمد بن مسلمة ورضيعي أبو نائلة، فنزل إليهم وهو ينفح منه ريح الطيب، فقال أبو نائلة: ما أريت كاليوم ريحًا أطيب، أتأذن لي أن أشم رأسك؟ قال: نعم، فلما استمكن منه قال: دونكم فاقتلوه، فقتلوه، ثم أتوا النبي صلى الله عليه وسلم فأخبروه. [الترمذي].                      ",
    "label-en": "The Jews did not respect their covenants with the Prophet, may God bless him and grant him peace, so they tried to ignite discord among the ranks of the Muslims. This Jew, Shas bin Qais, sent a young boy from the Jews to remind the Ansar of what had happened between them in pre-Islamic times. The boy did so until they almost fought, so the Prophet, may God bless him and grant him peace, came out to them and forbade them from returning to pre-Islamic times, and reminded them of Islam and the love with which God had bound their hearts, so they returned to their senses and right path. When God gave victory to His Messenger and the Muslims over the polytheists in the Battle of Badr, the Jews envied them for what God Almighty had bestowed upon them, so the Jew said: Let Muhammad not be deceived if he defeats the Quraysh and kills them, for the Quraysh are not good at fighting. When the Messenger of God, may God bless him and grant him peace, heard what he said, he gathered the Jews in the market of Banu Qaynuqa and warned them against treachery and called them to Islam, and reminded them of the knowledge they had of his message and prophecy, so he said to them: (Beware of God like the vengeance that befell Quraysh, and submit to Islam, for you have known that I am a sent prophet. You will find that in your book and God’s covenant with you.) They said: O Muhammad, do you see that I am like your people? Do not be deceived by the fact that you met a people who had no knowledge of war, and you got a chance. By God, if you fought us, you would know that we are the people.\nSo God - Glory be to Him - revealed to His Prophet from the Qur’an what he would answer them with and refute to them what they said and what they sought. Then God Almighty said: {Say to those who disbelieved: “You will be defeated and gathered into Hell, and wretched is it.”\nThe thalamus. Indeed, there has been a sign for you regarding two groups that have met, one group fighting in the cause of God and the other disbelieving. They see them as the same as they are with the eyes of the eye. And God supports with His victory whom He wills. Indeed, in that is a lesson for those with insight.} [Al Imran: 12-13]. These words of the Jews are a clear threat to the Messenger, may God bless him and grant him peace, of war, and a confirmation of their violation of the treaty between them and him. However, the Messenger, may God bless him and grant him peace, was patient with them, but they insisted on their violation of the covenant.\nExpulsion of the Jews of Banu Qaynuqa from Medina:\nOne day, a Muslim woman went to the market of Banu Qaynuqa to sell her gold. The Jews tricked her into revealing her face, but she refused. So the jeweler took the edge of her dress and tied it to the waist.\nHer back - and she did not know it - when she got up, her private parts were exposed, and they started laughing\nFrom her, the woman shouted for help after her dignity was challenged. Then a Muslim man jumped on the Jew who had insulted the woman and killed him. Then the Jews killed that Muslim, and he was a martyr for the sake of God. So war broke out between the Muslims and the Jews because of their treachery, insolence, and bad manners. _[Al-Waqidi].\nWhen the Banu Qaynuqa learned of the arrival of the Muslims, they fled to their forts and hid there. So the Muslims besieged them and imprisoned them in their fortresses, and this siege lasted fifteen days, after which the Jews were forced to open the fortresses and surrender out of terror and fear of the Muslims, so Abdullah bin Ubayy bin Salul came, He said: “O Muhammad, be a good friend to (my allies) and remain\nIbn Salul interceded for them with the Messenger until the Prophet, may God bless him and grant him peace, contented himself with expelling them from Medina, so they left, leaving behind their money as spoils for the Muslims, and they went to a town called Adhra’at in the Levant, and there God imposed an epidemic on them in which most of them died.\nKa'b bin Al-Ashraf killed the Jew:\nTwo large groups of Jews remained in Medina: Banu al-Nadir and Banu Qurayza, and they are still hostile to Muslims despite the covenant made by the Messenger of God, may God bless him and grant him peace.\nWith them, this is a man from among their rich people named Kaab bin Al-Ashraf. He was not satisfied with mourning the deaths of the infidels at Badr, but he went to Mecca and consoled them, and began to lament their dead with his poetry and ignite the fire of vengeance in their hearts so that they would fight the Muslims. And he was not satisfied with this, as he went on to harm the Muslims directly, so he began to attack the Messenger of God, may God bless him and grant him peace.\nAnd the Companions - may God be pleased with them - and it applies to their honor. Then the Messenger of God, may God’s prayers and peace be upon him, said: (Who is Ka’b bin Al-Ashraf, for he has harmed God and His Messenger?) Then Muhammad bin Maslamah stood up and said: O Messenger of God, would you like me to kill him? He said: (Yes) He said: So he gave me permission to say something (that is, he would disgrace the Messenger, may God’s prayers and peace be upon him, and the Muslims until Ka’b was reassured by him). He, may God’s prayers and peace be upon him, said: (Say), so Muhammad bin Maslama went to Ka’b bin Al-Ashraf, the Jew. He said to him: This man has asked us for charity (i.e., money), and he has exhausted us (we are tired), and I have come to you to borrow money from you (i.e., to ask you for money). Ka’b said: And also, by God, you will tire of him (you will become bored with the company of Muhammad). Muhammad bin Maslama said: We have followed him, so we do not like to let him (leave him) look at anything that happens to him, and we wanted you to lend us a wasq or two (al-wasq: kayl). It is known) and he said: Yes, mortgage me. They said: What do you want? He said: Pawn your wives to me. They said: How can we mortgage our women to you when you are the most beautiful of the Arabs? He said: Pawn your sons to me? They said: How can we mortgage our children to you, and one of them curses, and it is said: He mortgaged one or two wasqs? This is a disgrace to us, but we pledge to you the lamma (weapon). So he promised him that he would come to him, so he came to him at night, and with him was Abu Na’ila - who is Ka’b’s brother.\nBreastfeeding - So he called them to the fort, and he went down to them and his wife said to him: Where is the exit at this hour? He said: It is Muhammad bin Maslama and my two infants, Abu Na’ila. So he came down to them, exuding a scent of perfume from him. Abu Na’ila said: I have never seen a better scent than today. Would you permit me to smell your head? He said: Yes, and when he gained control of him, he said: Come on, kill him. So they killed him, then they came to the Prophet, may God bless him and grant him peace, and informed him. [Al-Tirmidhi].",
    "number-en": "The Jews and the breaking of the covenant",
    "number_en-en": "The Jews and the Violation of the Covenant"
  },
  {
    "number": "فتح مكة ",
    "text": "",
    "label": "بعد صلح الحديبية انضمت قبيلة بكر لقريش ، وانضمت قبيلة خزاعة لحلف المسلمين . وكان بين بني بكرٍ وقبيلة خزاعة ثارات في الجاهلية ودماء ، وذات يومٍ تعرضت قبيلة خزاعة لعدوانٍ من قبيلة بكر الموالية لقريش ، وقتلوا منهم نحو عشرين رجلاً . ودخلت خزاعة الحرم للنجاة بنفسها ، ولكن بني بكرٍ لاحقوهم وقتلوا منهم في الحرم . فجاء عمرو بن سالم الخزاعي الرسول صلى الله عليه وسلم يخبرهم بعدوان قبيلة بكرٍ عليهم ، وأنشد الرسول صلى الله عليه وسلم شعراً : يا رب إني نـاشد محمداً حلف أبـينا وأبيه الأتلدا إنه قريشٌ أخلفوك المـوعدا ونقضوا ميثاقك المؤكدا فانصر رسول الله نصراً أعتدا وادع عباد الله يأتوا مدداً فقال له رسول الله عليه وسلم : \" نصرت يا عمرو بن سالم ، والله لأمنعنكم مما أمنع نفسي منه \" . ودعا الله قائلاً \" اللهم خذ العيون والأخبار عن قريش حتى نبغتها في بلادها \". وندمت قريش على مساعدتها لبني بكرٍ ، ونقضها للعهد ، فأرسلت أبا سفيانٍ إلى المدينة ليصلح ما فسد من العهد ، ولكنه عاد خائباً إلى مكة . وأخذ رسول الله عليه وسلم يجهز الجيش للخروج إلى مكة . فحضرت جموعٌ كبيرة من القبائل . ولكن حدث شيءٌ لم يكن متوقعاً من صحابي . وهو أن الصحابي حاطب بن أبي بلتعة كتب كتاباً بعث به إلى قريشٍ مع امرأة ، يخبرهم بما عزم عليه رسول الله عليه وسلم ، وأمرها أن تخفي الخطاب في ضفائر شعرها حتى لا يراها أحدٌ . فإذا الوحي ينزل على رسول الله عليه وسلم بما صنع حاطب ، فبعث الرسول صلى الله عليه وسلم علي بن أبي طالب والزبير بن العوام ليلحقا بالمرأة . وتم القبض عليها قبل أن تبلغ مكة ، وعثرا على الرسالة في ضفائر شعرها . فلما عاتب النبي صلى الله عليه وسلم حاطباً اعتذر أنه لم يفعل ذلك ارتداداً عن دينه ، ولكنه خاف إن فشل رسول الله عليه وسلم على أهله والذين يعيشون في مكة . فقال عمر : \" يا رسول الله ، دعني أضرب عنق هذا المنافق \" . فقال رسول الله عليه وسلم: \" إنه قد شهد بدراً ، وما يدريك لعل الله قد اطلع على من شهد بدراً فقال اعملوا ما شئتم فقد غفرت لكم \" . وكان حاطب ممن حارب مع رسول الله عليه وسلم في غزوة بدر . فعفا عنه ، وتحرك جيش المسلمين بقيادة رسول الله عليه وسلم إلى مكة في منتصف رمضان من السنة الثامنة للهجرة . وبلغ عددهم نحو عشرة آلاف مقاتل . ووصلوا \" مر الظهران \" قريباً من مكة ، فنصبوا خيامهم ، وأشعلوا عشرة آلاف شعلة نار . فأضاء الوادي . وهناك تقابل العباس بن عبد المطلب وأبو سفيان . فأخذه العباس إلى رسول الله صلى الله عليه وسلم . فقال له الرسول عليه الصلاة والسلام : \" ويحك يا أبا سفيانٍ أما آن لك أن تعلم أن لا إله إلا الله ؟ \" . فقال العباس : \" والله لقد ظننت أن لو كان مع الله غيره لقد أغنى عني شيئاً بعد \" . قال رسول الله صلى الله عليه وسلم : \" ويحك ألم يأن لك أن تعلم أني رسول الله ؟ \" فقال : \" أما هذه فإن في النفس منها حتى الآن شيئاً \" . وبعد حوارٍ طويلٍ دخل أبو سفيانٍ في الإسلام . وقال العباس : \" إن أبا سفيانٍ يحب الفخر فاجعل له شيئاً . فقال الرسول صلى الله عليه وسلم : \" من دخل دار أبي سفيانٍ فهو آمن ومن دخل المسجد فهو آمن ومن أغلق بابه فهو آمن \" . وأراد الرسول صلى الله عليه وسلم أن يري أبا سفيانٍ قوة المسلمين ، فحبسه عند مضيق الجبل . ومرت القبائل على راياتها ، ثم مر رسول الله صلى عليه وسلم في كتيبته الخضراء. فقال أبو سفيان : ما لأحدٍ بهؤلاء من قبل ولا طاقة . ثم رجع أبو سفيانٍ مسرعاً إلى مكة ، ونادى بأعلى صوته : \" يا معشر قريش ، هذا محمدٌ قد جاءكم فيما لا قبل لكم به . فمن دخل داري فهو آمن ، ومن أغلق عليه بابه فهو آمن ، ومن دخل المسجد فهو آمن \". فهرع الناس إلى دورهم وإلى المسجد . وأغلقوا الأبواب عليهم وهم ينظرون من شقوقها وثقوبها إلى جيش المسلمين ، وقد دخل مرفوع الجباه . ودخل جيش المسلمين مكة في صباح يوم الجمعة الموافق عشرين من رمضان من السنة الثامنة للهجرة . ودخل رسول الله صلى الله عليه وسلم مكة من أعلاها وهو يقرأ قوله تعالى : (( إنا فتحنا لك فتحاً مبيناً )) واستسلمت مكة ، وأخذ المسلمون يهتفون في جنبات مكة وأصواتهم تشق عناء السماء : الله أكبر .. الله أكبر . وتوجه رسول الله صلى الله عليه وسلم إلى الحرم ، وطاف بالكعبة ، وأمر بتحطيم الأصنام المصفوفة حولها . وكان يشير إليها وهو يقول : (( و قل جاء الحق و زهق الباطل إن الباطل كان زهوقاً )) وبعد أن طهرت الكعبة من الأصنام أمر النبي عليه الصلاة والسلام بلالاً أن يؤذن فوقها . ثم قال رسول الله صلى الله عليه وسلم : \" يا معشر قريش ، ما ترون أني فاعل بكم ؟ \" قالوا : \" خيراً . أخٌ كريمٌ وابن أخٍ كريم \" . فقال عليه الصلاة والسلام : \" اذهبوا فأنتم الطلقاء\". فما أجمل العفو عند المقدرة ، وما أحلى التسامح والبعد عن الانتقام . ولننظر ما فعل الغالبون بالمغلوبين في الحربين العالميتين في قرننا هذا ، قرن الحضارة كما يقولون ، لنعلم الفرق ما بين الإسلام والكفر . وهكذا ارتفعت راية الإسلام في مكة وما حولها ، وراح الناس ينعمون بتوحيد الله",
    "number-en": "Conquest of Mecca",
    "label-en": "After the Treaty of Hudaybiyyah, the Bakr tribe joined the Quraysh, and the Khuza’a tribe joined the Muslim alliance. There were blood feuds and bloodshed between the Banu Bakr and the Khuza’a tribe, and one day the Khuza’a tribe was exposed to aggression from the Bakr tribe, which was loyal to Quraysh, and they killed about twenty of their men. Khuza’a entered the Haram to escape herself, but Banu Bakr pursued them and killed some of them in the Haram. Then Amr bin Salem Al-Khuza’i came to the Messenger, may God’s prayers and peace be upon him, informing them of the Bakr tribe’s aggression against them. The Messenger, may God’s prayers and peace be upon him, recited a poem: O Lord, I appeal to Muhammad by the oath of our father and his ancient father. It is a Quraysh who broke the promise to you and broke your confirmed covenant. So the Messenger of God gave a decisive victory and called on the servants of God to come in aid. So the Messenger of God, may God bless him and grant him peace, said to him: “You have been victorious, O.” Amr bin Salem, by God, I will prevent you from what I prevent myself from.” He prayed to God, saying, “O God, take away the eyes and the news from the Quraysh so that we may reach them in their country.” Quraysh regretted helping Banu Bakr and breaking the covenant, so they sent Abu Sufyan to Medina to repair the broken covenant, but he returned disappointed to Mecca. The Messenger of God, peace and blessings be upon him, began preparing the army to leave for Mecca. Large crowds of tribes came. But something happened that my companions did not expect. It is that the companion Hatib bin Abi Balta’ah wrote a letter that he sent to the Quraysh with a woman, informing them of what the Messenger of God, peace and blessings be upon him, had resolved to do, and he ordered her to hide the letter in the braids of her hair so that no one would see it. Then the revelation descended upon the Messenger of God, may God bless him and grant him peace, about what Hatib had done, so the Messenger, may God bless him and grant him peace, sent Ali bin Abi Talib and Al-Zubair bin Al-Awwam to join the woman. She was arrested before she reached Mecca, and they found the message in her hair. When the Prophet, may God bless him and grant him peace, blamed Hatib, he apologized that he had not done so as an apostasy from his religion, but he feared that the Messenger of God, may God bless him and grant him peace, would fail his family and those who lived in Mecca. Omar said: “O Messenger of God, let me strike the neck of this hypocrite.” The Messenger of God, peace and blessings be upon him, said: “He witnessed Badr, and how do you know? Perhaps God has seen those who witnessed Badr and said, ‘Do whatever you want, for I have forgiven you.’” Hatib was one of those who fought with the Messenger of God, peace and blessings be upon him, in the Battle of Badr. He pardoned him, and the Muslim army, led by the Messenger of God, peace and blessings be upon him, moved to Mecca in the middle of Ramadan in the eighth year of the Hijra. Their number reached about ten thousand fighters. They arrived at Mar al-Dhahran, close to Mecca, so they set up their tents and lit ten thousand torches of fire. The valley lit up. There he met Abbas bin Abdul Muttalib and Abu Sufyan. So Al-Abbas took him to the Messenger of God, may God bless him and grant him peace. The Messenger, peace and blessings be upon him, said to him: “Woe to you, Abu Sufyan. Isn’t it time for you to learn that there is no god but God?” Al-Abbas said: “By God, I thought that if there was someone other than Him with God, He would still be of no use to me.” The Messenger of God, may God’s prayers and peace be upon him, said: “Woe to you. Has not the time come for you to know that I am the Messenger of God?” He said: “As for this woman, there is something in her soul until now.” After a long dialogue, Abu Sufyan converted to Islam. Al-Abbas said: “Abu Sufyan loves pride, so give him something.” The Messenger, may God bless him and grant him peace, said: “Whoever enters Abu Sufyan’s house is safe, and whoever enters the mosque is safe, and whoever closes its door is safe.” The Messenger, may God bless him and grant him peace, wanted to show Abu Sufyan the strength of the Muslims, so he imprisoned him at the mountain gorge. The tribes passed by with their flags, then the Messenger of God, may God bless him and grant him peace, passed with his green battalion. Abu Sufyan said: No one has had the power to do this before. Then Abu Sufyan quickly returned to Mecca and called out at the top of his voice: “O people of Quraysh, this is Muhammad, who has come to you with something that you have never seen before. Whoever enters my house is safe, and whoever closes his door is safe, and whoever enters the mosque is safe.” So the people rushed to their homes and to the mosque. They closed the doors on them as they looked through their cracks and holes at the Muslim army, with their foreheads raised. The Muslim army entered Mecca on the morning of Friday, corresponding to the twentieth of Ramadan in the eighth year of the Hijra. The Messenger of God, may God bless him and grant him peace, entered Mecca from its top while reciting the Almighty’s saying: ((Indeed, I am We have given you a clear victory.) Mecca surrendered, and the Muslims began chanting on the outskirts of Mecca, their voices tearing through the sky: God is Great... God is Great. The Messenger of God, may God bless him and grant him peace, headed to the Sanctuary, circumambulated the Kaaba, and ordered the destruction of the idols arranged around it. He was pointing to it and saying: ((And say, “The truth has come and falsehood has perished. Indeed, falsehood has perished.”) After the Kaaba was cleansed of idols, the Prophet, peace and blessings be upon him, ordered Bilal to give the call to prayer above it. Then the Messenger of God, may God bless him and grant him peace, said: “O people of Quraysh, what do you think I will do to you?” They said: “Good. A generous brother and a generous nephew.” He, peace and blessings be upon him, said: “Go, for you are free.” How beautiful is forgiveness when one is able, and how beautiful is forgiveness and avoiding revenge. Let us look at what the victors did to the vanquished in the two world wars in our century, the century of civilization as they say, so that we may know the difference between Islam and disbelief. Thus, the banner of Islam was raised in Mecca and its environs, and people began to enjoy the monotheism of God"
  },
  {
    "number": "بعث الرجيع",
    "text": "",
    "label": "جاء إلى النبي صلى الله عليه وسلم أناس من المشركين من قبيلتي عضل والقارة وطلبوا منه أن يرسل معهم من يعلمهم الدين ويقرئهم القرآن، فاستجاب لهم النبي صلى الله عليه وسلم، وأرسل معهم عشرة من أصحابه بقيادة عاصم بن ثابت -رضي الله عنه- لعل الله أن يهديهم، وعندما اقترب عاصم وأصحابه من قبيلة هذيل، هجم عليهم هؤلاء المشركون المخادعون، فاستشهد سبعة من المسلمين، ووقع ثلاثة في الأسر، وهم: خبيب بن عدي، وزيد بن الدثنة\nوعبد الله بن طارق -رضي الله عنهم- وأخذهم نفر من قبيلة هذيل، ليبيعوهم في مكة، فأفلت عبد الله بن طارق من قيوده، فلحق به الكفار وقتلوه، وباعوا زيدًا لصفوان بن أمية ليقتله ثأرًا لأبيه أمية بن خلف، واجتمع كفار مكة ليشهدوا قتل زيد، فاقترب أبو سفيان منه، وقال له: أنشدك الله يا زيد، أتحب أن محمدًا الآن عندنا مكانك نضرب عنقه، وأنك في أهلك؟ فأجابه زيد قائلاً: والله ما أحب أن محمدًا صلى الله عليه وسلم الآن في مكانه الذي هو فيه، تصيبه شوكة\nتؤذيه، وأني جالس في أهلي، فقال أبو سفيان: ما رأيتُ من الناس أحدًا يحب أحدًا كحب أصحاب محمدٍ محمدًا، ثم قُتل زيد.\nأما خبيب فقد اشتراه عقبة بن الحارث ليقتله؛ لأنه قتل أباه الحارث بن عامر\nيوم بدر، وخرج به المشركون في مكان واسع، وصنعوا له صليبًا من خشب ليصلبوه عليه، فقال لهم خبيب: إن رأيتم أن تدعوني حتى أركع ركعتين فافعلوا وبعد أن صلى آخر ركعتين في حياته قال لهم: أما والله لولا أن تظنوا أني إنما طولت جزعًا من القتل لاستكثرت من الصلاة، فكان خبيب أول من سن ركعتين عند القتل، وعندما ربطوه في الخشبة توجه إلى الله تعالى، وقال: اللهم أحصهم عددًا، واقتلهم بددًا، ولا تغادر منهم أحدًا.\nوأما عاصم بن ثابت، فقد رفض أن يستسلم للمشركين، وقاتلهم حتى قتل فأرادوا أن يأخذوا رأسه ليبيعوها لسلافة بنت سعد، وكانت قد نذرت حين أصاب ابنيها يوم أحد لئن قدرت على رأس عاصم لتشربن فيها الخمر، لكن النحل تجمع حول جسد عاصم فلم يقدروا على قطع رأسه، فقالوا: دعوه حتى يمسي فيذهب عنه الدبر (النحل) فنأخذه، فبعث الله سيلا في الوادي، فاحتمل عاصمًا، فذهب به، وكان عاصم قد أعطى الله عهدًا ألا يمسه مشرك ولا يمس مشركًا أبدًا، فحفظه الله بعد موته، ولم يسمح للمشركين بمسه.                      ",
    "number-en": "He sent the return",
    "label-en": "Some polytheists from the Adhal and Al-Qara tribes came to the Prophet, may God’s prayers and peace be upon him, and asked him to send with them someone who would teach them the religion and recite the Qur’an to them. The Prophet, may God’s prayers and peace be upon him, responded to them and sent with them ten of his companions led by Asim bin Thabit - may God be pleased with him - in the hope that God would guide them. When Asim and his companions approached the Hudhayl tribe, these deceitful polytheists attacked them, and seven Muslims were martyred, and three were captured, and they were: Khubayb bin Adi and Zaid bin Al-Dathna\nAnd Abdullah bin Tariq - may God be pleased with them - and a group of people from the Hudhayl tribe took them to sell them in Mecca. Abdullah bin Tariq escaped from his chains, so the infidels caught up with him and killed him, and they sold Zaid to Safwan bin Umayyah to kill him in revenge for his father Umayyah bin Khalaf. The infidels of Mecca gathered to witness the killing of Zayd, so Abu Sufyan approached him and said to him: I adjure you by God, Zaid. Would you like to be Muhammad? Now we have you in your place to behead him, and that you are among your family? Zaid answered him, saying: By God, I would not like Muhammad, may God bless him and grant him peace, to be hurt by a thorn now in the place he is in.\nYou hurt him, and I was sitting with my family. Abu Sufyan said: I have never seen anyone love anyone as much as Muhammad’s companions loved Muhammad. Then Zaid was killed.\nAs for Khubaib, Uqba bin Al-Harith bought him to kill him. Because he killed his father, Al-Harith bin Amer\nOn the day of Badr, the polytheists took him out in a wide place and made a cross of wood for him to crucify him on. Khubayb said to them: If you think you should call me to pray two rak’ahs, then do so. After he prayed the last two rak’ahs of his life, he said to them: By God, if you had not thought that I had only been so long out of fear of killing, I would have prayed a lot. Khubayb was the first to enact two rak’ahs upon killing, and when they tied him to the stake, he turned to God Almighty and said: Oh God, count them in number, kill them scattered, and do not leave any of them behind.\nAs for Asim bin Thabit, he refused to surrender to the polytheists, and fought them until he was killed. They wanted to take his head and sell it to Sulafa bint Saad. She had vowed when her two sons were killed on the day of Uhud that if she captured Asim’s head, they would drink alcohol from it, but the bees gathered around Asim’s body and they were not able to cut off his head. They said: Leave him until the evening and the bees leave him, so we will take him. So God sent a flood in the valley, so he endured. Asim, so he went with him, and Asim had given God a covenant that a polytheist would never touch him and that he would never touch a polytheist, so God preserved him after his death, and did not allow the polytheists to touch him."
  },
  {
    "number": "يوم بئر معونة",
    "text": "",
    "label": "رغم ما حدث للعشرة الذين قتلوا في بعث الرجيع، ما زال المسلمون يقدمون أرواحهم في سبيل نشر الدين، فقد باعوا أنفسهم لله تعالى، واشتروا بها\nالجنة، فقد قدم عامر بن مالك على رسول الله صلى الله عليه وسلم\nالمدينة، فعرض عليه الإسلام، فلم يسلم ولم يرفض، وقال للرسول صلى الله عليه وسلم: لو بعثت رجالا من أصحابك إلى أهل نجد، فدعوهم إلى أمرك رجوت أن يستجيبوا لك، فقال صلى الله عليه وسلم: إني أخشى عليهم أهل نجد، فقال عامر: أنا لهم جار (أي: سوف أحميهم).\nفبعث معه رسول الله صلى الله عليه وسلم سبعين رجلا من صحابته ليدعوا قبائل نجد إلى الإسلام، فسار الصحابة في الصحراء، وكانوا يجمعون الحطب نهارًا ويبيعونه حتى يكسبوا معاشهم، وينامون بعض الليل، ثم يستيقظون لعبادة الله بقية ليلهم، وظلوا هكذا حتى وصلوا إلى بئر معونة، وهناك أرسلوا أحدهم، ويدعى حرام بن ملحان -رضي الله عنه- برسالة من الرسول صلى الله عليه وسلم يدعو فيها عامر بن الطفيل إلى الإسلام.\nولكن هذا المشرك طعن حرام بن ملحان بكل غدر وحمق وجهالة، فصاح ذلك الصحابي -والدم يسيل من جسده الطاهر- قائلا: فزت ورب الكعبة، ولم يكتفِ عامر بن الطفيل بما فعله، وإنما جمع أعوانه من الكفار، وأحاطوا بالمسلمين وهم في رحالهم، وقتلوهم جميعًا إلا كعب بن زيد الذي عاش حتى قتل يوم الخندق شهيدًا، وكان في سرح الدعاة اثنان لم يشهدا الموقعة الغادرة، أحدهما\nعمرو بن أمية الضمري ولم يعرف النبأ إلا فيما بعد، ورجل من الأنصار، فأقبلا يدافعان عن إخوانهما، فقتل الأنصاري، وأسر عمرو بن أمية، ولكن عامر بن الطفيل أطلق سراحه، فرجع إلى المدينة.\nوفي الطريق لقى رجلين ظنهما من بني عامر فقتلهما، ثم تبين لما وصل إلى رسول الله صلى الله عليه وسلم أنهما من بني كلاب، وأن النبي صلى الله عليه وسلم قد أجارهما، فالتزم الرسول صلى الله عليه وسلم بدفع ديتهما، حزن الرسول صلى الله عليه وسلم وصحابته حزنًا شديدًا على هؤلاء الصحابة، وظل الرسول صلى الله عليه وسلم شهرًا يقنت في صلاة الصبح ويدعو على قبائل سليم، مؤجلا الرد عليهم حتى يتخلص من أعداء المسلمين في المدينة؛ لأن خطرهم أشد، ألا وهم يهود بني النضير.",
    "number-en": "Day of Bir Maona",
    "label-en": "Despite what happened to the ten who were killed in the resurrection, Muslims still sacrifice their lives for the sake of spreading the religion. They sold their souls to God Almighty, and bought them with it.\nParadise, Amer bin Malik came to the Messenger of God, may God bless him and grant him peace\nMedina, so he offered him Islam, but he did not accept Islam or reject it. He said to the Messenger, may God bless him and grant him peace: If you send men from your companions to the people of Najd and invite them to your command, I hope that they will respond to you. So he, may God bless him and grant him peace, said: I fear for the people of Najd, and Amer said: I am their neighbor (meaning: I will protect them).\nSo the Messenger of God, may God bless him and grant him peace, sent with him seventy of his companions to invite the tribes of Najd to Islam. The companions walked in the desert, and they collected firewood during the day and sold it in order to earn their living. They slept part of the night, then woke up to worship God for the rest of their night, and they remained like this until they reached Bir Ma’una, and there they sent one of them, called Haram bin Malhan - may God be pleased with him - with a message from the Messenger, may God bless him and grant him peace, calling on Amer bin The parasite to Islam.\nBut this polytheist stabbed Haram bin Malhan with all treachery, foolishness, and ignorance, and that companion shouted - with blood flowing from his pure body - saying: I have won, by the Lord of the Kaaba. And Amer bin Al-Tufayl was not satisfied with what he did, but rather gathered his helpers from the infidels, and surrounded the Muslims while they were on their journey, and killed them all except Kaab bin Zaid, who lived until he was killed as a martyr on the Day of the Trench, and two of the preachers were in the squad who did not witness the treacherous battle. One of them\nAmr bin Umayyah Al-Dhamri did not know the news until later, and a man from the Ansar came to defend their brothers. Al-Ansari was killed, and Amr bin Umayyah was captured, but Amer bin Al-Tufayl released him, so he returned to Medina.\nOn the way, he met two men whom he thought were from Bani Amir, and he killed them. Then it became clear when he reached the Messenger of God, may God bless him and grant him peace, that they were from Bani Kilab, and that the Prophet, may God bless him and grant him peace, had hired them. So the Messenger, may God bless him and grant him peace, committed himself to paying their blood money. The Messenger, may God bless him and grant him peace, and his companions became deeply saddened by these companions. For a month, the Messenger, may God bless him and grant him peace, remained silent in the morning prayer and prayed for the tribes of Sulaim, delaying responding to them until He gets rid of the enemies of Muslims in Medina. Because their danger is greater, namely the Jews of Banu Nadir."
  },
  {
    "number": "سرية نجد",
    "text": "",
    "label": "في شهر المحرم من العام السادس الهجري خرجت سرية من المسلمين إلى\nبني بكر، فهرب بنو بكر خوفًا من المسلمين، وتركوا أنعامهم وإبلهم، فأخذها المسلمون، وبينما المسلمون عائدون وجدوا أمامهم ثمامة بن أثال، ولم يكن قد أسلم بعد، فقبض عليه المسلمون، وعندما وصلوا المدينة ربطوه في أحد أعمدة المسجد، وعندما رأى ثمامة الرسول صلى الله عليه وسلم طلب منه أن يطلقه مقابل ما يريد من المال، وقال له: إن تقتل تقتل ذا دم (أي: رجلا له مكانة في قومه وسوف يثأرون له) وإن تنعم تنعم على شاكر (أي رجل يعرف لك جميلك ويكافئك عليه).\nفعفا عنه الرسول صلى الله عليه وسلم، وأطلق سراحه، فانصرف ثمامة، ولكنه عاد إلى الرسول صلى الله عليه وسلم وأعلن إسلامه، وقال: أشهد أن لا إله إلا الله، وأشهد أن محمدًا رسول الله، يا محمد، والله ما كان على الأرض وجه أبغض إلي من وجهك، فقد أصبح وجهك أحب الوجوه إلي، والله ما كان من دين أبغض إلي من دينك، فأصبح دينك أحب الدين إلي، والله ما كان من بلد أبغض إلي من بلدك، فأصبح بلدك أحب البلاد إلي، وإن خيلك أخذتني وأنا أريد العمرة، وذهب ثمامة إلى مكة، فلما عرفوا أنه قد أسلم قالوا له: صبوت\n(أي: فارقت دينك)؟ قال: لا والله .. ولكن أسلمت مع محمد رسول الله\nصلى الله عليه وسلم، والله لا يأتيكم من اليمامة حبة حنطة (قمح) حتى يأذن فيها النبي صلى الله عليه وسلم.\nومرت الأيام، وأحاط الجوع بقريش، واحتاجت إلى القمح، فأرسلوا إلى النبي صلى الله عليه وسلم يسألونه أن يأمر ثمامة بإرسال القمح إلى قريش، ورغم أن قريشًا حاصرت الرسول وقومه في شِعب أبي طالب ثلاث سنوات، وأذاقوهم عذاب الجوع، إلا أن الرسول صلى الله عليه وسلم قابل الإساءة بالإحسان ورفض تعريض قريش للجوع، وأمر ثمامة أن يبيع لهم القمح.\nغزوة بني لحيان\nلكي لا يتجرأ الكفار على المسلمين خرج رسول الله صلى الله عليه وسلم في شهر شعبان يريد بني لحيان، وقد أظهر أنه متوجه إلى الشام؛ ليفاجئ القوم ولينتقم من الذين غدروا بأصحابه يوم الرجيع، فلما سمعت هذه القبائل الغادرة بمقدمه هربت إلى الجبال، ومكث المسلمون يومين، وأرسل رسول الله صلى الله عليه وسلم بعض فرسانه قريبًا من مكة؛ لتسمع بهم قريش، وليعلموا بما حدث فيزدادوا خوفًا ورعبًا من المسلمين، ثم عاد المسلمون إلى المدينة.",
    "number-en": "Najd secret",
    "label-en": "In the month of Muharram of the sixth year of the Hijri, a group of Muslims went out to...\nBanu Bakr, so Banu Bakr fled in fear of the Muslims, and left their cattle and camels, so the Muslims took them, and while the Muslims were returning, they found in front of them Thumama bin Athal, and he had not yet converted to Islam, so the Muslims arrested him, and when they arrived in the city, they tied him to one of the pillars of the mosque, and when Thumama saw the Messenger, may God bless him and grant him peace, he asked him to release him in exchange for whatever money he wanted, and he told him: If you kill, you will kill a bloodthirsty man (i.e. a man who has a position among his people and will They will avenge him) and if you are gracious, you will be gracious to a thankful man (i.e. a man who recognizes your kindness and rewards you for it).\nSo the Messenger, may God bless him and grant him peace, pardoned him and released him, so Thumama left, but he returned to the Messenger, may God bless him and grant him peace, and declared his conversion to Islam, and said: I bear witness that there is no god but God, and I bear witness that Muhammad is the Messenger of God, O Muhammad, by God there has never been a face on earth more hateful to me than yours, and your face has become the most beloved of faces to me, and by God there has never been a religion more hateful to me than your religion, so your religion has become the most beloved religion to me, and by God there has never been a country more hateful to me than your country, so it has become your country. I love the country to me, and your horses took me while I wanted to perform Umrah. Thumama went to Mecca, and when they knew that he had converted to Islam, they said to him: Sabot.\n(i.e., have you left your religion)? He said: No, by God.. but I converted to Islam with Muhammad, the Messenger of God\nMay God’s prayers and peace be upon him. By God, not a grain of wheat (wheat) will come to you from Al-Yamamah until the Prophet, may God’s prayers and peace be upon him, gives permission for it.\nDays passed, and hunger surrounded the Quraysh, and they needed wheat, so they sent to the Prophet, may God’s prayers and peace be upon him, asking him to order Thumama to send wheat to the Quraysh. Although the Quraysh besieged the Messenger and his people in the people of Abu Talib for three years, and made them suffer the torment of hunger, the Messenger, may God’s prayers and peace be upon him, responded to the abuse with kindness and refused to expose the Quraysh to hunger, and he ordered Thumama to sell them wheat.\nThe Battle of Banu Lahyan\nSo that the infidels would not dare attack the Muslims, the Messenger of God, may God’s prayers and peace be upon him, went out in the month of Shaban, seeking Banu Lahyan, and he revealed that he was heading to the Levant. To surprise the people and take revenge on those who betrayed his companions on the day of return. When these treacherous tribes heard of its arrival, they fled to the mountains. The Muslims stayed for two days, and the Messenger of God, may God bless him and grant him peace, sent some of his knights close to Mecca. So that the Quraysh would hear about them, and so that they would know what had happened, so that they would become more afraid and terrified of the Muslims. Then the Muslims returned to Medina."
  },
  {
    "number": "عمرة القضاء",
    "text": "",
    "label": "في العام السابع الهجري، أصبح للمسلمين الحق في دخول مكة للعمرة حسب اتفاقهم مع قريش في العام السابق، فخرج رسول الله ( ومعه ألفان من المسلمين ودخلوا مكة حاملين سيوفهم، وأخذوا يطوفون حول الكعبة في عزٍّ وقوة، حتى قال أهل مكة من الكفار، وهم ينظرون في دهشة إلى المسلمين وقوتهم: هؤلاء هم الذين قلتم: إن حُمَّى المدينة أضعفتهم! [أحمد]\nوقضى المسلمون عمرتهم ثم خرجوا من مكة بعد ثلاثة أيام احترامًا للاتفاق الذي عقدوه في صلح الحديبية مع كفار قريش، وسميت هذه العمرة بعمرة القضاء؛ لأن المشركين صدوا رسول الله ( عام الحديبية عن البيت الحرام، فكان مجيئه في العام التالي لقضاء ما فاته.\nوبينما الرسول ( وحوله أصحابه عائدون،إذا بفتاة تخرج من مكة، تجري خلفهم وتنادي رسول الله ( قائلة: يا عم. يا عم.\nإنها ابنة حمزة سيد الشهداء الذي استشهد في أحد، فأخذها علي بن أبي طالب، وسلمها إلى السيدة فاطمة زوجته، وإذا بزيد بن حارثة وجعفر يتنافسان على أيهما أحق بكفالتها.\nفقال جعفر: ابنة عمي وخالتها زوجتي. وقال علي: أنا أخذتها وهي بنت عمي.\nوقال زيد: ابنة أخي؛ لأن النبي ( قد آخى بين زيد وحمزة. فحكم النبي ( بأن تكون مع جعفر وزوجته. وقال: \"الخالة بمنزلة الأم\" [البخاري].\nوفي هذه العمرة تزوج الرسول ( من السيدة ميمونة بنت الحارث الهلالية\n-رضي الله عنه-.\nإسلام عمرو بن العاص:\nأمام انتصارات الإسلام المتتالية، وازدياد قوة المسلمين يومًا بعد يوم، وقف عمرو بن العاص مع نفسه، فهداه تفكيره إلى أن يرحل إلى الحبشة ويراقب من هناك صراع الإسلام مع المشركين من قريش، فإذا انتصر المسلمون كان آمنًا، وإذا انتصر الكفار عاد إليهم.\nوبينما عمرو بن العاص يستعد للدخول إلى النجاشي ملك الحبشة إذا به يرى عمرو بن أمية الضمري -رضي الله عنه- خارجًا من عنده، فلما دخل عمرو على النجاشي قال له: أيها الملك إن قد رأيت رجلاً يخرج من عندك وهو رسول رجل عدو لنا فأعطنيه لأقتله فإنه قد أصاب من أشرافنا وخيارنا.\nفغضب النجاشي، ولطم أنفه بضربة شديدة، حتى ظن عمرو أن أنف النجاشي قد كسرت، وارتعد عمرو من الخوف، لكنه تماسك وقال للنجاشي: أيها الملك! والله، لو ظننت أنك تكره هذا ما سألتكه. قال: أتسألني أن أعطيك رسول رجل يأتيه الناموس الأكبر الذي كان يأتي موسى فتقتله؟ فقال عمرو: أيها الملك، أكذاك هو؟ فقال النجاشي: ويحك يا عمرو! أطعني واتبعه فإنه والله لعلى الحق، وليظهرن على من خالفه كما ظهر موسى بن عمران على فرعون وجنوده.\nفقال عمرو: أفتبايعني له على الإسلام؟ قال: نعم.\nفبسط عمرو يده، فبايعه على الإسلام. فلما قدم عمرو المدينة ذهب إلى رسول الله ( ليبايعه وقال لرسول الله (: يا رسول الله إني أبايعك على أن تغفر لي ما تقدم من ذنبي ولا أذكر ما تأخر. فقال رسول الله (: \"يا عمرو بايع، فإن الإسلام يجُبُّ (يهدم) ما كان قبله، وإن الهجرة تَجُبُّ ما كان قبلها\"[ابن إسحاق] فأسلم عمرو، وكان إسلامه في العام الثامن الهجري.\nإسلام خالد بن الوليد:\nوقف خالد بن الوليد بعد صلح الحديبية حائرًا، فقد فَطن إلى أن النصر سيكون للمسلمين على قريش، وبدأ يفكر في مكان يذهب إليه.\nوعندما وصل المسلمون مكة في عمرة القضاء، ومعهم الوليد بن الوليد أخو خالد، ظل الوليد يبحث عن أخيه خالد، فلما لم يجده ترك له رسالة، قال فيها: بسم الله الرحمن الرحيم. أما بعد، فإني لم أر أعجب من ذهاب رأيك عن الإسلام، وعقلك عقلك! ومثلُ الإسلام جهله أحد؟! وقد سألني رسول الله ( عنك فقال: \"أين خالد؟\" فقلت: يأتي الله به. فقال: \"مثله جهل الإسلام! ولو كان جعل نكايته وجدَّه مع المسلمين على المشركين، لكان خيرًا له، ولقدَّمناه على غيره\". فاستدرك يا أخي ما فاتك من مواطن صالحة. قرأ خالد هذه الكلمات الصادقة، فانشرح صدره للإسلام وتوجه إلى رسول الله (.\nوفي الطريق، التقى بعمرو بن العاص، وعثمان بن طلحة فتوجهوا معًا إلى المدينة وقد جمع الإسلام بين قلوبهم، فلما رآهم الرسول ( أشرق وجهه بابتسامة عذبة، وبايعهم على الإسلام.",
    "number-en": "The Umrah of the judiciary",
    "label-en": "In the seventh year of the Hijri year, Muslims had the right to enter Mecca for Umrah according to their agreement with the Quraysh in the previous year, so the Messenger of God (with two thousand Muslims) went out and entered Mecca carrying their swords, and began to circumambulate the Kaaba in might and strength, until the infidels of Mecca said, as they looked in astonishment at the Muslims and their strength: These are the ones you said: The heat of Medina has weakened them! [Ahmed]\nThe Muslims performed their Umrah and then left Mecca three days later, out of respect for the agreement they had made in the Treaty of Hudaybiyyah with the infidels of Quraysh. This Umrah was called the Umrah al-Qadha. Because the polytheists repelled the Messenger of God (in the year of Hudaybiyyah) from the Sacred House, so he came the following year to make up for what he had missed.\nWhile the Messenger and his companions were returning around him, a girl came out of Mecca, running behind them and calling the Messenger of God, saying: Uncle. Uncle.\nShe is the daughter of Hamzah, the master of the martyrs, who was martyred in Uhud. Ali bin Abi Talib took her and handed her over to Mrs. Fatima, his wife. Suddenly, Zaid bin Haritha and Jaafar were competing over which of them was more worthy of sponsoring her.\nJaafar said: My cousin and her aunt is my wife. Ali said: I took her and she is my cousin.\nZaid said: My brother’s daughter. Because the Prophet (had brought brotherhood between Zaid and Hamza. So the Prophet ruled that she should be with Jaafar and his wife. He said: “The maternal aunt is in the same position as the mother” [Al-Bukhari].\nDuring this Umrah, the Messenger (PBUH) married Mrs. Maymunah bint Al-Harith Al-Hilaliyya\n-May God be pleased with him-.\nAmr bin Al-Aas converted to Islam:\nIn the face of the successive victories of Islam, and the increasing strength of the Muslims day after day, Amr ibn al-Aas stood with himself, and his thoughts guided him until he traveled to Abyssinia and watched from there the struggle of Islam with the polytheists of Quraysh. If the Muslims were victorious, he would be safe, and if the infidels were victorious, he would return to them. While Amr ibn al-Aas was preparing to enter the Negus, King of Abyssinia, he saw Amr ibn Umayyah al-Dhamri - may God be pleased with him - leaving him. When Amr entered upon the Negus, he said to him: O king, if I saw a man leaving you and he is the messenger of a man who is an enemy of ours, then give him to me so that I can kill him, for he has struck among our nobles and our best.\nThe Negus became angry and hit his nose with a severe blow, until Amr thought that the Negus’ nose had been broken. Amr trembled with fear, but he held himself together and said to the Negus: O king! By God, if I thought you hated me, this is what I would have asked you. He said: Are you asking me to give you the messenger of a man who receives the greater law that Moses used to bring, so you can kill him? Amr said: O king, is that the case? Al-Najashi said: Woe to you, Amr! Obey me and follow him, for by God he is upon the truth, and they will prevail over those who disagree with him as Musa bin Imran appeared over Pharaoh and his soldiers.\nAmr said: Will you pledge my allegiance to him on the basis of Islam? He said: Yes.\nAmr extended his hand and pledged his allegiance to Islam. When Amr came to Medina, he went to the Messenger of God (to pledge allegiance to him), and he said to the Messenger of God: “O Messenger of God, I pledge allegiance to you on the condition that you forgive me for my past sins, and I do not mention my future sins.” Then the Messenger of God said: “O Amr, pledge allegiance, for Islam obliterates (destroys) what came before it, and immigration obliterates what came before it.” [Ibn Ishaq] So Amr converted to Islam, and his conversion to Islam was in the eighth year of the Hijri.\nIslam Khalid bin Al-Walid:\nAfter the Treaty of Hudaybiyyah, Khalid bin Al-Walid stood confused. He realized that victory would be for the Muslims over the Quraysh, and he began to think about where to go.\nWhen the Muslims arrived in Mecca for the Umrah of Judiciary, and with them was Al-Walid bin Al-Walid, Khaled’s brother, Al-Walid kept searching for his brother Khaled, and when he did not find him, he left him a message, in which he said: In the name of God, the Most Gracious, the Most Merciful. Now, I have not seen any wonder that your opinion has departed from Islam, and your mind has left your mind! Is there any example of Islam that no one is ignorant of?! The Messenger of God asked me about you, and he said: “Where is Khaled?” I said: God will bring him. He said: “Like him is ignorance of Islam! If he had set out to spite the polytheists with the Muslims, it would have been better for him, and we would have given him precedence over others.” So, my brother, realize what good positions you have missed. Khaled read these sincere words, so he opened his heart to Islam and turned to the Messenger of God (.\nOn the way, he met Amr ibn al-Aas and Uthman ibn Talha, and they headed together to Medina, and Islam united their hearts. When the Messenger saw them, his face shone with a sweet smile, and he pledged allegiance to them in Islam."
  },
  {
    "number": "دعوة الملوك الى الإسلام",
    "text": "",
    "label": "بدأ رسول الله ( يبعث برسائله إلى ملوك وحكام العالم يدعوهم فيها إلى الإسلام، فأرسل ( إلى النجاشي ملك الحبشة عمرو بن أمية الضمري، فوضع النجاشي الرسالة على عينيه، ونزل عن سريره تواضعًا واحترامًا له واعتنق الإسلام وقال: لو كنت أستطيع أن آتيه لأتيته.\nوأرسل إلى المقوقس حاكم مصر حاطب بن أبي بلتعة، فأحسن المقوقس استقباله، وأعطاه هدايا كثيرة للنبي ( وجاريتين، وبغلة، وطبيبًا، ولكنه لم يدخل الإسلام خوفًا على ملكه.\nوأرسل دحية بن خليفة الكلبي إلى هرقل ملك الروم، فسلمه دحية كتاب النبي ( الذي يقول فيه: \"بسم الله الرحمن الرحيم، من محمد عبد الله ورسوله إلى هرقل عظيم الروم، سلام على من اتبع الهُدَى. أما بعد، فإني أدعوك بدعاية الإسلام، أسلم تسلم، أسلم يؤتك الله أجرك مرتين، فإن توليت فإن عليك إثم الأريسيين (عامة الشعب)، (قل يا أهل الكتاب تعالوا إلى كلمة سواء بيننا وبينكم ألا نعبد إلا الله ولا نشرك به شيئًا ولا يتخذ بعضنا بعضًا أربابًا من دون الله فإن تولوا فقولوا اشهدوا بأنا مسلمون) [آل عمران: 64] [البخاري].\nفجمع هرقل وزراءه وحاشيته وقال لهم: يا معشر الروم، هل لكم في الفلاح والرشد، وأن يثبت ملكُكُم فتبايعوا هذا النبي (؟ فثارت الحاشية، ورفعوا الصليب وأعلنوا عصيانهم، فلما رأى هرقل ذلك يئس من إسلامهم، وخاف على نفسه وملكه، فقام بتهدئتهم، ثم قال: إني قلت مقالتي آنفًا لأختبر بها شدتكم على دينكم، فقد رأيت. فسجدوا له، ورضوا عنه. [البخاري].\nأما كسرى ملك الفرس، فقد بعث إليه النبي ( بكتاب مع عبد الله بن حذافة، وآمن بالله وقد جاء فيه: \"بسم الله الرحمن الرحيم. من محمد رسول الله إلى كسرى عظيم فارس، سلام على من اتبع الهدى، وآمن بالله ورسوله، وشهد أنه لا إله إلا الله وأن محمدًا عبده ورسوله، وإني أدعوك بدعاء الله، وإني رسول الله إلى الناس كافة لأنذر من كان حيًّا ويحق القول على الكافرين، فأسلم تسلم، وإن توليت فإنما إثم المجوس عليك\" [ابن إسحاق].\nفمزق كسرى الرسالة، وأرسل لنائبه على اليمن يأمره بأن يرسل رجلين يأتيانه بمحمد (، ووصل الرجلان لتنفيذ المهمة، وإذا بالنبي ( يخبر الرجلين أن الله مزق ملك كسرى كما مزق كتابه، وعاد الرجلان إلى اليمن فوجد أن كسرى قد قتله ابنه، فدخلا في الإسلام.                      ",
    "number-en": "Calling kings to Islam",
    "label-en": "The Messenger of God (began sending his letters to the kings and rulers of the world inviting them to Islam, so he sent (to the Negus, the king of Abyssinia, Amr ibn Umayyah Al-Damri). The Negus placed the letter on his eyes, and got down from his bed out of humility and respect for him and embraced Islam and said: If I were able to go to him, I would go to him.)\nHe sent to Al-Muqawqas, the governor of Egypt, Hatib bin Abi Balta’a. Al-Muqawqis received him well and gave him many gifts to the Prophet (two female slaves, a mule, and a doctor), but he did not convert to Islam for fear of his kingdom.\nHe sent Dihiyah bin Khalifa Al-Kalbi to Heraclius, King of the Romans, and Dihiyah handed him the letter of the Prophet (in which he says: “In the name of God, the Most Compassionate, the Most Merciful, from Muhammad, the servant of God and His Messenger to Heraclius, the Great of the Romans, peace be upon whoever follows the guidance. As for what follows, I invite you to preach Islam. Be safe, be safe, be safe. May God give you your reward twice. If you turn back, then you will bear the sin of the Aresians (the common people).) (Say, O People of the Book, come to a common word.) Between us and you is that we should not worship anyone but God and not associate anything with Him, and not take one another as lords other than God. But if they turn away, then say, “Bear witness that we are Muslims.” [Al-Imran: 64] [Al-Bukhari].\nSo Heraclius gathered his ministers and his entourage and said to them: O people of the Romans, do you have success and maturity, and that your kingship may be established so that you pledge allegiance to this Prophet (?) Then the entourage revolted, raised the cross and declared their disobedience. When Heraclius saw that, he despaired of their conversion to Islam, and feared for himself and his king, so he calmed them down, then said: I said what I said above to test your strength in your religion, as I saw. So they prostrated. And they were satisfied with him [Al-Bukhari].\nAs for Chosroes, the king of Persians, the Prophet sent him (with Abdullah bin Hudhafah, and he believed in God), and it said: “In the name of God, the Most Gracious, the Most Merciful. From Muhammad, the Messenger of God, to Chosroes, the Great of Persia, peace be upon him who follows guidance, believes in God and His Messenger, and bears witness that there is no god but God and that Muhammad is His servant and Messenger, and I call upon you with the supplication of God, and I am the Messenger of God to all people to warn whoever is alive, and the word is true against the unbelievers, so I submit. You are safe, and if you turn your back, then the sin of the Magians is on you.” [Ibn Ishaq].\nSo Khosrau tore up the letter, and sent to his deputy in Yemen ordering him to send two men to bring him Muhammad, and the two men arrived to carry out the mission, and behold, the Prophet told the two men that God had torn up Khosrau’s kingdom just as he had torn up his book. The two men returned to Yemen and found that Khosrau had been killed by his son, so they converted to Islam."
  },
  {
    "number": "مجئ الوفود الي الرسول",
    "text": "",
    "label": "في العام التاسع الهجري أقبلت وفود العرب من كل مكان إلى المدينة لتبايع رسول الله ( على دخول الإسلام، وعلى السمع والطاعة. وكان رسول الله ( يرسل مع كل وفد من يعلمهم أمور الدين، ويجمع منهم الزكاة ويوزعها على فقرائهم.\nوجاء وفد ثقيف الذين تركهم المسلمون في غزوة الطائف، ودعا رسول الله ( لهم بالهداية. جاءوا بأنفسهم من غير قتال إلى المدينة، بعد أن رأوا أنه لا طاقة لهم بحرب من حولهم من المسلمين فبايعوا كلهم وأسلموا، وأرسلوا وفدًا منهم يرأسهم كنانة بن عبد ياليل، فلما قربوا من المدينة قابلهم المغيرة بن شعبة، فاستقبلهم وعلمهم كيف يُحيُّون الرسول ( عند دخولهم عليه.\nوأنزل رسول الله ( وفد ثقيف في المسجد، وبنى لهم خيامًا لكي يسمعوا القرآن ويروا الناس إذا صلوا، ومكث الوفد أيامًا يذهبون إلى رسول الله (، ويذهب إليهم ليعلمهم مبادئ الإسلام، وكان يأتيهم كل ليلة بعد العشاء فيقف عليهم يحدثهم، وكان في هذا الوفد عثمان بن أبي العاص، وكان أصغرهم، فكانوا إذا ذهبوا إلى مجلس رسول الله ( تركوه على رحالهم.\nفكان عثمان كلما رجع الوفد وناموا وقت الظهيرة، ذهب إلى رسول الله ( فسأله عن الدين، واستقرأه القرآن، وذهب إليه عثمان على ذلك مرات كثيرة، وكان إذا وجد رسول الله ( نائمًا ذهب إلى أبي بكر، وكان يكتم ذلك عن أصحابه، فأعجب ذلك رسول الله ( وأحبه. وأخيرًا دخل الإسلام أفئدتهم، ولكن كنانة بن عبد ياليل قال لرسول الله (: أفرأيت الزنا فإنا قوم نغترب ولابد لنا منه؟. قال: \"هو عليكم حرام، فإن الله يقول: (ولا تقربوا الزنى إنه كان فاحشة وساء سبيلاً) [الإسراء: 32].\nقالوا: أفرأيت الربا فإنه أموالنا كلها؟ قال: \"لكم رءوس أموالكم، إن الله تعالى يقول: \" يا أيها الذين آمنوا اتقوا الله وذروا ما بقي من الربا إن كنتم مؤمنين) [البقرة:278].\nقالوا: أفرأيت الخمر، فإنه عصير أرضنا لابد لنا منها؟ قال (: \"إن الله حرمها، قال تعالى: (يا أيها الذين آمنوا إنما الخمر والميسر والأنصاب والأزلام رجس من عمل الشيطان فاجتنبوه لعلكم تفلحون) [المائدة: 90]. وسألوه أيضًا أن يضع عنهم الصلاة، فقال رسول الله ( لهم: \"لا خير في دين بلا صلاة\"\n[ابن إسحاق].\nوخلا بعضهم إلى بعض يتشاورون في الأمر ثم عادوا إلى رسول الله (، وقد خضعوا لذلك كله، ولكنهم سألوه أن يترك لهم وثنهم (اللات) الذي كانوا يعبدونه ثلاث سنين لا يهدمها، فأبى رسول الله ( ذلك، فما زالوا يسألونه سنة سنة، ويأبى عليهم، حتى سألوه شهرًا واحدًا بعد مقدمهم، فأبى عليهم أن يدعها إلى أي أجل، فقالوا للرسول: فتول أنت إذن هدمها، فأما نحن فإنا لا نهدمها أبدًا.\nفقال لهم:\"سأبعث لكم من يكفيكم ذلك\". ثم استأذنوا النبي (، فأذن لهم، وأكرمهم وحياهم، وأمر عليهم عثمان بن أبي العاص لما رأى من حرصه على الإسلام، وكان قد تعلم سورًا من القرآن قبل أن يخرج. [ابن إسحاق]\nوبعث رسول الله ( إليهم وفدًا على أثرهم، أمَّر عليهم خالد بن الوليد، وفيهم المغيرة بن شعبة وأبو سفيان بن حرب، فعمدوا إلى اللات فهدموها، وخرجت نساء ثقيف مكشوفات الرأس، يبكين عليها ويرثينها، وكلما ضربها المغيرة بفأسه كان أبو سفيان يسخر من الصنم ويصانع حزن تلك النسوة اللاتي يندبن ويبكين عليه واهًا لك أهًا لك. [ابن إسحاق]\nوقدمت وفود كثيرة المدينة، ودخلت في دين الله أفواجًا وجماعات، قال الله تعالى: (إذا جاء نصر الله والفتح. ورأيت الناس يدخلون في دين الله أفواجًا. فسبح بحمد ربك واستغفره إنه كان توابا) [النصر].\nإرسال الولاة والأمراء إلى قبائل العرب:\nأخذ النبي ( يرسل أمراءه وولاته إلى قبائل العرب يدعونهم، ويعلمونهم الإسلام، الذي انتشر في شبه الجزيرة العربية. وكان ممن أرسلهم معاذ بن جبل\n-رضي الله عنه-، وهو أعلم الناس بالحلال والحرام، بعثه إلى اليمن، وقال له:\n\"يا معاذ، لعلك لا تلقاني بعد عامي هذا\". [أحمد]، فبكى معاذ خشية فراق\nالنبي (.\nحج أبي بكر الصديق بالناس:\nجاء موسم الحج من العام التاسع الهجري، فأمر الرسول ( أبا بكر الصديق -رضي الله عنه- أن يحج بالناس، ونزلت الآيات الأولى من سورة التوبة، يعطي الله فيها للمشركين مهلة أربعة أشهر ليتوبوا ويؤمنوا بالله، وإلا قتلوا؛ لتتخلص مكة وما حولها من الشرك البغيض.\nوأما من كان له عهد أطول من هذه المدة، وكان حافظًا لعهده مع المسلمين، يوفَّى له بمدة العهد، وهكذا وضع الإسلام حدًّا للوثنية في هذه الأرض الطاهرة، قال تعالى: (براءة من الله ورسوله إلى الذين عاهدتم من المشركين. فسيحوا في الأرض أربعة أشهر واعلموا أنكم غير معجزي الله وأن الله مخزي الكافرين) [التوبة: 1-2]. ونهى العرب عن الطواف بالبيت الحرام وهم عراة، فقد كان بعضهم يفعل ذلك، ولكن الرسول ( أمر أن يكون هذا العام آخر عام يحج فيه المشركون مع المسلمين، فقال: \"ألا لا يحج بعد العام مشرك، ولا يطوف بالبيت عريان\". [البخاري].                      ",
    "number-en": "Delegations coming to the Messenger",
    "label-en": "In the ninth year of the AH, Arab delegations from everywhere came to Medina to pledge allegiance to the Messenger of God (to enter Islam, and to hear and obey. The Messenger of God (sent with each delegation someone to teach them matters of religion, collect zakat from them and distribute it to their poor.\nThe Thaqif delegation, whom the Muslims had left behind in the Battle of Taif, came, and the Messenger of God (may God bless him and grant him peace) called for guidance for them. They came on their own without fighting to Medina, after they saw that they had no strength to fight the Muslims around them, so they all pledged allegiance and converted to Islam, and they sent a delegation from them headed by Kinana bin Abd Yalil. When they approached Medina, Al-Mughirah bin Shu’bah met them, and he received them and taught them how to greet the Messenger (when they entered upon him). The Messenger of God (the Thaqif delegation) camped in the mosque, and built tents for them so that they could hear the Qur’an and see the people when they prayed. The delegation stayed for days, going to the Messenger of God (and he would go to them to teach them the principles of Islam. He would come to them every night after dinner and stand over them and talk to them. In this delegation was Othman bin Abi Al-Aas, and he was the youngest of them, so when they went to the meeting of the Messenger of God, they would leave him on their journeys. Whenever the delegation returned and they slept at noon, Othman would go to the Messenger of God (and ask him about the religion, and recite the Qur’an to him, and Othman would go to him for that many times. And if he found the Messenger of God (sleeping), he would go to Abu Bakr, and he would hide it from his companions. The Messenger of God liked that, and he loved it. Finally, Islam entered their hearts, but Kinanah ibn Abd Yalil said to the Messenger of God, “Have you seen adultery? We are a people who are expatriates and we must have them.” From him? He said: “It is forbidden to you, for God says: (And do not approach adultery; it is an indecency and an evil way)” [Al-Isra: 32].\nThey said: Have you seen usury, for it is all our money? He said: “Your capital is yours. God Almighty says: “O you who have believed, fear God and give up what remains of usury if you are believers” [Al-Baqarah: 278].\nThey said: Have you seen the wine? It is the juice of our land and we must have it? He said: “Indeed, God has forbidden it. The Almighty said: (O you who have believed, indeed wine, gambling, stones, and stones are an abomination from the work of Satan, so avoid them that you may succeed)” [Al-Maeda: 90]. They also asked him to remove prayer for them, and the Messenger of God said to them: “There is no good in religion without prayer.”\n[Ibn Ishaq].\nThey went away to each other to consult about the matter, then they returned to the Messenger of God (and they submitted to all of that, but they asked him to leave for them their idol (Al-Lat) which they used to worship for three years without demolishing it, but the Messenger of God refused) that, and they continued to ask him year after year, and he refused to them, until they asked him one month after their arrival, but he refused to leave it for any period of time, so they said to the Messenger: Then you will demolish it, but as for us, we will not demolish it. Never.\nHe said to them: “I will send you someone who is sufficient for you.” Then they asked the Prophet for permission, so he granted them permission, honored them and greeted them, and appointed Othman bin Abi Al-Aas as commander over them when he saw his eagerness for Islam, and he had learned some surahs from the Qur’an before he left. [Ibn Ishaq]\nThe Messenger of God (may God bless him and grant him peace) sent a delegation to them, following them. Khalid bin Al-Walid commanded over them, and among them were Al-Mughira bin Shu’bah and Abu Sufyan bin Harb. They went to Al-Lat and demolished it, and the women of Thaqif came out with their heads uncovered, crying over it and lamenting it. Whenever Al-Mughira hit her with his axe, Abu Sufyan would mock the idol and simulate the grief of those women who lamented and cried over it. Woe to you, oh to you. [Ibn Ishaq]\nMany delegations came to the city, and entered into the religion of God in groups and groups. God Almighty said: (When God’s victory and conquest come. And you see people entering into the religion of God in crowds. So glorify the praise of your Lord and ask His forgiveness. Indeed, He is Forgiving.) [Victory].\nSending governors and princes to the Arab tribes:\nThe Prophet began sending his princes and governors to the Arab tribes to invite them and teach them Islam, which spread in the Arabian Peninsula. Among those he sent was Muadh bin Jabal.\nMay God be pleased with him, and he is the most knowledgeable of people about what is permissible and what is forbidden. He sent him to Yemen and said to him:\n“O Muadh, perhaps you will not meet me after this year.” [Ahmed], then Moaz cried for fear of separation\nThe Prophet (.\nAbu Bakr Al-Siddiq’s Hajj with the people:\nThe Hajj season came in the ninth year of the Hijri year, so the Messenger (Abu Bakr Al-Siddiq - may God be pleased with him) ordered the people to perform Hajj, and the first verses of Surat Al-Tawbah were revealed, in which God gives the polytheists a period of four months to repent and believe in God, otherwise they will be killed, so that Mecca and its surroundings will be rid of hateful polytheism. As for whoever had a covenant longer than this period, and he kept his covenant with the Muslims, the period of the covenant will be fulfilled for him, and thus Islam put an end to paganism in this pure land. God Almighty said: (A disavowal from God and His Messenger to those with whom you made a covenant of the polytheists. So travel in the land for four months and know that you will not be able to defeat God and that God will disgrace the unbelievers) [At-Tawbah: 1-2]. The Arabs forbade circumambulating the Sacred House while naked, as some of them used to do that, but the Messenger (ordered that this year be the last year in which the polytheists would perform Hajj with the Muslims, so he said: “No polytheist will perform Hajj after this year, and no polytheist will circumambulate the House naked.”) [Al-Bukhari]."
  },
  {
    "number": "حجة الوداع",
    "text": "",
    "label": "في العام العاشر الهجري حج الرسول ( مع أمته حجة الوداع؛ ليعلم الناس مناسك الحج في الإسلام.\nووقف رسول الله ( بين جموع المسلمين وهم حوالي مائة ألف مسلم يعظهم ويرشدهم. وهذا ربيعة بن أمية بن خلف ذو الصوت القوي العالي يبلِّغ عن رسول الله ( حتى يسمع الجميع، وكان مما قاله رسول الله (: \"أيها الناس، اسمعوا قولي، فإني لا أدري لعلي لا ألقاكم بعد عامي هذا بهذا الموقف أبدًا، أيها الناس، إن دماءكم وأموالكم حرام عليكم كحرمة يومكم هذا، في شهركم هذا، في بلدكم هذا\" [مسلم].\nونهاهم عن الربا، وأكل أموال الناس بالباطل، وأوصى الرجال بالنساء، يكرمونهن ويحسنون إليهن. ثم قال: \"وأنتم تُسْأَلُون عني، فما أنتم قائلون؟\" قالوا: إنك قد بلغت وأديت ونصحت. فقال ثلاث مرات: \"اللهمَّ فاشهد\" [مسلم].\nوبينما رسول الله ( يتحدث إلى الناس، كان هناك رجل يبكي بكاء شديدًا، إنه أبو بكر الصديق حبيب رسول الله (، وأحب صحابته إلى قلبه، فقد أحس بقرب أجل رسول الله (، فقال: فداك أبي وأمي يا رسول الله.\nجيش أسامة:\nوفي شهر صفر من العام الحادي عشر جهز الرسول ( جيشًا كبيرً لتأديب الروم، وأراد رسول الله ( أن يُعلِّم المسلمين درسًا عظيمًا في القيادة، فولَّى على الجيش أسامة بن زيد بن حارثة -رضي الله عنه-، وهو لم يبلغ العشرين من عمره؛ ليعطي الفرصة للشباب في تولي المهام الصعبة، وتدريبهم على تحمل المسئولية، برغم أن جيش المسلمين كان به كبار الصحابة مثل: أبي بكر، وعمر، وأبي عبيدة بن الجراح، وغيرهم الكثير -رضي الله عنهم أجمعين-.\nوضرب الجيش معسكره خارج المدينة، ولكنه عاد بعد أن علم بمرض رسول الله (، ثم بوفاته، ثم سرعان ما خرج الجيش في عهد أبي بكر الصديق\n-رضي الله عنه- وهزم الروم.",
    "number-en": "Farewell argument",
    "label-en": "In the tenth year of the Hijri year, the Messenger performed the Farewell Hajj with his nation, so that people would know the rituals of Hajj in Islam.\nThe Messenger of God stood among the crowds of Muslims, about one hundred thousand Muslims, admonishing and guiding them. This is Rabi’ah ibn Umayyah ibn Khalaf, who had a strong, loud voice, reporting on behalf of the Messenger of God, so that everyone could hear. One of the things the Messenger of God said was: “O people, listen to my words, for I do not know whether after this year I will never meet you in this situation again. O people, your blood and your wealth are as sacred to you as this day of yours, in this month of yours, in your country.” This” [Muslim].\nHe forbade them from usury and consuming people’s money unjustly, and he commanded men to treat women, honor them and be kind to them. Then he said: “And you are being asked about me, so what are you saying?” They said: You have conveyed, fulfilled, and advised. He said three times: “O God, bear witness” [Muslim].\nWhile the Messenger of God was speaking to the people, there was a man crying profusely. He was Abu Bakr al-Siddiq, beloved of the Messenger of God, and he loved his companions to his heart. He sensed the approaching death of the Messenger of God, so he said: May my father and mother be sacrificed for you, O Messenger of God.\nOsama's army:\nIn the month of Safar of the eleventh year, the Messenger prepared a large army to discipline the Romans, and the Messenger of God wanted to teach the Muslims a great lesson in leadership, so he put Osama bin Zaid bin Haritha - may God be pleased with him - in charge of the army, and he was not yet twenty years old, to give the opportunity to young people to take on difficult tasks and train them to bear responsibility, despite the fact that the Muslim army had great companions such as: Abu Bakr, Omar, Abu Ubaidah bin Al-Jarrah, and many others - may God be pleased with them. All of you-.\nThe army struck its camp outside the city, but it returned after learning of the illness of the Messenger of God (and then his death), and then the army quickly left during the reign of Abu Bakr Al-Siddiq.\n-May God be pleased with him- and the Romans were defeated."
  },
  {
    "number": "مرض الرسول ووفاته",
    "text": "",
    "label": "أصابت الحمى الرسول صلى الله عليه وسلم ، وظل يعاني منها أيامًا، فأمر أبا بكر الصديق أن يصلي بالناس، وكان إذا خرج إلى المسجد استند إلى الفضل بن العباس، وعلي بن أبي طالب.\nوفي بيت عائشة -رضي الله عنها- اشتد به الوجع، وكان قد شعر بقلق أصحابه وحزنهم عليه، فأمرهم أن يصبوا عليه من سبع قرب مليئة بالماء لم يكشف غطاؤها، لعله يستطيع الخروج إلى الناس فقال: \"أهريقوا عليَّ من سبع قرب لم تحلل أوكيتُهُنَ لعلي أعهد إلى الناس\" [متفق عليه].\nقالت عائشة -رضي الله عنها-: فأجلسناه في مخضب (الشيء الذي يغسل فيه الثياب)، ثم طفقنا نصب عليه من تلك القرب حتى طفق يشير إلينا بيده أن قد فعلتن.\nثم خرج إلى الناس فصلى بهم وخطبه، وكان عاصبًا رأسه، فجلس على المنبر، ثم كان أول ما تكلم به أن صلى على أصحاب أحد، واستغفر لهم. ثم قال: \"عبد خَيَّرَهُ بين أن يؤتيه زهرة الدنيا، وبين ما عنده، فاختار ما عنده\".\nفبكى أبو بكر -رضي الله عنه- إذ علم ما يقصده النبي صلى الله عليه وسلم ، وناداه قائلاً: فديناك بآبائنا وأمهاتنا، فقال: \"على رسلك يا أبا بكر. أيها الناس، إن أمن الناس عليَّ في ماله وصحبته أبو بكر، ولو كنت متخذًا خليلا؛ لاتخذتُ أبا بكر خليلاً، ولكن أخوة الإسلام، وإن فرط لكم، وأنا شهيد عليكم. وإني والله ما أخاف أن تشركوا من بعدي، ولكن أخشى عليكم الدنيا أن تنافسوا فيها\"\n[متفق عليه].\nوعاد رسول الله صلى الله عليه وسلم إلى بيته، واشتد به وجعه، وثقل عليه مرضه، وكان إلى جواره قدح به ماء، يغمس فيه يده، ثم يمسح وجهه بالماء ويقول: \"اللهمَّ أعني على سكرات الموت\" [الترمذي والنسائي].\nوكانت وصية رسول الله صلى الله عليه وسلم حين حضره الموت: \"الصلاة وما ملكت أيمانكم\". حتى كان رسول الله صلى الله عليه وسلم يغرغر بها صدره، وما يكاد يفيض بها لسانه. [ابن ماجة وأحمد]\nودعا رسول الله فاطمة ابنته فحدثها سرًّا فبكت، ثم حدثها فضحكت، فقالت عائشة لها: ما هذا الذي سارَّك به رسول الله صلى الله عليه وسلم فبكيت، ثم سارَّك فضحكت؟ قالت: سارني فأخبرني بموته فبكيت، ثم سارني فأخبرني أني أول من يتبعه من أهله، فضحكت. [متفق عليه].\nوفي صلاة صبح يوم الاثنين الثاني عشر من شهر ربيع الأول في العام الحادي عشر للهجرة، رفع الحبيب محمد صلى الله عليه وسلم الستر المضروب على منزل عائشة، فنظر إلى أصحابه وهم يصلون، فسره اجتماعهم ووحدة كلمتهم، ونظر إليه الناس، فاطمأنوا عليه، وظنوا أن صحته قد عادت إليه، ولكنها كانت نظرة الوداع، فما إن حل الضحى حتى خرجت روحه الطاهرة إلى خالقها سبحانه وتعالى.\nفقالت فاطمة -رضي الله عنها-: يا أبتاه! أجاب ربًّا دعاه. يا أبتاه! جنة الفردوس مأواه. يا أبتاه! إلى جبريل ننعاه. [البخاري]\nوتسرب النبأ الأليم في المدينة، فأظلمت جنباتها بعد أن أشرقت، وسعدت بحياة رسول الله صلى الله عليه وسلم على أرضها.\nلقد كان حادثًا مؤلمًا مفجعًا، فها هو ذا عمر بن الخطاب -رضي الله عنه- لم يصدق الخبر عندما سمعه، فقال: إن رجالاً من المنافقين يزعمون أن رسول الله توفي، وإن رسول الله ما مات، ولكن ذهب إلى ربه كما ذهب موسى بن عمران، فغاب عن قومه أربعين ليلة. ثم رجع بعد أن قيل قد مات. والله ليرجعن رسول الله صلى الله عليه وسلم ، فليقطعن أيدي رجال وأرجلهن يزعمون أنه مات!.\nوأقبل أبو بكر حتى نزل على باب المسجد حين بلغه الخبر، وعمر يكلم الناس، فلم يلتفت إلى شيء دخل على الرسول صلى الله عليه وسلم في بيت عائشة وهو مغطي في ناحية البيت، فكشف وجهه فقبله، ثم قال: بأبي أنت وأمي.. أما الموتة التي كتب الله عليك فقد ذقتها، ثم لن يصيبك بعدها موت أبدًا. ورد الثوب على وجهه، ثم خرج وعمر يكلم الناس، فقال: على رسلك يا عمر.. فأنصت. لكن عمر ما زال ثائرًا، فلما رآه أبو بكر كذلك، أقبل على الناس، وشرع يتكلم، فلما سمعه الناس انصرفوا عن عمر وأقبلوا عليه.\nوحمد أبو بكر الله وأثنى عليه ثم قال: أيها الناس.. من كان يعبد محمدًا، فإن محمدًا قد مات، ومن كان يعبد الله فإن الله حي لا يموت، ثم تلا هذه الآية: (وما محمد إلا رسول قد خلت من قبله الرسل أفإن مات أو قتل انقلبتم على أعقابكم ومن ينقلب على عقبيه فلن يضر الله شيئا وسيجزي الله الشاكرين)\n[آل عمران: 144].\nلقد مات الرسول صلى الله عليه وسلم ، ولكن بقيت شريعة الله، وسنة رسوله بين المسلمين، ما بقيت السماوات والأرض ضياءً وهدى لكل من استضاء واهتدى.\nولكن ماذا بعد موت رسول الله صلى الله عليه وسلم؟ هل يتفرق المسلمون؟ ويعود العرب إلى كفرهم وأوثانهم؟ لا.. لقد تسلم راية الإسلام رجال الإسلام الذين تخرجوا في مدرسة الرسول ، وفي مسجده. وكان أول خليفة للمسلمين أبو بكر الصديق -رضي الله عنه- الذي تسلم الراية وبدأ مرحلة جديدة في تاريخ الإسلام.                      ",
    "number-en": "The Prophet's illness and death",
    "label-en": "The Messenger, may God bless him and grant him peace, was afflicted with a fever, and he continued to suffer from it for days. He ordered Abu Bakr Al-Siddiq to lead the people in prayer, and when he went out to the mosque, he would lean on Al-Fadl ibn Al-Abbas and Ali ibn Abi Talib.\nIn the house of Aisha - may God be pleased with her - his pain became severe, and he sensed the anxiety and sadness of his companions over him, so he ordered them to pour water on him from seven waterskins filled with water whose lids were not uncovered, so that he might be able to go out to the people, so he said: “Spill on me seven waterskins whose mouths have not been untied, so that I may be entrusted to the people” [Agreed upon]. Aisha - may God be pleased with her - said: We made him sit in the washing machine (the thing in which one washes clothes), and then we started pouring water on him from that waterskin until he started pointing to us with his hand that we had done so.\nThen he went out to the people and led them in prayer and delivered a sermon. He had his head tied, so he sat on the pulpit. Then the first thing he said was to pray for the companions of Uhud and ask forgiveness for them. Then he said: “A servant was given the choice between giving him the flower of this world and what he had, so he chose what he had.”\nAbu Bakr - may God be pleased with him - cried when he knew what the Prophet, may God bless him and grant him peace, meant, and called him, saying: We pay our respects to you with our fathers and mothers. He said: “On your messengers, O Abu Bakr. O people, if the people trusted me with his money and his companionship, Abu Bakr, even if I had taken a friend; I would have taken Abu Bakr as a friend, but the brotherhood of Islam, even if he neglects it, is yours, and I am your witness. By God, I do not fear that you will associate others with others after me, but I fear that you will compete with this world for you in it.”\n[Agreed upon].\nThe Messenger of God, may God’s prayers and peace be upon him, returned to his home, and his pain became severe and his illness became heavy on him. Next to him was a cup of water, in which he dipped his hand, then wiped his face with water and said: “O God, help me in the throes of death” [Al-Tirmidhi and Al-Nasa’i]. The will of the Messenger of God, may God bless him and grant him peace, when death approached him was: “Prayer and what your right hands possess.” Until the Messenger of God, may God bless him and grant him peace, used to gargle his chest with it, and his tongue would hardly fill it with it. [Ibn Majah and Ahmad]\nThe Messenger of God called his daughter Fatima and spoke to her secretly, so she cried. Then he spoke to her, and she laughed. Aisha said to her: What is this that the Messenger of God, may God bless him and grant him peace, told you about and you cried, then he told you about it and you laughed? She said: He walked with me and told me of his death, and I cried. Then he walked with me and told me that I would be the first of his family to follow him, and I laughed. [agreed].\nIn the morning prayer on Monday, the twelfth of the month of Rabi’ al-Awwal in the eleventh year of the Hijra, the beloved Muhammad, may God’s prayers and peace be upon him, lifted the curtain over Aisha’s house and looked at his companions as they were praying. Their meeting and the unity of their words pleased him. The people looked at him and reassured him, and they thought that his health had returned to him, but it was a farewell look. As soon as noon came, his pure soul went out to its Creator, Glory be to Him, the Most High.\nFatima - may God be pleased with her - said: O Father! He answered the Lord who called him. Father! Paradise is his abode. Father! To Gabriel, we mourn him. [Bukhari]\nThe painful news leaked into the city, and its sides became dark after it had brightened, and it was happy with the life of the Messenger of God, may God bless him and grant him peace, on its land.\nIt was a painful and heartbreaking event. Here, Omar bin Al-Khattab - may God be pleased with him - did not believe the news when he heard it, so he said: Some hypocritical men claim that the Messenger of God died, and the Messenger of God did not die, but rather went to his Lord as Moses bin Imran went, so he was absent from his people for forty nights. Then he returned after it was said that he had died. By God, they will return the Messenger of God, may God bless him and grant him peace, and cut off the hands and feet of men claiming that he died!\nAbu Bakr approached until he came down to the door of the mosque when the news reached him, and Omar was speaking to the people, but he did not pay attention to anything. He entered the Messenger, may God bless him and grant him peace, in Aisha’s house while he was covered in one side of the house. He uncovered his face and kissed him, then said: May my father and mother be sacrificed for you... As for the death that God has decreed upon you, you have tasted it, and after that death will never befall you. He put the garment back on his face, then he went out and Omar was speaking to the people. He said: On your messengers, O Omar.. so listen. But Omar was still rebellious, and when Abu Bakr saw him like that, he approached the people and began speaking. When the people heard him, they turned away from Omar and turned to him.\nAbu Bakr praised God and praised him, then said: O people... whoever worships Muhammad, then Muhammad is dead, and whoever worships God, then God is alive and does not die. Then he recited this verse: (Muhammad is but a messenger. Messengers have passed away before him. If he dies or is killed, you will turn back on your heels, and whoever turns back on his heels will not harm God in the least, and God will reward those who are thankful.)\n[Al Imran: 144]. The Messenger, may God bless him and grant him peace, died, but the law of God and the Sunnah of His Messenger remained among the Muslims, as long as the heavens and the earth remained a light and a guidance for all who seek illumination and are guided.\nBut what after the death of the Messenger of God, may God bless him and grant him peace? Will Muslims disperse? And the Arabs return to their disbelief and idols? No.. The banner of Islam was handed over to the men of Islam who graduated from the Prophet’s school and his mosque. The first caliph of the Muslims was Abu Bakr Al-Siddiq - may God be pleased with him - who assumed the banner and began a new phase in the history of Islam."
  },
  {
    "number": "هديه وخصائصه وشمائله",
    "text": "",
    "label": "كان للنبي زوجات، اختارهن الله -سبحانه- ليكن أمهات المؤمنين، وليحملن عبء الدعوة مع الرسول ( وهن: خديجة بنت خويلد -رضي الله عنها-، وكانت أول زوجة للنبي (، ولم يتزوج غيرها، حتى توفيت.\nوسودة بنت زمعة -رضي الله عنها-، وقد تزوجها الرسول ( بعد خديجة. ثم تزوج عائشة بنت أبي بكر -رضي الله عنها-. ثم تزوج زينب بنت خزيمة -رضي الله عنها-، وتوفيت عنده (. ثم تزوج أم سلمة هند بنت أبي أمية، وهي آخر نسائه موتًا.\nثم تزوج زينب بنت جحش ابنة عمته، التي كانت زوجة لزيد بن حارثة مولى رسول الله (، وكان الله -سبحانه- هو وليها الذي زوجها لرسول الله، وتوفيت في أول خلافة عمر. وتزوج ( جويرية بنت الحارث، ثم تزوج أم حبيبة رملة بنت أبي سفيان، وقد تزوجها الرسول ( وهي ببلاد الحبشة، وقد دفع النجاشي صداقها، وقدره أربعمائة دينار، وماتت في أيام أخيها معاوية.\nوتزوج صفية بنت حيي بن أخطب سيد بني النضير، ثم تزوج ميمونة بنت الحارث الهلالية، وهي آخر من تزوج بها.\nسراريه:\nوكان من سراريه ( مارية القبطية، وريحانة، وجارية وهبتها له زينب بنت جحش، وجارية أخرى أصابها في بعض السبي.\nأولاده :\nوكان له ( من الأولاد القاسم، وزينب، وعبد الله، وإبراهيم، ورقية، وأم كلثوم، وفاطمة، وكل أولاده من خديجة -رضي الله عنها- إلا إبراهيم، فإنه كان من مارية القبطية.\nصفة النبي:\nكان رسول الله ( فخمًا مفخمًا، يتلألأ وجهه تلألؤ القمر ليلة البدر، ليس بالطويل ولا بالقصير، عظيم الهامة، شعره رجل بين الجعودة والسبوطة، فيه تكسير قليل، وافر يجاوز شحمه أذنيه. واسع الجبين، له نور يعلوه، كثيف اللحية، شديد سواد العين، سهل الخدين، ورقيق الأسنان، بين أسنانه فتحات، عريض الصدر، بعيد ما بين المنكبين، ضخم رؤوس العظام، أشعر الذراعين والمنكبين وأعالي الصدر، رحب الراحة، أملس القدمين ليس فيهما تكسر ولا شقاق، سريع المشية إذا مشى كأنما ينحط من منحدر، وإذا التفت التفت كله.\nمنطقه :\nكان ( دائم الفكر، ليست له راحة، لا يتكلم في غير حاجة، طويل السكوت، يتكلم بجوامع الكلم، يعظم النعمة وإن كانت صغيرة، لا يذم منها شيئًا ولا يمدحه، لا يغضب لنفسه، ولا ينتصر لها، إذا أشار أشار بكفه كلها، وإذا تعجب قلبها، معظم ضحكه أن يبتسم.\nدخوله :\nكان ( إذا دخل منزله قسم دخوله ثلاثة أجزاء، جزءًا لله، وجزءًا لأهله، وجزءًا لنفسه،ثم جزء جزءه بينه وبين الناس، فرد ذلك على العامة والخاصة، لا يدخل عنهم شيئًا.\nمجلسه:\nكان ( لا يجلس ولا يقوم إلا ذاكرًا لله تعالى، يجلس حيث انتهى به المجلس، يعطي كل جلساته نصيبًا، لا يرى في مجلسه أكرم منه، لا ينصرف من كان معه، من سأله حاجة لا يردَّه إلا بها، فإن لم يجد فبكلمة طيبة، كل الناس عنده في مجلسه سواء، فمجلسه مجلس حلم وحياء وصبر وأمانة، لا ترفع فيه الأصوات، ولا تذكر فيه العيوب، وكان في مجلسه دائم البشر، سهل الخلق، لين الجانب ليس بفظ ولا غليظ، ولا سخاب، ولا فحاش ولا عياب، ولا كثير المزاح، يتغافل عما لا يشتهي.\nوكان ( في مجلسه يترك الناس من ثلاث: أن لا يذم أحدًا ولا يعيره، ولا يطلب عورته، ولا يتكلم إلا فيما يرجو ثوابه، يضحك إذا ضحك الحاضرون ويتعجب مما يتعجبون، ويصبر على الغريب على قسوته في كلامه ومسألته، ولا يقطع على أحد حديثه.\nسكوته:\nكان سكوته ( على أربع: الحلم، والحذر، والتقدير، والتفكير، فأما تقديره ففي تسويته النظر والاستماع بين الناس، وأما تفكره ففيما يبقى ويفنى، وجُمع له ( الحلم والصبر، فكان لا يغضبه شيء إلا إذا انتهكت محارم الله.\nطعامه:\nكان ( لا يرد من الطعام ما وجد، ولا يتكلف في طلب ما فقد، فما قرب إليه أكله، وإن عافته نفسه لا يعيبه وتركه، فكان ( يأكل ما تيسر، فإن لم يجد ما يأكله صبر، فكان يضع من الجوع على بطنه الحجر، ويمر الهلال بعد الهلال ولا يوقد في بيته نار، كانت الأرض سفرته، يضع عليها طعامه، وكان يأكل بثلاث أصابع وهو أشرف ما يكون في الأكل، فإن المتكبر يأكل بأصبع واحدة، والجشع يأكل بخمس.\nوكان ( لا يأكل متكئًا، وكان يسمي الله تعالى أول الطعام، وبحمده آخره فيقول: \"الحمد لله حمدًا طيباً مباركًا فيه غير مكفى ولا دموع ولا مستغنى عنه ربنا\" [البخاري].\nشربه :\nكان ( يسمّي الله قبل الشرب، ويحمده بعده، وكان أكثر شربه قاعدًا، بل نهى عن الشرب قائمًا، وشرب مرة قائمًا، ليبين أنه يجوز لك إذا كان لحاجة أو عذر، وكان إذا شرب ناول من على يمينه، حتى لو كان من على يساره أكبر منه، لأنه ( يحب التيامن في كل شيء.\nنومه :\nكان ( ينام على الفراش تارة، وعلى الحصير تارة، وعلى الأرض تارة، وعلى السرير تارة، فعن عباد بن تميم عن عمه قال: رأيت رسول الله ( مستلقيًا في المسجد واضعًا إحدى رجليه على الأخرى\" [متفق عليه]، وكان فراشه مصنوعًا من جلد قد حشي ليفًا، وكان إذا أراد النوم جمع كفيه ثم ينفث فيهما، ثم يقرأ فيهما (قل هو الله أحد) و (قل أعوذ برب الفلق) و (قل أعوذ برب الناس) ثم يمسح بهما ما استطاع من جسده، يبدأ بهما على رأسه، ووجهه، وباقي جسده، يفعل ذلك ثلاث مرات.[أبو داود والترمذي].\nوكان ينام على جنبه الأيمن، ويضع يده اليمنى تحت خده، ثم يقول: \"اللهمَّ قني عذابك يوم تبعث عبادك\" [أبو داود والترمذي]، وكان يقول إذا أوى إلى فراشه: \"الحمد لله الذي أطعمنا وسقانا وكفانا وآوانا، فكم ممن لا كافي له ولا مؤوي\" [مسلم والترمذي].\nوكان ينام أول الليل، ويقوم آخره، وربما سهر أول الليل في مصالح المسلمين، وكانت عينه تنام، ولا ينام قلبه، وكان إذا نام لم يوقظوه حتى يكون هو الذي يستيقظ، وكان إذا نام بالليل، اضطجع على جنبه الأيمن، وإذا نام قبيل الصبح نصب ذراعه، ووضع رأسه على كفه.[الترمذي].\nركوبه:\nكان ( يركب الخيل والإبل والبغال والحمير، وكان يركب وحده، وربما أردف غيره خلفه على البعير، وكان أكثر ما يركب الخيل والإبل، ولم يكن عنده إلا بغلة واحدة، أهديت له.\nبيعه وشراؤه :\nكان ( يبيع ويشتري، وكان شراؤه أكثر من بيعه وخاصة بعد النبوة، ولا يحفظ له بعد الهجرة بيع إلا نادرًا.\nوآجر رسول الله ( واستأجر، وكان استئجاره أكثر من إيجاره، وإنما يحفظ عنه أنه أجر نفسه قبل النبوة في رعاية الغنم، وأجر نفسه من خديجة في سفره بمال إلى الشام.\nوشارك ( غيره في التجارة، واستدان برهن وبغير رهن، واستعار من غيره أشياء، واشترى حالاً ومؤجلاً.\nمعاملته:\nكان ( أحسن الناس معاملة للناس، فكان إذا تسلف شيئا قضى خيرًا منه، فقد جاءه رجل يتقاضاه بعيراً، فقال رسول الله (: \"أعطوه\". فقالوا: لا نجد إلا سنًّا أفضل من سنِّه، فقال الرجل: أوفيتني أوفاك الله، فقال رسول الله (: \"أعطوه، فإن من خيار الناس أحسنهم قضاء\" [متفق عليه]، وكان إذا قضى ما استلفه دعا لمن سلفه، فقال:\"بارك الله لك في أهلك ومالك، إنما جزاء السلف الحمد والأداء\" [أحمد والنسائي وابن ماجة].\nوكان سمحًا لمن تقاضاه، فقد جاءه رجل يتقاضاه، وأغلظ له القول، فهمَّ عمر بن الخطاب أن يضربه، فقال رسول الله (: \"مه يا عمر كنت أحوج إلى أن تأمرني بالوفاء، وكان أحوج إلى أن تأمره بالصبر\" [الحاكم].\nأمور فطرته :\nكان ( يعجبه التيامن في كل شيء في ترجله وطهوره وأخذه وعطائه، وكان يجعل اليمين لطعامه وشرابه وطهوره، ويساره لخلائه، وغير ذلك من إزالة الأذى.\nالحلق: وكان يحب أن يحلق الرأس كله، أو يترك كله، وكان يكره أن يحلق بعضه، ويترك بعضه.\nالسواك: وكان يحب السواك، وكان يستاك مفطرًا وصائمًا، وكان يستعمل السواك في أحيان كثيرة، فكان يستاك عند النوم، وعند الوضوء، وعند الصلاة، وعند دخول المنزل، وكان يستاك بعود الأراك.\nالطيب: وكان ( يحب الطيب ويكثر منه، وكان ( لا يردُّ الطيب، فقد ورد عنه قوله (: \"من عرض عليه طيب فلا يرده\" [مسلم].\nوكان ( يكتحل، وكان ( يختضب، وقد سئل جابر بن سمرة -رضي الله عنه- أكان في رأس النبي ( شيب؟ قال: لم يكن في رأسه شيب إلا شعرات في مفرق رأسه إذا ادهن واراهُنَّ الدهن، وكان يسرح شعره ويزينه أحيانًا، وتزينه وتسرحه عائشة -رضي الله عنها- أحيانًا أخرى.\nقص الشارب: كان رسول الله ( يقص شاربه، فعن زيد بن أرقم قال: قال رسول الله (: \"من لم يأخذ من شاربه، فليس منَّا\" [النسائي والترمذي].\nوقد جعل الرسول ( وقتًا لا يترك بعده قص الشارب، فعن أنس قال: وقت لنا النبي ( في قص الشارب وتقليم الأظفار، ألا نترك أكثر من أربعين يومًا وليلة\". [مسلم والترمذي والنسائي]\nضحكه وبكاؤه (:\nكان ضحك النبي ( تبسمًا لا قهقهة، وكان يضحك مما يضحك منه الناس، ويضحك مما يتعجب من مثله، ويستغرب وقوعه، أو يكون شيئًا نادرًا الوقوع.\nوأما بكاؤه فكان حاله كحال الضحك، لا يرفع فيه صوتًا، ولكن كانت عيناه تدمع، ويسمع لصدره أزيز، وكان بكاؤه تارة رحمة للميت، وتارة خوفًا من الله، وتارة خوفًا وشفقة على أمته، وكان يبكي عند سماع القرآن، وبكى عند وفاة ابنه إبراهيم، فلما سئل عن ذلك، قال (: \"تدمع العين، ويحزن القلب، ولا نقول إلا ما يرضي ربنا، وإنا بك يا إبراهيم لمحزونون\" [متفق عليه].\nخطبته:\nخطب الرسول ( على الأرض، وعلى المنبر، وعلى البعير، وعلى الناقة، وكان له جذع نخلة يخطب عليه حتى صنع له منبر، وكان إذا خطب احمرت عيناه، وعلا صوته، كأنه منذر جيش.\nوكان إذا صعد المنبر أقبل على الناس بوجهه وقال: \"السلام عليكم\" وكان يختم خطبته بالاستغفار، وكثيرًا ما كان يخطب بالقرآن، فعن أم هشام بنت حارثة، قالت:\" ما أخذت (ق والقرآن المجيد) إلا عن لسان رسول الله ( يقرؤها كل يوم جمعة على المنبر إذا خطب الناس\" [مسلم والنسائي وأبو داود].\nوكان ( يراعي حالة المخاطبين ومصلحتهم، وكان يفتتح خطبته بالحمد والثناء، ويتشهد فيها بالشهادة، ويذكر فيها نفسه باسمه \"محمد\" (، وكان إذا قام يخطب أخذ عصا، فتوكأ عليها وهو على المنبر وكان منبره ثلاث درجات فإذا استوى عليه، واستقبل الناس، أذن المؤذن ولم يقل شيئًا قبله ولا بعده، ولا يتكلم أحد أثناء خطبته.\nوكان إذا عرض له في خطبته شيء عارض، اشتغل به، ثم رجع إلى خطبته، فقد كان يخطب ذات مرة الناس، فجاء الحسن والحسين يعثران في قميصين أحمرين. فقطع كلامه، فنزل، فحملهما، ثم عاد إلى منبره.\nوكان خطبته قد تطول أو تقصر بحسب حاجة الناس، ومراعاة أحوالهم، وكانت خطبته العارضة أطول من خطبته الراتبة.\nلبسه:\nلم يتقيد الرسول ( بلبس نوع معين من الثياب، فقد كان يلبس ما تيسر له من اللباس، سواء أكان من الصوف أو القطن أو الكتان، وقد لبس الرسول ( البرود اليمانية، والبرد الأخضر، ولبس الجبة، والقباء، والقميص، والسراويل، والرداء، والخف، وأرخى الذؤابة من خلفه تارة، وتركها تارة.\nوكان من هديه ( إذا لبس ثوبًا جديدًا أن يقول: \"اللهمَّ أنت كسوتني هذا القميص أو الرداء أو العمامة، أسألك خيره وخير ما صنع له، وأعوذ بك من شره، وشر ما صنع له\" [أبو داود والترمذي وأحمد].\nمزاحه :\nاشتهر عن الرسول ( أنه كان يمازح أزواجه، ويمازح أصحابه، وكثيرًا ما كان يمازح الأطفال والصبيان، فقد روى أنس أن رسول الله ( أتى لرجل من أصحابه كان يبيع متاعه في السوق، فاحتضنه رسول الله (، ولا يبصره الرجل، فقال الرجل: أرسلني، من هذا؟ فالتفت، فعرف رسول الله (، فجعل لا يألو ما ألصق ظهره لصدر الرسول ( حين عرفه، وجعل الرسول ( يقول: \"من يشتري العبد؟\" فقال: يا رسول الله، إذن والله تجدني كاسدًا، فقال (:\"ولكن عند الله لست بكاسد، أو قال: ولكن أنت عند الله تعالى غالب\" [أحمد]. وكثيراً ما كان الرسول ( يمازح الحسن والحسين -رضي الله عنهما-، ويحملهما على ظهره.\nخلقه:\nكان رسول الله ( أحسن الناس خلقًا، فكان كما قال الله له: (وإنك لعلى خلق عظيم) [القلم: 4]، وقد سئلت السيدة عائشة -رضي الله عنه- عن خلق رسول الله ( فقالت: كان أحسن الناس خلقًا، كان خلقه القرآن، يرضى لرضاه، ويغضب لغضبه، لم يكن فاحشًا ولا متفحشًا، ولا سخابًا في الأسواق، ولا يجزئ بالسيئة السيئة، ولكن يعفو ويصفح، ثم قالت: اقرأ سورة المؤمنين، اقرأ (قد أفلح المؤمنون) إلى العشر، فقرأ السائل قد أفلح المؤمنون، فقالت: هكذا كان خلق رسول الله (. [مسلم والترمذي]، بل جعل رسول الله ( غاية الرسالة إتمام الأخلاق الحميدة: فعن أبي هريرة -رضي الله عنه- قال: قال رسول الله (: \"إنما جئت لأتمم صالح الأخلاق\" [أحمد].\nوكان ( لين المعاملة حتى مع خدمه، وكان متباسطًا، فقد كانت الأمة لتأخذ بيد رسول الله (، فما ينزع يده من يدها حتى تذهب حيث شاءت، ويجيب إذا دعا. [البخاري وأحمد]\nوكان ( أحسن الناس تعليمًا، وأرفق الناس عند نصح أو تعليم الغير. وكان ( يخاطب الناس على قدر عقولهم.\nحلمه وعفوه (:\nكان ( أكثر الناس حلمًا، وقد قال له ربه -عز وجل-: (خذ العفو وأمر بالعرف وأعرض عن الجاهلين) [الأعراف: 199].\nولما نزلت هذه الآية، سأل الرسول ( جبريل عنها، فقال: لا أدري فصعد ثم نزل، فقال: يا محمد، إن الله تبارك وتعالى أمرك أن تعفو عمن ظلمك، وتعطي من حرمك، وتصل من قطعك\" [ابن مردويه]. لذلك عفا ( عن أهل مكة عندما فتحها، على الرغم مما فعلوه معه. وحلم الرسول ( كان فيما يتعلق بحق نفسه (، أما إذا كان الحق لله، فإنما كان يتعامل بالشدة؛ لقول الله له: (يا أيها النبي جاهد الكفار والمنافقين واغلظ عليهم) [التحريم: 9].\nحياؤه (:\nاشتهر رسول الله ( بالحياء، حتى كان الصحابة يعرفون ذلك في وجهه، فعن أبي سعيد الخدري قال: كان رسول الله ( أشد حياء من العذراء في خدرها، وكان إذا كره شيئًا عرفناه في وجهه. [متفق عليه] وكان من حيائه ( أنه لا يسأل من شيء إلا أعطى. [عبد بن حميد].\nرحمته وشفقته (:\nوصف الله رسوله ( بالرحمة، فقال تعالى: (وما أرسلناك إلا رحمة للعالمين) [الأنبياء: 107]، ومن رحمته ( أنه كان كثير الدعاء لأمته. وعرف عنه ( رحمته بالصغار، وكان يخفف صلاته بالناس إذا سمع بكاء طفل رحمة بأمه.\nوعرف عنه ( الرحمة والشفقة بالنساء، وأوصى بهن خيرًا.\nتواضعه (:\nأمر الله تعالى رسوله ( بالتواضع، فقال له: (واخفض جناحك لمن اتبعك من المؤمنين) [الشعراء: 215].\nوقد اشتهر عنه ( التواضع، فكان ( يركب الحمار، ويلبس الصوف، ويعقل الشاة، ويجيب الضعيف والمسكين إلى الطعام [الحاكم]. ومن تواضعه ( أنه كان ينقل التراب يوم الأحزاب، وقد وارى التراب بياض إبطه. [البخاري].\nوكان ( إذا سار مع أصحابه لا يسير أمامهم، بل يسير وسطهم أو خلفهم. [أحمد]، وكان ( لا يرد دعوة إنسان، بل كان يقول (: \"لو دعيت إلى كراع لأجبت\" [الخطيب]. وكان ( لا تغلق دونه لأبواب، ولا يقوم دونه الحجاب، فكان يقوم لكل من أراده، ويقضي حاجة من يطلب منه المساعدة.\nوكان من تواضعه ( أنه كان يمر على الصبيان، فيسلم عليهم. ولما دخل ( مكة منتصرًا، دخلها وهو راكب دابته، وذقنه على رحله متخشعًا. [الحاكم]. وكان رسول الله ( إذا استقبله الرجل وصافحه، لا ينـزع يده عن يده، حتى يكون الرجل هو الذي ينـزع، ولا يصرف وجهه عن وجهه، حتى يكون الرجل هو الذي يصرفه، ولم ير مقدمًا ركبتيه بين يدي جليس له.\n[الترمذي وابن ماجة].\nوكان من تواضعه ( أنه لا يحب الثناء الكثير عليه، ولا يحب أن يقوم إليه أحد.\nشجاعته (:\nفزع أهل المدينة ذات ليلة، فانطلق الناس نحو الصوت، فتلقاهم رسول الله( راجعًا، وقد سبقهم إلى الصوت، وهو على فرس لأبي طلحة عرى، في عنقه السيف، وهو يقول:\" لم تراعوا، لم تراعوا، ما وجدت من شيء\" [ابن سعد].\nوكان الرسول ( أشجع ما يكون في الحرب والقتال، فكان يثبت إذا فرَّ الناس، وقد كان الصحابة يعرفون شجاعة النبي(، بل كانوا يحتمون به وقت الشدة.\nكرمه وجوده (:\nاشتهر رسول الله ( بالجود والكرم، وما سئل(، فقال لا. [متفق عليه]\nوقد امتدح الشاعر الفرزدق النبي ( في كرمه وجوده فقال:\nما قال لا قطُّ إلا في تشهُّده لولا التشهد كانت لاؤه نعمُ\nوعن أنس -رضي الله عنه- قال: ما سئل رسول الله( شيئًا إلا أعطاه، ولقد جاءه رجل فأعطاه غنمًا بين جبلين، فرجع إلى أهله، فقال: يا قوم، أسلموا، فإن محمدًا يعطي عطاء من لا يخشى الفاقة، وإن كان الرجل ليجئ إلى الرسول وما يريد بذلك إلا الدنيا، فما يمسي حتى يكون دينه أحب إليه من الدنيا وما فيها. [مسلم].\nخوفه وخشيته (:\nكان رسول الله( شديد الخشية لله، تقول عائشة -رضي الله عنها-: ما رأيت رسول الله ( مستجمعًا قط ضاحكًا، حتى ترى لهواته، إنما كان يتبسم.\nوعن أبي ذر -رضي الله عنه- قال: قرأ رسول الله ( سورة الإنسان (هل أتى) حتى ختمها، ثم قال: \"إني أرى ما لا ترون، وأسمع ما لا تسمعون، أطّت السماء، وحقَّ لها أن تئط، ما فيها موضع أربع أصابع إلا وملك واضع جبهته ساجدًا لله، لو تعلمون ما أعلم، لضحكتم قليلاً، ولبكيتم كثيرًا، وما تلذذتم، بالنساء على الفرش، ولخرجتم إلى الصعدات تجأرون إلى الله تعالى، والله إني لوددت أني شجرة تعضد\" [الحاكم].\nشمائله (:\nكان لرسول الله ( بعض المعجزات والبركات، منها تكثير الماء بين يديه (، فقد أوتي ( بإناء فيه ماء، فوضع فيه يده، وجاء الصحابة فتوضئوا منه، وكانوا أكثر من ثلاثمائة، ومنها تكثير اللبن في الإناء كما حدث مع أبي هريرة -رضي الله عنه- وأهل الصُفَّة، وكم من مرة وضع يده على شاة لا تحلب فحلبت، وسيرته في تكثير الماء والطعام من أن تحصى، بل كان الطعام والشراب يسبحان بين يديه (، وقد سمع الصحابة التسبيح.\nولما اتخذ الرسول ( منبرًا، وترك جذع النخلة الذي كان يخطب عليه، حنَّ الجذع إليه، وصاح صياح الصبي حتى تصدع وانشق، فاحتضنه الرسول (.\n[أحمد والترمذي].\nوقد سبح الحصى في يديه، فسمع الصحابة له صوتا كصوت النحل، ثم وضعه في كف أبي بكر فسبح، ثم في كف عمر، ثم في كف عثمان، فسبح. [الطبراني والبيهقي].\nوقد وقف الرسول ( ومعه العشرة المبشرون بالجنة على جبل حراء، ففرح الجبل، فأمره الرسول ( أن يثبت ويهدأ. [البخاري].\nولما دخل الرسول ( مكة عند فتحها، وكان حول الكعبة ثلاثمائة وستون صنمًا، فأشار إلى كل صنع بعصا، وقال: (جاء الحق وزهق الباطل إن الباطل كان زهوقا) [الإسراء: 81]، فكان كل صنم يسقط دون أن يلمسه الرسول ( بالعصا. [متفق عليه]\nوكان للنبي ( معجزات مع الحيوانات، فقد هاج جمل عند حائط من حوائط بني النجار، لا يستطيع أحد أن يمسكه، فجاء النبي (، ونادى الجمل، فأتى إلى الرسول ( وبرك بين يديه. [مسلم]\nوجاءه ( جمل، قد جرح، وذرفت عيناه، فمسح رسول الله ( من رأسه إلى سنامه، فسكن الجمل، ثم قال لصاحبه: \"أما تتقي الله في هذه البهيمة التي ملكتها، إنه شكا إلى أنك تجيعه وتدئبه\" [أحمد ومسلم].\nواشتكى علي بن أبي طالب إلى الرسول ( وجع عينيه، وكان الرسول ( قد أراد أن يعطيه راية خيبر، فبصق رسول الله ( في عينيه، ودعا له، فشفي حتى كأن لم يكن به مرض. [متفق عليه]\nخصائصه (:\nوقد اختص الله رسوله ( بكثير من الخصائص، أهمها: أن الله قد أخذ الميثاق على النبيين أن يؤمنوا به وينصروه ويبشروا به أممهم، وقد جاء وصف الرسول ( في الكتب السابقة، كما وصف أصحابه أيضا، كما أن الملائكة أظلته في سفره (، وأنه ( أرجع الناس عقلاً، وأنه رأى جبريل -عليه السلام- مرتين.\nوخصه بأنه خاتم الأنبياء، وسيد الناس، وأكرم الخلق، وأنه بعث للناس كافة، وأن الجن آمنت به وأنه أرسل رحمة للعالمين، وأن شرعه مؤبد غير منسوخ، وأنه ناسخ لما قبله من الشرائع، وأنه نصر بالرعب مسيرة شهر، وأنه من صلى عليه مرة، صلى الله عليه به عشرا، وأن صلاة أمته تبلغه هو في قبره، وأنه أوتي جوامع الكلم، وجمع الله له القبلتين، وغفر له ما تقدم من ذنبه وما تأخر، وشرح له صدره، ووضع عنه وزره، ورفع له ذكره.\nوخصه الله دون الأنبياء بأشياء أهمها: إحلال الغنائم له، والأرض كله مسجد، والتراب طهور، وغير ذلك من الخصائص التي لا تعد ولا تحصى، مما اختص الله سبحانه وتعالى به نبيه .                      ",
    "number-en": "A gift, its characteristics and its merits",
    "label-en": "The Prophet had wives, chosen by God - Glory be to Him - to be the mothers of the believers, and to carry the burden of calling with the Messenger (they are: Khadija bint Khuwaylid - may God be pleased with her - and she was the first wife of the Prophet), and he did not marry anyone else until she died.\nAnd Sawda bint Zam’ah - may God be pleased with her - and the Messenger married her (after Khadija. Then he married Aisha bint Abu Bakr - may God be pleased with her - then he married Zainab bint Khuzaymah - may God be pleased with her - and she died with him). Then he married Umm Salamah Hind bint Abi Umayyah, who was the last of his women to die.\nThen he married Zainab bint Jahsh, the daughter of his paternal aunt, who was the wife of Zaid bin Haritha, the servant of the Messenger of God (and God - Glory be to Him - was her guardian who married her to the Messenger of God, and she died at the beginning of the caliphate of Omar. He married Juwayriyah bint Al-Harith, then he married Umm Habiba Ramla bint Abi Sufyan, whom the Messenger had married (while she was in the country of Abyssinia). Al-Najashi paid her dowry, which amounted to four hundred dinars, and she died in the days of her brother. Muawiya.\nHe married Safiyya bint Huyay bin Akhtab, Sayyid Bani al-Nadir, then he married Maymunah bint al-Harith al-Hilalia, and she was the last one he married. Secrets:\nAmong his concubines were Maria the Copt, Rayhana, a maid whom Zainab bint Jahsh gave him, and another maid whom he had taken captive.\nHis children:\nHe had (children) Al-Qasim, Zainab, Abdullah, Ibrahim, Ruqayyah, Umm Kulthum, and Fatima, and all of his children were from Khadija - may God be pleased with her - except Ibrahim, as he was from Mariah Al-Qibtiyyah.\nCharacteristics of the Prophet:\nThe Messenger of God (may God bless him and grant him peace) was stately and stately, his face shone like the shine of the moon on a full moon night. He was neither tall nor short, with a large head. His hair was a man between curly hair and long hair, with a little breakage and abundant hair, extending to the lobes of his ears. He has a wide forehead, has a light above him, thick beard, very dark eyes, plain cheeks, and fine teeth, with holes between his teeth, broad chest, wide between the shoulders, large bone heads, hairy arms, shoulders, and upper chest, spacious at ease, smooth feet, with no cracks or cracks in them, quick to walk when he walks, as if he is descending from a cliff, and when he turns, he turns around completely. Area:\nHe was always in thought, had no rest, did not speak without need, was silent for a long time, spoke in many words, glorified blessings even if they were small, did not criticize or praise anything from her, did not get angry with himself, and did not support her. When he pointed, he pointed with his whole hand, and when her heart was amazed, most of his laughter was smiling.\nHis entry:\nIt was (if he entered his house, he divided his entry into three parts: a part for God, a part for his family, and a part for himself, then he divided his part between himself and the people, and he distributed that to the public and the private, and did not enter anything on their behalf. His council:\nHe would not sit or stand except in remembrance of God Almighty. He would sit wherever the assembly ended, give all of its sessions a share. He would not see anyone more generous than him in his assembly. He would not leave whoever was with him. Whoever asked him for a need would only respond with it. If he did not find it, then with a good word. All people in his assembly were the same. His assembly was a gathering of forbearance, modesty, patience, and honesty, in which voices were not raised, and in which faults were not mentioned. He is harsh, does not talk, is not obscene, does not criticize, and does not joke a lot. He ignores what he does not desire. In his gatherings, people would abstain from three things: that he should not disparage anyone, that he should not criticize anyone, that he should not ask for someone’s faults, that he should not speak except about what he hoped would be rewarded, that he should laugh when those present laughed and be surprised at what they were surprised about, that he should be patient with a stranger for his harshness in his words and questions, and that he would not interrupt his conversation with anyone.\nHis silence:\nHis silence was based on four things: forbearance, caution, appreciation, and contemplation. As for his discretion, it was his level of looking and listening among people, and as for his contemplation, it was about what remains and what will perish. It was combined for “forbearance and patience,” so nothing made him angry unless God’s prohibitions were violated. His food:\nHe did not return the food he found, and he did not bother to ask for what he lost, so he ate whatever came near to him, and if his soul felt good, he did not blame it and left it. He used to eat whatever he could, but if he did not find anything to eat, he would be patient. Out of hunger, he would place a stone on his stomach. One crescent moon would pass by another crescent moon, and he would not light a fire in his house. The earth was his table, and he would place his food on it. He would eat with three fingers, which was the noblest thing to do in eating. The arrogant one eats with one finger, and the greedy eats with five. He would not eat while reclining, and he used to call God Almighty at the beginning of the food and praise Him at the end, and he would say: “Praise be to God, good and blessed praise, in which there is no sufficiency, no tears, and no one can do without Him.” [Al-Bukhari]\nDrink it:\nHe used to name God before drinking, and praise Him after, and he drank most of the time while sitting. Rather, he forbade drinking while standing, and once he drank while standing, to make it clear that it is permissible for you if it was due to a need or an excuse. And when he drank, he would give something to the person on his right, even if the person on his left was older than him, because he (likes to take the right hand in everything. His sleep:\nHe used to sleep on the bed sometimes, on mats sometimes, on the floor, and on the bed sometimes. On the authority of Abbad bin Tamim, on the authority of his uncle, he said: I saw the Messenger of God lying in the mosque, placing one of his legs on the other. [Agreed upon]. His bed was made of leather that had been stuffed with fibre. When he wanted to sleep, he would bring his palms together and blow on them, then recite in them: (Say: He is God, One) and (Say: I seek refuge in the Lord of creation) and (Say: I seek refuge in the Lord.) People) Then he wipes with them as much of his body as he can, starting with them on his head, face, and the rest of his body. He does this three times. [Abu Dawud and Al-Tirmidhi]. He used to sleep on his right side, placing his right hand under his cheek, then saying: “Oh God, protect me from your torment on the day You resurrect your servants” [Abu Dawud and al-Tirmidhi], and when he went to bed, he would say: “Praise be to God who fed us and gave us drink, and sufficed us and sheltered us. How many there are who have no sufficiency or shelter” [Muslim and al-Tirmidhi].\nHe used to sleep at the beginning of the night, and get up at the end of it, and he might stay up at the beginning of the night in the interests of the Muslims, and his eyes would sleep, but his heart would not sleep, and when he slept, they would not wake him until he was the one who woke up, and when he slept at night, he would lie on his right side, and if he slept before dawn, he would raise his arm, and put his head on his palm. [Al-Tirmidhi]. Ride it:\nHe used to ride horses, camels, mules, and donkeys. He used to ride alone, and sometimes someone else would ride the camel behind him. He mostly rode horses and camels, and he only had one mule, which was given to him as a gift.\nBuy and sell it:\nHe used to buy and sell, and his buying was more than his selling, especially after his prophethood. After the Hijra, no selling was recorded except rarely.\nThe Messenger of God was rewarded (and he was hired, and his hire was more than his rent, but it is preserved from him that he rented himself before the Prophethood for tending sheep, and rented himself from Khadija when he traveled with money to the Levant. He participated (with others) in trade, borrowed with or without a mortgage, borrowed things from others, and bought immediate and deferred purchases.\nHis treatment:\nHe was the best of people in treating people. Whenever he borrowed something, he would pay something better than it. A man came to him and would pay him a camel, and the Messenger of God said, “Give him.” They said, “We only find a tooth better than his.” The man said, “You have paid me back, may God pay you back.” The Messenger of God said, “Give him, for among the best of people is the best in spending.” [Agreed upon]. And when he spent what he borrowed, he would supplicate for whomever he borrowed, and he said: “May God bless your family and your wealth. The reward of the predecessors is praise and performance.” [Ahmad, Al-Nasa’i and Ibn Majah]. He was tolerant of those who paid him. A man came to him to pay him, and he spoke harshly to him. Omar ibn al-Khattab decided to beat him, so the Messenger of God said, “Mh, O Omar, I needed you to command me to pay, and I was more in need of you to command him to be patient.” [Al-Hakim].\nNatural matters:\nHe liked to take the right hand in everything, in his sitting, purification, taking, and giving. He used to make the right hand for his food, drink, and purification, and his left hand for his privacy, and other things to remove harm.\nShaving: He liked to shave the entire head, or leave it all, and he hated to shave part of it and leave part of it. The siwak: He loved the siwak, and used it when breaking his fast and while fasting. He used the siwak many times. He used the siwak when sleeping, when performing ablution, when praying, and when entering the house. He used the siwak to use the siwak.\nGood: He (loved good and used it in abundance), and he (did not reject good), as it was reported from him that he said (: “Whoever is offered good, do not turn it back” [Muslim]. He used kohl, and he used dye, and Jabir bin Samra - may God be pleased with him - was asked: Did the Prophet (may God be pleased with him) have gray hair? He said: There was no gray hair on his head except for hairs at the parting of his head when he applied oil and applied oil. He used to style his hair and decorate it sometimes, and Aisha - may God be pleased with her - decorated it and combed it at other times.\nTrimming the mustache: The Messenger of God used to trim his mustache. On the authority of Zaid bin Arqam, he said: The Messenger of God said: “Whoever does not trim his mustache is not one of us” [Al-Nasa’i and Al-Tirmidhi]. The Messenger established (a time after which he should not omit trimming the moustache. On the authority of Anas he said: A time for us the Prophet (in trimming the mustache and trimming the nails, not to omit more than forty days and nights).) [Muslim, Al-Tirmidhi and Al-Nasa’i]\nLaughing and crying (:\nThe Prophet’s laughter was a smile, not a guffaw, and he used to laugh at what people laughed at, and he laughed at something similar to which he was surprised to see, or was surprised that it happened, or was something that rarely happened. As for his crying, his condition was like that of laughter, in which he did not raise a sound, but his eyes were tearing up, and he could hear his chest wheezing, and his crying was sometimes out of mercy for the dead, sometimes out of fear of God, and sometimes out of fear and pity for his nation. He used to cry when hearing the Qur’an, and he cried when his son Abraham died. When he was asked about that, he said: “The eyes bring tears, and the heart grieves, and we say only what pleases our Lord, and indeed, with you, O Abraham, we are sad.” [Agreed upon]. His engagement:\nThe Messenger preached (on the ground, on the pulpit, on a camel, and on a she-camel. He had a palm tree trunk on which he preached until a pulpit was made for him. When he preached, his eyes would turn red and his voice would rise, as if he were warning an army.\nWhenever he ascended the pulpit, he would face the people and say: “Peace be upon you.” He would conclude his sermon by asking for forgiveness, and he would often deliver a sermon with the Qur’an. On the authority of Umm Hisham bint Haritha, she said: “I did not take (Q and the Glorious Qur’an) except from the tongue of the Messenger of God (he recites it every Friday on the pulpit when he addresses the people” [Muslim, Al-Nasa’i and Abu Dawud]. He was (taking into account the condition and interests of the addressees, and he would begin his sermon with praise and praise, bearing witness in it to the Shahada, and mentioning himself in it by his name, “Muhammad.”) And when he stood up to deliver the sermon, he would take a stick and lean on it while he was on the pulpit, and his pulpit had three steps. When he stood on it and faced the people, the muezzin would call the muezzin and would not say anything before or after it, and no one would speak during his sermon.\nWhenever something incidental came to him during his sermon, he would focus on it, then return to his sermon. One time he was addressing people, and Al-Hassan and Al-Hussein came stumbling wearing red shirts. He interrupted his speech, went down, carried them, and then returned to his pulpit.\nHis sermon could be long or short according to the needs of the people and taking into consideration their circumstances, and his occasional sermon was longer than his regular sermon.\nWear it:\nThe Messenger did not adhere to wearing a specific type of clothing. He used to wear whatever clothing was available to him, whether it was wool, cotton, or linen. The Messenger wore the Yemeni cloak, the green cloak, the robe, the cloak, the shirt, the trousers, the robe, and the slippers. He sometimes let down the coat behind him, and sometimes left it on. One of his guidance was (when he put on a new garment, he would say: “O God, you clothed me with this shirt, robe, or turban. I ask You for its goodness and the goodness of what was done to it, and I seek refuge in You from its evil and the evil of what was done to it.”) [Abu Dawud, Al-Tirmidhi, and Ahmad].\nJoking:\nIt is well known about the Messenger (that he used to joke with his wives, and with his companions, and he often joked with children and boys. Anas narrated that the Messenger of God (came to a man of his companions who was selling his goods in the market, so the Messenger of God embraced him) and the man did not see him, so the man said: Send me, who is this? So he turned around, and he recognized the Messenger of God (and began not to care about what stuck his back to the Messenger’s chest) when he recognized him, and the Messenger (said: “Who buys the slave?” Then he said: O Messenger of God, then by God you find me a tyrant. He said: “But with God I am not a tyrant,” or he said: “But in the sight of God Almighty you are victorious” [Ahmed]. The Messenger (often used to joke with Al-Hasan and Al-Hussein - may God be pleased with them) and carry them on his back. His character:\nThe Messenger of God (was the best of people in character, so he was as God said to him: (And indeed, you are of great character) [Al-Qalam: 4]. Lady Aisha - may God be pleased with her) was asked about the character of the Messenger of God (and she said: He was the best of people. His character was the Qur’an. He was pleased with His pleasure and angered when He was angry. He was not obscene or indecent, nor did he gossip in the markets. He did not repay evil with evil, but he pardoned and pardoned. Then She said: Read Surah Al-Mu'minun, read (The Believers have succeeded) up to ten, so the questioner recited, 'The Believers have succeeded', and she said: This is how the Messenger of God was created (. [Muslim and Al-Tirmidhi], Rather, the Messenger of God made (the goal of the message to be the completion of good morals): On the authority of Abu Hurairah - may God be pleased with him - he said: The Messenger of God said (: “I have only come to complete good morals” [Ahmad].\nHe was gentle in his dealings, even with his servants, and he was easy-going. The female slave would have taken the hand of the Messenger of God. He would not remove his hand from hers until she went wherever she wanted, and he would answer when he called. [Al-Bukhari and Ahmad]\nHe was the most well-educated of people, and the most gentle when advising or teaching others. He used to address people according to their intellect.\nHis dream and forgiveness (:\nHe was (the most forbearing of people, and his Lord - the Almighty - said to him: (Embrace forgiveness, enjoin what is right, and turn away from the ignorant) [Al-A’raf: 199].\nWhen this verse was revealed, the Messenger (Gabriel) asked about it, and he said: I do not know. So he went up and then came down and said: O Muhammad, God, Blessed and Most High, commanded you to pardon those who wronged you, give to those who deprived you, and maintain ties with those who separated from you” [Ibn Mardawayh]. Therefore, he pardoned the people of Mecca when he conquered it, despite what they did to him. The Messenger’s dream (was in relation to his own rights), but if the truth belongs to God, then he was dealing with severity, because God said to him: (O Prophet, strive hard against the disbelievers and hypocrites and be harsh with them) [Al-Tahrim: 9].\nHis modesty (:\nThe Messenger of God (was famous for his shyness, even the Companions knew that in his face. On the authority of Abu Saeed Al-Khudri, he said: The Messenger of God (was more shy than a virgin in her shyness, and if he disliked something we recognized it in his face. [Agreed upon] and part of his modesty) was that he did not ask for anything without giving. [Abdullah bin Hamid].\nHis mercy and compassion (:\nGod described His Messenger (with mercy, and God Almighty said: (And We have not sent you except as a mercy to the worlds)) [Al-Anbiya’: 107], and from his mercy (is that he used to supplicate a lot for his nation. He was known for his mercy toward children, and he would shorten his prayers with people if he heard a child crying out of mercy for his mother.\nHe was known for his mercy and compassion towards women, and he advised them well.\nHis humility (:\nGod Almighty commanded His Messenger (to be humble), and said to him: (And lower your wings to those of the believers who follow you) [Al-Shu’ara’: 215]. He was famous for his humility, as he used to ride a donkey, wear wool, groom a sheep, and provide food to the weak and needy [Al-Hakim]. Among his humility is that he used to move dirt on the Day of the Battles, and the dirt covered the whites of his armpits. [Al-Bukhari].\n“When he walked with his companions, he would not walk in front of them, but rather he would walk in the middle or behind them. [Ahmad], and he (would not refuse someone’s invitation. Rather, he would say: ‘If I had been invited to a village, I would have responded’) [Al-Khatib]. (No doors were closed without him, and no veil stood before him.) So he would stand for everyone who wanted him, and fulfill the needs of those who asked him for help.\nPart of his humility was that he used to pass by the boys and greet them. And when he entered Mecca in triumph, he entered it riding his animal, with his chin on his saddle bowed and humbled. [Al-Hakim]. The Messenger of God, when a man received him and shook hands with him, would not remove his hand from his, so that the man would be the one to remove it, and would not turn his face away from his face, so that the man would be the one turning him away. He did not see his knees in front of the hands of someone sitting with him.\n[Al-Tirmidhi and Ibn Majah]. Part of his humility was that he did not like a lot of praise, and he did not like anyone to come up to him.\nHis courage (:\nThe people of Medina were terrified one night, so the people started towards the sound, and the Messenger of God (returning) met them, and he had preceded them to the sound, and he was riding on Abu Talha’s naked horse, with a sword around his neck, and he was saying: “You did not observe, you did not observe, I did not find anything” [Ibn Saad].\nThe Messenger (was the bravest in war and fighting, so he would stand firm when people fled, and the Companions knew the courage of the Prophet). Rather, they would take refuge in him in times of distress.\nHis generosity is his presence (:\nThe Messenger of God was famous for his generosity and generosity, and he was not asked about anything, so he said no. [Agreed upon]\nThe poet Al-Farazdaq praised the Prophet for his generosity and presence, saying:\nHe never said no except in his tashahhud. If it were not for the tashahhud, his no would have been yes\nOn the authority of Anas - may God be pleased with him - he said: The Messenger of God (may God be pleased with him) never asked for anything but he gave it to him. A man came to him and gave him sheep between two mountains. Then he returned to his family and said: O my people, embrace Islam, for Muhammad gives the gift of one who does not fear poverty. And if a man were to come to the Messenger and what he wanted by doing so was the world, then he would not come until his religion was dearer to him than the world and all that is in it. [Muslim].\nHis fear and apprehension (:\nThe Messenger of God (may God be pleased with him) had a great fear of God. Aisha - may God be pleased with her - said: I never saw the Messenger of God (may God bless him and grant him peace) laughing together, so much so that you could see his amusement. Rather, he was smiling.\nOn the authority of Abu Dharr - may God be pleased with him - he said: The Messenger of God recited (Surat Al-Insan (Has He Come)) until he finished it, then he said: “I see what you do not see, and I hear what you do not hear. The sky expanded, and it has the right to bow down, and there is no place in it for four fingers except for an angel with his forehead prostrated to God. If you knew what I know, you would laugh little, and weep a lot, and you would not take pleasure in women on beds, and you would go out to the ascents.” You dare to God Almighty, By God, I wish I were a tree that would support me.” [Al-Hakim].\nShamaila (:\nThe Messenger of God (had some miracles and blessings, including the multiplication of water in his hands). He was given (a vessel containing water, so he put his hand in it, and the Companions came and performed ablution from it, and they were more than three hundred. Among them was the multiplication of milk in the vessel, as happened with Abu Hurairah - may God be pleased with him - and the people of Suffah. How many times did he put his hand on a sheep that was not milked and it milked? His behavior in the abundance of water and food is too numerous to count. Rather, the food and drink were They glorified God in front of him, and the Companions heard the glorification. When the Messenger took (a pulpit, and left the trunk of the palm tree on which he was delivering the sermon, the trunk bent towards him, and the shout of a boy shouted until it cracked and split, so the Messenger embraced him ().\n[Ahmad and Al-Tirmidhi].\nThe pebbles swam in his hands, and the Companions heard a sound like the sound of bees. Then he put them in the palm of Abu Bakr and he swam, then in the palm of Omar, then in the palm of Uthman, so he swam. [Al-Tabarani and Al-Bayhaqi].\nThe Messenger (and with him the ten who were promised Paradise) stood on Mount Hira, and the mountain rejoiced, so the Messenger commanded him (to remain steadfast and calm down). [Bukhari].\nWhen the Messenger entered (Mecca at the time of its conquest, and there were three hundred and sixty idols around the Kaaba, he pointed to each item with a stick, and said: (Truth has come and falsehood has perished. Indeed, falsehood has perished) [Al-Isra: 81], so every idol fell without the Messenger touching it (with the stick). [Agreed upon]\nThe Prophet had miracles with animals. A camel ran rampant at one of the walls of Bani al-Najjar, and no one could restrain it. So the Prophet came and called the camel, and it came to the Messenger and blessed him in his hands. [Muslim]\nA camel came to him, wounded and with tears in his eyes. So the Messenger of God wiped him from his head to his hump, and the camel calmed down. Then he said to its owner: “Are you not fearing God regarding this animal that you have owned? He complained to me that you were starving him and exhausting him” [Ahmad and Muslim].\nAli bin Abi Talib complained to the Messenger about the pain in his eyes, and the Messenger wanted to give him the banner of Khaybar, so the Messenger of God spat in his eyes and prayed for him, and he was healed as if he had no disease. [Agreed upon]\nIts characteristics (:\nGod has singled out His Messenger (with many characteristics, the most important of which is that God took a covenant from the prophets to believe in Him, support Him, and give good tidings to their nations. The Messenger was described (in the previous books, as was also described by his companions, just as the angels shaded him on his travels), and that he (brought people back reason, and that he saw Gabriel - peace be upon him) twice. He singled him out as the seal of the prophets, the master of people, and the most honorable of creation, that he was sent to all people, that the jinn believed in him, that he was sent as a mercy to the worlds, that his law is eternal and not abrogated, that he abrogates the laws that came before it, that he was defeated by terror the distance of a month, that whoever prayed upon him once, God will bless him ten times, that the prayer of his nation will reach him in his grave, that he was given all the words, and God combined the two kisses for him, and forgave him his previous sins. His sin and what was delayed, and He opened his chest to him, and removed his burden from him, and raised his remembrance for him. God singled him out over the prophets with things, the most important of which are: spoils being made permissible for him, the entire earth being a place of worship, the dirt being pure, and countless other characteristics that God Almighty singled out for his Prophet."
  },
  {
    "number": "أحوال العرب قبل الإسلام ",
    "text": "",
    "label": "كان العرب في شبه الجزيرة العربية قبل بعثة الرسول صلى الله عليه وسلم يعبدون الأصنام من دون الله، ويقدمون لها القرابين، ويسجدون لها، ويتوسلون بها، وهي أحجار لا تضر ولا تنفع، وكان حول الكعبة ثلاثمائة وستون صنمًا.\nومن عجيب أمرهم أن أحدهم كان يشتري العجوة، ويصنع منها صنمًا، ثم يعبده ويسجد له، ويسأله أن يحجب عنه الشر ويجلب له الخير، فإذا شعر بالجوع أكل إلهه!! ثم يأخذ كأسًا من الخمر، يشربها حتى يفقد وعيه، وفي ذلك الزمان كانت تحدث أشياء غريبة وعجيبة، فالناس يطوفون عرايا حول الكعبة، وقد تجردوا من ملابسهم بلا حياء، يصفقون ويصفرون ويصيحون بلا نظام، وقد وصف الله -عز وجل- صلاتهم فقال: {وما كان صلاتهم عند البيت إلا مكاء وتصدية فذوقوا العذاب بما كنتم تكفرون} [الأنفال:35].\nوكانت الحروب تقوم بينهم لأتفه الأسباب، وتستمر مشتعلة أعوامًا طويلة فهذان رجلان يقتتلان، فيجتمع الناس حولهما، وتناصر كل قبيلة صاحبها، لم يسألوا عن الظالم ولا عن المظلوم، وتقوم الحرب في لمح البصر، ولا تنتهي حتى يموت الرجال، وانتشرت بينهم العادات السيئة مثل: شرب الخمر، وقطع\nالطرق والزنا.\nوكانت بعض القبائل تهين المرأة، وينظرون إليها باحتقار، فهي في اعتقادهم عار كبير عليهم أن يتخلصوا منها، فكان الرجل منهم إذا ولدت له أنثى؛ حزن حزنًا شديدًا. قال تعالى: {وَإِذَا بُشِّرَ أَحَدُهُمْ بِالأُنثَى ظَلَّ وَجْهُهُ مُسْوَدًّا وَهُوَ كَظِيمٌ * يَتَوَارَى مِنَ الْقَوْمِ مِن سُوءِ مَا بُشِّرَ بِهِ أَيُمْسِكُهُ عَلَى هُونٍ أَمْ يَدُسُّهُ فِي التُّرَابِ أَلاَ سَاء مَا يَحْكُمُونَ} _[النحل: 58-59] وقد يصل به الأمر إلى أن يدفنها وهي حية، وهي العادة التي عرفت عندهم بوأد البنات.\nفهذا رجل يحمل طفلته ويسير بها إلى الصحراء فوق الرمال المحرقة، ويحفر حفرة ثم يضع ابنته فيها وهي حية، ولا تستطيع الطفلة البريئة أن تدافع عن نفسها؛ بل تناديه: أبتاه .. أبتاه .. فلا يرحم براءتها ولا ضعفها، ولا يستجيب لندائها.. بل يهيل عليها الرمال، ثم يمشي رافعًا رأسه كأنه لم يفعل شيئًا!! قال تعالى: {وإذا الموءودة سئلت بأي ذنب قتلت} [التكوير: 7-8] وليس هذا الأمر عامًا بين العرب، فقد كانت بعض القبائل تمنع وأد البنات.\nوكان الظلم ينتشر في المجتمع؛ فالقوى لا يرحم الضعيف، والغني لا يعطف على الفقير، بل يُسخره لخدمته، وإن أقرضه مالا؛ فإنه يقرضه بالربا، فإذا اقترض الفقير دينارًا؛ يرده دينارين، فيزداد فقرًا، ويزداد الغني ثراء، وكانت القبائل متفرقة، لكل قبيلة رئيس، وهم لا يخضعون لقانون منظم، ومع كل هذا الجهل والظلام في ذلك العصر المسمى بالعصر الجاهلي، كانت هناك بعض الصفات الطيبة\nوالنبيلة؛ كإكرام الضيف، فإذا جاء ضيف على أحدهم بذل له كل ما عنده، ولم يبخل عليه بشىء، فها هو ذا حاتم الطائي لم يجد ما يطعم به ضيوفه؛ فذبح\nفرسه -وقد كانوا يأكلون لحم الخيل- وأطعمهم قبل أن يأكل هو.\nوكانوا ينصرون المستغيث فإذا نادى إنسان، وقال: إني مظلوم اجتمعوا حوله وردوا إليه حقه، وقد حدث ذات مرة أن جاء رجل يستغيث، وينادي بأعلى صوته في زعماء قريش أن ينصروه على العاص بن وائل الذي اشترى منه بضاعته، ورفض أن يعطيه ثمنها؛ فتجمع زعماء قريش في دار عبدالله بن جدعان وتحالفوا على أن ينصروا المظلوم، ويأخذوا حقه من الظالم، وسموا ذلك الاتفاق حلف الفضول، وذهبوا إلى العاص بن وائل، وأخذوا منه ثمن البضاعة، وأعطوه لصاحبه.\nوفي هذا المجتمع ولد محمد صلى الله عليه وسلم من أسرة كريمة المعدن، نبيلة النسب، جمعت ما في العرب من فضائل، قال رسول الله صلى الله عليه وسلم عن نفسه: (إن الله اصطفى كنانة من ولد إسماعيل، واصطفى قريشًا من كنانة واصطفي من قريش بني هاشم، واصطفاني من بني هاشم) [مسلم].",
    "number-en": "Conditions of the Arabs before Islam",
    "label-en": "Before the mission of the Messenger, may God bless him and grant him peace, the Arabs in the Arabian Peninsula used to worship idols instead of God, and they offered sacrifices to them, prostrated to them, and pleaded with them. They were stones that did no harm or benefit. There were three hundred and sixty idols around the Kaaba.\nOne of the strangest things about them is that one of them used to buy ajwa, make an idol out of it, then worship it and prostrate to it, and ask it to protect him from evil and bring him good, and when he felt hungry, he ate his god!! Then he takes a cup of wine and drinks it until he loses consciousness. At that time, strange and wondrous things were happening. People would circumambulate naked around the Kaaba, stripped of their clothes without shame, clapping, whistling, and shouting without order. God Almighty described their prayer, saying: {And their prayer at the House was nothing but wailing and shouting. So taste the torment because you disbelieved} [Al-Anfal: 35].\nWars would break out between them for the most trivial of reasons, and would continue to rage for long years. These were two men fighting, and people would gather around them, and each tribe would support its owner. They would not ask about the oppressor or the oppressed. The war would break out in the blink of an eye, and would not end until the men died. Bad habits spread among them, such as: drinking alcohol and cutting off...\nRoads and adultery.\nSome tribes used to insult women and look at them with contempt. They believed that it was a great disgrace for them to get rid of them. If a man among them gave birth to a girl, He was very sad. God Almighty said: {And when the good tidings of a female is given to one of them, his face remains dark and he is gloomy. Humiliation or trample it in the dust? Is it not evil that they decide?\nThis is a man carrying his child and walking with her into the desert over the burning sand, digging a hole and then putting his daughter in it while she was alive, and the innocent child was unable to defend herself; Rather, she calls him: Father... Father... He does not have mercy on her innocence or her weakness, nor does he respond to her calls... Rather, he throws sand on her, then walks with his head raised as if he had not done anything!! God Almighty said: {And when the woman who is having sex is asked, for what sin was she killed?} [Al-Takwir: 7-8] This matter is not general among the Arabs, as some tribes prohibited the infanticide of girls.\nInjustice was spreading in society; The strong do not have mercy on the weak, and the rich do not be kind to the poor, but rather force him to serve him, even if he lends him money. He lends it to him at interest, so if the poor person borrows a dinar; He returned two dinars, and he became poorer, and the rich became richer. The tribes were dispersed, each tribe had a chief, and they were not subject to an organized law. Despite all this ignorance and darkness in that era called the pre-Islamic era, there were some good qualities.\nAnd noble; Like honoring a guest, if a guest comes to one of them, he gives him everything he has, and does not skimp on him with anything. Here, Hatem Al-Tai did not find anything to feed his guests. So he slaughtered\nHis horse - they ate horse meat - and he fed them before he ate.\nThey would help those seeking help, and if a person called out and said: I am wronged, they would gather around him and return his rights to him. It happened once that a man came asking for help, and calling at the top of his voice to the leaders of Quraysh to support him against Al-Aas bin Wael, from whom he had bought his goods, and refused to give him the price for them. So the leaders of Quraish gathered in the house of Abdullah bin Jadaan and agreed to support the oppressed and take his rights from the oppressor. They called that agreement the Alliance of Fudul. They went to Al-Aas bin Wael, took the price of the goods from him, and gave it to its owner.\nIn this society, Muhammad, may God’s prayers and peace be upon him, was born from a noble family of noble lineage, which combined the virtues of the Arabs. The Messenger of God, may God’s prayers and peace be upon him, said about himself: (God chose Kinana from the descendants of Ishmael, and chose Quraysh from Kinana, and chose from Quraysh Banu Hashim, and chose me from Banu Hashim) [Muslim]."
  },
  {
    "number": "نسب الرسول صلى الله عليه وسلم ",
    "text": "",
    "label": "هو محمد بن عبد الله بن عبد المطلب بن هاشم بن عبد مناف بن قصي بن كلاب بن مرة بن كعب بن لؤى بن غالب بن فهر بن مالك بن النضر بن كنانة بن خزيمة بن مدركة بن إلياس بن مضر بن نزار بن معد بن عدنان الذي يصل نسبه إلى إسماعيل بن إبراهيم -عليهما الصلاة والسلام..\nجده هاشم وحكاية الثريد:\nكان عمرو بن عبد مناف الجد الأكبر للرسول صلى الله عليه وسلم رجلا كريمًا فقد حدث في عصره أن نزل القحط بالناس، فلم يجدوا ما يأكلون، وكادوا يموتون جوعًا، وبدأ كل إنسان يفكر في نجاة نفسه فقط، فالذي عنده طعام يحرص عليه ويحجبه عن الناس، فذهب عمرو إلى بيته وأخرج ما عنده من الطعام، وأخذ يهشم الثريد (أي: يكسر الخبز في المرق) لقومه ويطعمهم، فسموه (هاشمًا)؛ لأنه كريم يهشم ثريده للناس جميعًا.\nوعندما ضاق الرزق في مكة أراد هاشم أن يخفف عن أهلها، فسافر إلى الشام صيفًا، وإلى اليمن شتاء؛ من أجل التجارة، فكان أول من علَّم الناس هاتين الرحلتين، وفي إحدى الرحلات، وبينما هاشم في طريقه للشام مر بيثرب، فتزوج سلمى بنت عمرو إحدى نساء بني النجار، وتركها وهي حامل بابنه عبد المطلب لتلد بين أهلها الذين اشترطوا عليه ذلك عند زواجه منها.\nجده عبدالمطلب وحكاية الكنز:\nكان عبد المطلب بن هاشم جد الرسول الكريم صلى الله عليه وسلم يسقي الحجيج الذين يأتون للطواف حول الكعبة، ويقوم على رعاية بيت الله الحرام فالتف الناس حوله، فكان زعيمهم وأشرفهم، وكان عبدالمطلب يتمنى لو عرف مكان بئر زمزم ليحفرها؛ لأنها كانت قد ردمت بمرور السنين، ولم يَعُد أحد يعرف مكانها، فرأى في منامه ذات ليلة مكان بئر زمزم، فأخبر قومه بذلك ولكنهم لم يصدقوه، فبدأ عبدالمطلب في حفر البئر هو وابنه الحارث، والناس يسخرون منهما، وبينما هما يحفران، تفجر الماء من تحت أقدامهما، والتف الناس حول البئر مسرورين، وظن عبدالمطلب أنهم سيشكرونه، لكنه فوجئ بهم ينازعونه امتلاك البئر، فشعر بالظلم والضعف لأنه ليس له أبناء إلا الحارث، وهو لا يستطيع نصرته، فإذا به يرفع يديه إلى السماء، ويدعو الله أن يرزقه عشرة أبناء من الذكور، ونذر أن يذبح أحدهم تقربًا لله.\nحكاية الأبناء العشرة :\nاستجاب الله دعوة عبد المطلب، فرزقه عشرة أولاد، وشعر عبدالمطلب بالفرحة فقد تحقق رجاؤه، ورزق بأولاد سيكونون له سندًا وعونًا، لكن فرحته لم تستمر طويلا؛ فقد تذكر النذر الذي قطعه على نفسه، فعليه أن يذبح واحدًا من\nأولاده، فكر عبدالمطلب طويلا، ثم ترك الاختيار لله تعالى، فأجرى قرعة بين أولاده، فخرجت القرعة على عبدالله أصغر أولاده وأحبهم إلى قلبه، فأصبح\nعبد المطلب في حيرة؛ أيذبح ولده الحبيب أم يعصى الله ولا يفي بنذره؟\nفاستشار قومه، فأشاروا عليه بأن يعيد القرعة، فأعادها مرارًا، لكن القدر كان يختار عبدالله في كل مرة، فازداد قلق عبدالمطلب، فأشارت عليه كاهنة بأن يفتدي ولده بالإبل، فيجري القرعة بين عبدالله وعشرة من الإبل، ويظل يضاعف عددها، حتى تستقر القرعة على الإبل بدلا من ولده، فعمل عبدالمطلب بنصيحة الكاهنة، واستمر في مضاعفة عدد الإبل حتى بلغت مائة بعير، وعندئذ وقعت القرعة عليها، فذبحها فداء لعبد الله، وفرحت مكة كلها بنجاة عبد الله، وذبح له والده مائة ناقة فداءً له، وازداد عبد المطلب حبًّا لولده، وغمره بعطفه ورعايته.\nأبوه عبدالله وزواجه المبارك من السيدة آمنة:\nكان عبد الله أكرم شباب قريش أخلاقًا، وأجملهم منظرًا، وأراد والده\nعبد المطلب أن يزوجه، فاختار له زوجة صالحة، هي السيدة آمنة بنت وهب بن عبد مناف بن زهرة أطهر نساء بني زهرة، وسيدة نسائهم، والسيدة آمنة تلتقي في نسبها مع عبدالله والد النبي صلى الله عليه وسلم في كلاب بن مرة، وتمر الأيام، ويخرج عبدالله في تجارة إلى الشام، بعد أن ترك زوجته آمنة حاملا ولحكمة يعلمها الله، مات عبد الله قبل أن يرى وليده.\nحكاية الفيل:\nوذات يوم، استيقظ أهل مكة على خبر أصابهم بالفزع والرعب، فقد جاء ملك اليمن أبرهة الأشرم الحبشي بجيش كبير، يتقدمه فيل ضخم، يريد هدم الكعبة حتى يتحول الحجيج إلى كنيسته التي بناها في اليمن، وأنفق عليها\nأموالا كثيرة، واقترب الجيش من بيت الله الحرام، وظهر الخوف والهلع على وجوه أهل مكة، والتف الناس حول عبدالمطلب الذي قال لأبرهة بلسان الواثق من نصر الله تعالى: (للبيت رب يحميه).\nفازداد أبرهة عنادًا، وأصرَّ على هدم الكعبة، فوجه الفيل الضخم نحوها، فلما اقترب منها أدار الفيل ظهره ولم يتحرك،، وأرسل الله طيورًا من السماء تحمل حجارة صغيرة، لكنها شديدة صلبة، ألقت بها فوق رءوس جنود أبرهة فقتلتهم وأهلكتهم. قال تعالى: {ألم تر كيف فعل ربك بأصحاب الفيل . ألم يجعل كيدهم في تضليل . وأرسل عليهم طيرًا أبابيل . ترميهم بحجارة من سجيل فجعلهم كعصف مأكول} [الفيل] وفي هذا العام ولد الرسول صلى الله عليه وسلم.                      ",
    "number-en": "Lineage of the Messenger, may God bless him and grant him peace",
    "label-en": "He is Muhammad bin Abdullah bin Abdul Muttalib bin Hashim bin Abd Manaf bin Qusayy bin Kilab bin Murra bin Kaab bin Luay bin Ghalib bin Fahr bin Malik bin Al-Nadr bin Kinana bin Khuzaymah bin Mudrikah bin Ilyas bin Mudar bin Nizar bin Ma’ad bin Adnan, whose lineage goes back to Ismail bin Ibrahim - peace and blessings be upon them both.\nHis grandfather Hashem and the story of the porridge:\nAmr ibn Abd Manaf, the great-grandfather of the Messenger, may God bless him and grant him peace, was a generous man. It happened in his time that drought befell the people, and they did not find anything to eat, and they almost died of hunger, and every person began to think about saving himself only. Whoever has food is careful about it and hides it from people. So Amr went to his house and took out what food he had, and began crushing the porridge (i.e. breaking the bread in the broth) for his people and feeding them, so they called him (Hashim); Because he is generous, he breaks his porridge for all people.\nWhen livelihood became tight in Mecca, Hashem wanted to ease the burden on its people, so he traveled to the Levant in the summer, and to Yemen in the winter. For the sake of trade, he was the first to teach people these two journeys. On one of the journeys, while Hashim was on his way to the Levant, he passed through Yathrib and married Salma bint Amr, one of the women of Banu al-Najjar. He left her while she was pregnant with his son, Abdul Muttalib, so that she could give birth among her family, who stipulated that he should do so when he married her.\nHis grandfather Abdul Muttalib and the story of the treasure:\nAbdul Muttalib bin Hashim, the grandfather of the Noble Messenger, may God bless him and grant him peace, used to water the pilgrims who came to circumambulate the Kaaba, and he took care of the Sacred House of God, so the people gathered around him, so he was their leader and the most honorable of them. Abdul Muttalib wished he knew the location of the Zamzam Well so he could dig it. Because it had been filled in over the years, and no one knew its location anymore, so he saw in his dream one night the location of Zamzam Well, so he told his people about it, but they did not believe him. So Abdul Muttalib and his son Al-Harith began to dig the well, and the people mocked them. While they were digging, water gushes out from under their feet, and the people gathered around the well happily, and Abdul-Muttalib thought they would thank him, but he was surprised by them disputing with him the possession of the well. He felt wronged and weak because he had no sons except Al-Harith, and he could not support him, so he raised his hands to the sky, praying to God to grant him ten male sons, and vowed to slaughter one of them as an offering to God. The story of the ten sons:\nGod answered Abdul Muttalib’s prayer, and gave him ten children. Abdul Muttalib felt happy because his hope had been fulfilled, and he was blessed with children who would be his support and help, but his joy did not last long. He remembered the vow he had made to himself, so he must slaughter one of the...\nHis children. Abdul Muttalib thought for a long time, then he left the choice to God Almighty, so he drew lots among his children, and the lot fell on Abdullah, the youngest of his children and the most beloved to his heart, so he became\nAbdul Muttalib is confused; Should he slaughter his beloved son or disobey God and not fulfill his vow?\nSo he consulted his people, and they advised him to repeat the lot, so he repeated it several times. But fate chose Abdullah every time, and Abdul Muttalib's anxiety increased, so a priestess advised him to ransom his son with camels, so lots were drawn between Abdullah and ten camels, and he continued to double their number, until the lot settled on the camels instead of his son, so Abdul Muttalib followed the advice of the priestess, and continued to double the number of camels until it reached one hundred camels, and then the lot fell on them, so he slaughtered them as a ransom for Abdullah, and all of Mecca rejoiced. Abdullah survived, and his father slaughtered a hundred camels for him, and Abdul Muttalib’s love for his son increased and showered him with his compassion and care. His father Abdullah and his blessed marriage to Mrs. Amna:\nAbdullah was the most honorable of the Quraysh youth in morals, the most beautiful in appearance, and he wanted his father\nAbdul Muttalib wanted him to marry him, so he chose a good wife for him, namely, Mrs. Amna bint Wahb bin Abd Manaf bin Zahra, the purest of the women of Bani Zahra, and the mistress of their women. Mrs. Amna shares her lineage with Abdullah, the father of the Prophet, may God bless him and grant him peace, in Kilab bin Murra. Days passed, and Abdullah went out on trade to the Levant, after he left his wife, Amna, pregnant, and according to a wisdom known to God, Abdullah died before seeing his child. Elephant tale:\nOne day, the people of Mecca woke up to news that terrified and terrified them. The King of Yemen, Abraha, had come to the Abyssinian Ashram with a large army, led by a huge elephant, wanting to demolish the Kaaba so that the pilgrims would turn to his church that he had built in Yemen, and spent on it.\nA lot of money, and the army approached the Sacred House of God, and fear and panic appeared on the faces of the people of Mecca, and people gathered around Abdul Muttalib, who said to Abraha, with the confident tongue of God Almighty’s victory: (The House has a Lord who protects it). So Abraha became more stubborn and insisted on demolishing the Kaaba, so he directed the huge elephant towards it. When he approached it, the elephant turned its back and did not move. God sent birds from the sky carrying small, but very solid, stones that threw them over the heads of Abraha’s soldiers, killing them and destroying them. God Almighty said: {Have you not seen how your Lord dealt with the companions of the elephant? Did He not mislead their plots? And he sent flocks of birds against them. You throw stones of clay at them, and He makes them like edible straw.} [The Elephant] And in this year the Messenger, may God bless him and grant him peace, was born."
  },
  {
    "number": "ميلاد الرسول صلى الله عليه وسلم وطفولته",
    "text": "",
    "label": "في يوم الاثنين الثاني عشر من شهر ربيع الأول الذي يوافق عام (175م) ولدت السيدة آمنة بنت وهب زوجة عبد الله بن عبد المطلب غلامًا جميلا، مشرق الوجه، وخرجت ثويبة الأسلمية خادمة أبي لهب -عم النبي صلى الله عليه وسلم- تهرول إلى سيدها أبي لهب، ووجهها ينطق بالسعادة، وما كادت تصل إليه حتى همست له بالبشرى، فتهلل وجهه، وقال لها من فرط سروره:\nاذهبي فأنت حرة! وأسرع عبد المطلب إلى بيت ابنه عبد الله ثم خرج حاملا الوليد الجديد، ودخل به الكعبة مسرورًا كأنه يحمل على يديه كلَّ نعيم\nالدنيا، وأخذ يضمه إلى صدره ويقبله في حنان بالغ، ويشكر الله ويدعوه، وألهمه الله أن يطلق على حفيده اسم محمد.\nحكاية مرضعة الرسول صلى الله عليه وسلم:\nجاءت المرضعات من قبيلة بني سعد إلى مكة؛ ليأخذن الأطفال الرُّضَّع إلى البادية حتى ينشئوا هناك أقوياء فصحاء، قادرين على مواجهة أعباء الحياة، وكانت كل مرضعة تبحث عن رضيع من أسرة غنية ووالده حي؛ ليعطيها مالاً كثيرًا، لذلك رفضت كل المرضعات أن يأخذن محمدًا صلى الله عليه وسلم لأنه يتيم، وأخذته السيدة حليمة السعدية لأنها لم تجد رضيعًا غيره، وعاش محمد صلى الله عليه وسلم في قبيلة بني سعد، فكان خيرًا وبركة على حليمة وأهلها، حيث اخضرَّت أرضهم بعد الجدب والجفاف، وجرى اللبن في ضروع الإبل.\nحكاية شق الصدر:\nوفي بادية بني سعد وقعت حادثة غريبة، فقد خرج محمد صلى الله عليه وسلم ذات يوم ليلعب مع أخيه من الرضاعة ابن حليمة السعدية، وفي أثناء لعبهما ظهر رجلان فجأة، واتجها نحو محمد صلى الله عليه وسلم فأمسكاه، وأضجعاه على الأرض ثم شقَّا صدره، وكان أخوه من الرضاعة يشاهد عن قرب ما يحدث\nله، فأسرع نحو أمه وهو يصرخ، ويحكى لها ما حدث.\nفأسرعت حليمة السعدية وهي مذعورة إلى حيث يوجد الغلام القرشي فهو أمانة عندها، وتخشى عليه أن يصاب بسوء، لكنها على عكس ما تصورت، وجدته واقفًا وحده، قد تأثر بما حدث، فاصفر لونه، فضمته في حنان إلى\nصدرها، وعادت به إلى البيت، فسألته حليمة: ماذا حدث لك يا محمد؟ فأخذ يقص عليها ما حدث، لقد كان هذان الرجلان ملكين من السماء أرسلهما الله تعالى؛ ليطهرا قلبه ويغسلاه، حتى يتهيأ للرسالة العظيمة التي سيكلفه الله بها.\nخافت حليمة على محمد، فحملته إلى أمه في مكة، وأخبرتها بما حدث\nلابنها، فقالت لها السيدة آمنة في ثقة: أتخوفتِ عليه الشيطان؟ فأجابتها حليمة: نعم، فقالت السيدة آمنة: كلا والله ما للشيطان عليه من سبيل، وإن لابني\nلشأنًا؛ لقد رأيت حين حملت به أنه خرج مني نور، أضاء لي به قصور\nالشام، وكان حَمْلُه يسيرًا، فرجعت به حليمة إلى قومها بعد أن زال الخوف من قلبها، وظل عندها حتى بلغ عمره خمس سنوات، ثم عاد إلى أمه في مكة.\nرحلة محمد صلى الله عليه وسلم مع أمه إلى يثرب:\nوذات يوم، خرجت السيدة آمنة ومعها طفلها محمد وخادمتها أم أيمن من مكة متوجهة إلى يثرب؛ لزيارة قبر زوجها عبد الله، وفاء له، وليعرف ولدها قبر\nأبيه، ويزور أخوال جده من بني النجار، وكان الجو شديد الحر، وتحملت أعباء هذه الرحلة الطويلة الشاقة، وظلت السيدة آمنة شهرًا في المدينة، وأثناء عودتها مرضت وماتت وهي في الطريق، في مكان يسمى الأبواء، فدفنت فيه، وعادت\nأم أيمن إلى مكة بالطفل محمد يتيمًا وحيدًا، فعاش مع جده عبدالمطلب، وكان عمر محمد آنذاك ست سنوات.\n\nمحمد صلى الله عليه وسلم في كفالة جده عبد المطلب:\nبعد وفاة السيدة آمنة عاش محمد صلى الله عليه وسلم في ظل كفالة جده عبدالمطلب الذي امتلأ قلبه بحب محمد، فكان يؤثر أن يصحبه في مجالسه\nالعامة، ويجلسه على فراشه بجوار الكعبة، ولكن عبدالمطلب فارق الحياة ومحمد في الثامنة من عمره.\nمحمد صلى الله عليه وسلم في كفالة عمه أبي طالب:\nوتكفَّل به بعد وفاة جده عمه أبو طالب، فقام بتربيته ورعايته هو وزوجته فاطمة بنت أسد، وأخذه مع أبنائه، رغم أنه لم يكن أكثر أعمام النبي صلى الله عليه وسلم مالا، لكنه كان أكثرهم نبلا وشرفًا، فزاد عطفه على محمد صلى الله عليه وسلم حتى إنه كان لا يجلس في مجلس إلا وهو معه، ويناديه بابنه من شدة حبه له.\nرحلة إلى الشام:\nخرج محمد صلى الله عليه وسلم مع عمه أبو طالب في رحلة إلى الشام مع القوافل التجارية وعمره اثنا عشر عامًا، وتحركت القافلة، ومضت في\nطريقها؛ حتى وصلت إلى بلدة اسمها (بصرى) وأثناء سيرها مرت بكوخ يسكنه راهب اسمه (بُحَيْرَى) فلما رأى القافلة خرج إليها، ودقق النظر في وجه محمد صلى الله عليه وسلم طويلا، ثم قال لأبي طالب: ما قرابة هذا الغلام منك؟ فقال أبوطالب: هو ابني -وكان يدعوه بابنه حبًّا له- قال بحيرى: ما هو بابنك، وما ينبغي أن يكون هذا الغلام أبوه حيًّا، قال أبو طالب: هو ابن أخي، فسأله بحيرى: فما فعل أبوه؟ قال أبو طالب: مات وأمه حبلى به؟ فقال له بحيرى: صدقت! فارجع به إلى بلده واحذر عليه اليهود!! فوالله لئن رأوه هنا ليوقعون به شرًّا، فإنه سيكون لابن أخيك هذا شأن عظيم، فأسرع أبو طالب بالعودة إلى مكة وفي صحبته ابن أخيه محمد.                      ",
    "number-en": "The birth of the Prophet, may God bless him and grant him peace, and his childhood",
    "label-en": "On Monday the twelfth of the month of Rabi’ al-Awwal, which corresponds to the year 175 AD, Mrs. Amna bint Wahab, the wife of Abdullah bin Abdul Muttalib, gave birth to a beautiful boy, with a radiant face. Thuwaibah al-Aslamiyah, the maid of Abu Lahab - the uncle of the Prophet, may God bless him and grant him peace, came out running to her master Abu Lahab, with her face expressing happiness. She had barely reached him before she whispered good news to him, and his face lit up, and he said to her out of his great happiness:\nGo, you are free! Abdul Muttalib hurried to his son Abdullah’s house, then he went out carrying the new newborn, and entered the Kaaba with him happily, as if he was carrying all the blessings on his hands.\nworld, and he began to hug him to his chest and kiss him with great tenderness, thanking God and praying to him, and God inspired him to name his grandson Muhammad.\nThe story of the wet nurse of the Messenger, may God bless him and grant him peace:\nBreastfeeding women from the Banu Saad tribe came to Mecca. To take the infants to the desert so that they could grow up strong and healthy, able to face the burdens of life. Every wet nurse was looking for an infant from a rich family whose father was alive. To give her a lot of money, Therefore, all the breastfeeding mothers refused to take Muhammad, may God bless him and grant him peace, because he was an orphan, and Mrs. Halima al-Saadia took him because she did not find an infant other than him. Muhammad, may God bless him and grant him peace, lived in the Bani Saad tribe, so he was good and a blessing for Halima and her family, as their land became green after barrenness and drought, and milk flowed from the udders of camels. The story of the chest split:\nIn the desert of Bani Saad, a strange incident occurred. Muhammad, may God’s prayers and peace be upon him, went out one day to play with his breast-feeding brother, Ibn Halima al-Saadia. While they were playing, two men suddenly appeared and headed towards Muhammad, may God’s prayers and peace be upon him. They grabbed him, laid him on the ground, and then cut open his chest. His breast-feeding brother was watching closely what was happening.\nHe ran to his mother, screaming, and told her what happened. Halima Al-Saadia, terrified, hurried to where the Qurashi boy was. He was a trustworthy person for her, and she feared that he might be harmed. However, contrary to what she had imagined, she found him standing alone, affected by what had happened, and his color turned yellow, so she hugged him tenderly to her.\nHer chest, and she brought it home, so Halima asked him: What happened to you, Muhammad? So he started telling her what happened. These two men were angels from heaven sent by God Almighty. To purify and wash his heart, so that he can prepare himself for the great mission that God will entrust him with. Halima was afraid for Muhammad, so she took him to his mother in Mecca and told her what had happened\nTo her son, Mrs. Amna said to her confidently: Do you fear the devil for him? Halima answered her: Yes, and Mrs. Amna said: No, by God, Satan has no way against him, even against my son\nfor a matter; When I became pregnant with him, I saw that a light came out of me, and it illuminated palaces for me\nDamascus, and his burden was easy, so Halima returned him to her people after the fear had disappeared from her heart, and he remained with her until he was five years old, then he returned to his mother in Mecca. Muhammad’s journey, may God bless him and grant him peace, with his mother to Yathrib:\nOne day, Mrs. Amna, with her child, Muhammad, and her maid, Umm Ayman, left Mecca, heading to Yathrib. To visit the grave of her husband Abdullah, out of loyalty to him, and so that her son would know his grave\nHis father, and he was visiting his grandfather’s maternal uncles from Bani al-Najjar. The weather was very hot, and she endured the burdens of this long, arduous journey. The woman remained safe for a month in the city, and during her return she fell ill and died on the way, in a place called Al-Abwaa, so she was buried there and returned.\nUmm Ayman took the child Muhammad to Mecca, an orphan alone, and he lived with his grandfather Abdul Muttalib. Muhammad was six years old at the time. Muhammad, may God bless him and grant him peace, in the sponsorship of his grandfather Abdul Muttalib:\nAfter the death of Mrs. Amna, Muhammad, may God bless him and grant him peace, lived under the care of his grandfather Abdul Muttalib, whose heart was filled with love for Muhammad, and he preferred to accompany him in his gatherings.\nThe public, and made him sit on his bed next to the Kaaba, but Abdul Muttalib died when Muhammad was eight years old. Muhammad, may God bless him and grant him peace, in the sponsorship of his uncle Abu Talib:\nAfter the death of his grandfather, his uncle Abu Talib, he took care of him. He raised and cared for him and his wife, Fatima bint Asad, and took him with his children. Although he was not the most wealthy of the uncles of the Prophet, may God bless him and grant him peace, he was the most noble and honorable of them. His compassion for Muhammad, may God bless him and grant him peace, increased to the point that he would not sit in a gathering unless he was with him, and would call him his son out of the intensity of his love for him. A trip to the Levant:\nMuhammad, may God bless him and grant him peace, went out with his uncle Abu Talib on a trip to the Levant with commercial caravans when he was twelve years old. The caravan moved and went on.\nher way; Until it reached a town called (Busra), and while walking it passed a hut inhabited by a monk named (Buhaira). When he saw the caravan, he went out to it and looked closely at the face of Muhammad, may God bless him and grant him peace, for a long time. Then he said to Abu Talib: How close is this boy to you? Abu Talib said: He is my son - and he used to call him his son out of love for him. Buhairi said: He is not your son, and this boy should not have a living father. Abu Talib said: He is my brother’s son, so Buhairi asked him: What did his father do? Abu Talib said: He died and his mother was pregnant with him? Bahiri said to him: You are right! So return him to his country and beware of the Jews!! By God, if they saw him here, they would harm him, but this son of yours would be of great importance, so Abu Talib hastened to return to Mecca with his nephew Muhammad in his company."
  },
  {
    "number": "شبابه صل الله عليه وسلم",
    "text": "",
    "label": "كان الشباب في مكة يلهون ويعبثون، أما محمد صلى الله عليه وسلم فكان يعمل ولا يتكاسل؛ يرعى الأغنام طوال النهار، ويتأمل الكون ويفكر في خلق الله، وقد ذكر النبي صلى الله عليه وسلم -بعد أن أوتي النبوة- ذلك العمل، فقال: (ما بعث الله نبيًّا إلا رعى الغنم) فقال أصحابه: وأنت؟ قال: (نعم، كنتُ أرعاها على قراريط لأهل مكة) [البخاري] وكان الله -سبحانه- يحرسه ويرعاه على الدوام؛ فذات يوم فكر أن يلهو كما يلهو الشباب، فطلب من صاحب له أن يحرس أغنامه، حتى ينزل مكة ويشارك الشباب في لهوهم، وعندما وصل إليها وجد حفل زواج، فوقف عنده، فسلط الله عليه النوم، ولم يستيقظ إلا في صباح اليوم التالي.\nوعندما كانت قريش تجدد بناء الكعبة، كان محمد صلى الله عليه وسلم ينقل معهم الحجارة للكعبة وعليه إزاره، فقال له العباس عمه: اجعل إزارك على رقبتك يقيك الحجارة، ففعل، فخر إلى الأرض، وجعل ينظر بعينيه إلى\nالسماء، ويقول: إزاري.. إزاري، فشد عليه، فما رؤى بعد ذلك عريانًا.\nالتاجر الأمين:\nوحين جاوز النبي صلى الله عليه وسلم العشرين من عمره أُتيحت له فرصة السفر مع قافلة التجارة إلى الشام، ففي مكة كان الناس يستعدون لرحلة الصيف التجارية إلى الشام، وكل منهم يعد راحلته وبضاعته وأمواله، وكانت السيدة خديجة بنت خويلد -وهي من أشرف نساء قريش، وأكرمهن أخلاقًا، وأكثرهن مالا- تبحث عن رجل أمين يتاجر لها في مالها ويخرج به مع القوم، فسمعت عن محمد وأخلاقه العظيمة، ومكانته عند أهل مكة جميعًا ، واحترامهم له؛ لأنه صادق أمين، فاتفقت معه أن يتاجر لها مقابل مبلغ من المال، فوافق محمد صلى الله عليه وسلم وخرج مع غلام لها اسمه ميسرة إلى الشام.\nتحركت القافلة في طريقها إلى الشام، وبعد أن قطع القوم المسافات\nالطويلة نزلوا ليستريحوا بعض الوقت، وجلس محمد صلى الله عليه وسلم تحت شجرة، وعلى مقربة منه صومعة راهب، وما إن رأى الراهب محمدًا صلى الله عليه وسلم حتى أخذ ينظر إليه ويطيل النظر، ثم سأل ميسرة: من هذا الرجل الذي نزل تحت هذه الشجرة؟ فقال ميسرة: هذا رجل من قريش من\nأهل الحرم، فقال الراهب: ما نزل تحت هذه الشجرة إلا نبي، وباعت القافلة كل تجارتها، واشترت ما تريد من البضائع، وكان ميسرة ينظر إلى محمد ويتعجب من سماحته وأخلاقه والربح الكبير الذي حققه في مال السيدة خديجة.\nوفي طريق العودة حدث أمر عجيب، فقد كانت هناك غمامة في السماء تظل محمدًا وتقيه الحر، وكان ميسرة ينظر إلى ذلك المشهد، وقد بدت على وجهه علامات الدهشة والتعجب، وأخيرًا وصلت القافلة إلى مكة فخرج الناس لاستقبالها مشتاقين؛ كل منهم يريد الاطمئنان على أمواله، وما تحقق له\nمن ربح، وحكى ميسرة لسيدته خديجة ما رأى من أمر محمد، فقد أخبرها بما قاله الراهب، وبالغمامة التي كانت تظل محمدًا في الطريق؛ لتقيه من الحر دون سائر أفراد القافلة.\nزواج محمد صلى الله عليه وسلم من السيدة خديجة:\nاستمعت السيدة خديجة إلى ميسرة في دهشة، وقد تأكدت من أمانة محمد\nصلى الله عليه وسلم وحسن أخلاقه، فتمنت أن تتزوجه، فأرسلت السيدة خديجة صديقتها نفيسة بنت منبه؛ لتعرض على محمد الزواج، فوافق محمد صلى الله عليه وسلم على هذا الزواج، وكلم أعمامه، الذين رحبوا ووافقوا على هذا\nالزواج، وساروا إلى السيدة خديجة يريدون خطبتها؛ فلما انتهوا إلى دار خويلد قام أبو طالب عم النبي وكفيله يخطُب خُطبة العرس، فقال: (الحمد لله الذي جعلنا من ذرية إبراهيم وزرع إسماعيل، وجعل لنا بيتًا محجوجًا وحرمًا\nآمنًا، وجعلنا أمناء بيته، وسُوَّاس حرمه، وجعلنا الحكام على الناس، ثم إن ابن أخي هذا محمد بن عبد الله لا يوزن به رجل شرفًا ونبلاً وفضلاً، وإن كان في المال قلا، فإن المال ظل زائل، وقد خطب خديجة بنت خويلد وبذل لها من الصداق ما عاجله وآجله من مالي كذا وكذا، وهو والله بعد هذا له نبأ\nعظيم، وخطر جليل) وتزوج النبي صلى الله عليه وسلم السيدة خديجة، وعاشا معًا حياة طيبة موفقة، ورزقهما الله تعالى البنين والبنات، فأنجبت له ستة أولاد هم: زينب، ورقية، وأم كلثوم، وفاطمة، وعبدالله، والقاسم، وبه يكنى الرسول فيقال: أبو القاسم.\nبناء الكعبة وقصة الحجر الأسود:\nاجتمعت قريش لإعادة بناء الكعبة، وأثناء البناء اختلفوا فيمن ينال شرف وضع الحجر الأسود في مكانه، واشتد الخلاف بينهم، وكاد أن يتحول إلى حرب بين قبائل قريش، ولكنهم تداركوا أمرهم، وارتضوا أن يُحكِّموا أول داخل عليهم وانتظر القوم، وكل واحد يسأل نفسه: ترى من سيأتي الآن؟ ولمن سيحكم؟ وفجأة تهللت وجوههم بالفرحة والسرور عندما رأوا محمدًا يقبل عليهم، فكل واحدٍ منهم يحبه ويثق في عدله وأمانته ورجاحة عقله وسداد رأيه، فهتفوا: هذا الأمين قد رضيناه حَكَما، وعرضوا عليه الأمر وطلبوا منه أن يحكم بينهم، فخلع الرسول صلى الله عليه وسلم رداءه ووضع الحجر عليه، ثم أمر رؤساء القبائل فرفعوا الثوب حتى أوصلوا الحجر إلى مكانه من الكعبة، عندئذ حمله الرسول صلى الله عليه وسلم بيده الشريفة ووضعه مكانه، وهكذا كفاهم الله\nشر القتال.                      ",
    "number-en": "His youth, may God bless him and grant him peace",
    "label-en": "The youth in Mecca were having fun and fooling around, but Muhammad, may God bless him and grant him peace, was working and not being lazy. He grazes sheep all day long, contemplating the universe and thinking about God’s creation. The Prophet, may God bless him and grant him peace, mentioned that work after he was given the prophecy, and said: (God did not send a prophet except that he tended sheep) and his companions said: And you? He said: (Yes, I used to take care of it on karats for the people of Mecca) [Al-Bukhari] And God - Glory be to Him - was always guarding and taking care of him; One day, he thought of having fun like the youth had fun, so he asked a friend of his to guard his sheep, so he could go down to Mecca and join the youth in their fun. When he arrived there, he found a wedding party, so he stopped there, so God made him sleep, and he did not wake up until the next morning. When the Quraysh were rebuilding the Kaaba, Muhammad, may God’s prayers and peace be upon him, was transporting stones to the Kaaba with them while wearing his garment. His uncle Abbas said to him: Place your garment on your neck to protect you from the stones. So he did so, so he fell to the ground and looked at the stones with his eyes.\nThe sky, and he said: My garment.. My garment, so he tightened it, and after that he was not seen naked. Honest merchant:\nWhen the Prophet, may God’s prayers and peace be upon him, was over twenty years old, he was given the opportunity to travel with a trade caravan to the Levant. In Mecca, people were preparing for the summer trade trip to the Levant, and each of them was preparing his mount, his goods, and his money. Mrs. Khadija bint Khuwaylid - who was one of the most honorable women of Quraysh, the most generous of their morals, and the most wealthy - was looking for an honest man who would trade her money for her and go out with the people, so she heard about Muhammad and his morals. His great status among all the people of Mecca, and their respect for him; Because he is honest and trustworthy, she agreed with him to trade for her in exchange for a sum of money. Muhammad, may God bless him and grant him peace, agreed and went out with a boy of hers named Maysarah to the Levant.\nThe caravan moved on its way to the Levant, after the people had covered the distances\nAl-Tawila went down to rest for a while, and Muhammad, may God’s prayers and peace be upon him, sat under a tree, and near him was a monk’s cell. As soon as the monk saw Muhammad, may God’s prayers and peace be upon him, he began to look at him and look for a long time, then he asked Maysara: Who is this man who came down under this tree? Maysarah said: This is a man from Quraish\nPeople of the Sanctuary, and the monk said: Only a prophet descended under this tree, and the caravan sold all its trade, and bought whatever goods it wanted, and Maysarah was looking at Muhammad and marveling at his tolerance and morals and the great profit he had made with the money of Mrs. Khadija.\nOn the way back, a strange thing happened. There was a cloud in the sky that remained Muhammad and his pious free man, and Maysarah was looking at that scene, and signs of astonishment and wonder appeared on his face. Finally, the caravan arrived in Mecca, and the people came out to receive it eagerly. Everyone wants to be sure of their money. And what he achieved\nWhoever won, and Maysarah told his lady Khadija what he saw about Muhammad’s affairs, he told her what the monk said, and about the cloud that was shadowing Muhammad on the road; To protect him from the heat without the rest of the caravan members.\nThe marriage of Muhammad, may God bless him and grant him peace, to Lady Khadija:\nMrs. Khadija listened to Maysara in amazement, and she was convinced of Muhammad's honesty\nMay God bless him and grant him peace, and his good morals, she wished to marry him, so Mrs. Khadija sent her friend Nafisa bint Munabbih. To propose marriage to Muhammad, Muhammad, may God bless him and grant him peace, agreed to this marriage, and spoke to his uncles, who welcomed and agreed to this.\nmarriage, They walked to Mrs. Khadija, wanting to propose to her. When they reached Khuwaylid’s house, Abu Talib, the uncle of the Prophet and his sponsor, stood up to deliver the wedding sermon, and said: (Praise be to God who made us among the descendants of Abraham and seeded Ishmael, and made for us a protected house and a sanctuary.\nWe made him the trustees of his house, the guardians of his sanctuary, and we made the rulers over the people. Then, this nephew of mine, Muhammad ibn Abdullah, cannot be compared to a man in honor, nobility, or merit, and if there is little money, then the money is fleeting. He proposed to Khadija bint Khuwaylid and gave her the dowry, current and future money, such-and-such, and he, by God, will have news after this.\nGreat, And a great danger) The Prophet, may God’s prayers and peace be upon him, married Mrs. Khadija, and they lived a good and successful life together, and God Almighty blessed them with sons and daughters, and she gave birth to him six children: Zainab, Ruqayyah, Umm Kulthum, Fatima, Abdullah, and Al-Qasim, and this is the nickname of the Messenger, and it is said: Abu Al-Qasim.\nThe construction of the Kaaba and the story of the Black Stone:\nThe Quraysh gathered to rebuild the Kaaba, and during construction they disagreed about who would have the honor of placing the Black Stone in its place. The dispute between them intensified, and almost turned into a war between the Quraysh tribes, but they reconciled their matter and were satisfied to rule over the first one who entered upon them, and the people waited. Everyone asks himself: Who will come now? Who will rule? Suddenly their faces lit up with joy and happiness when they saw Muhammad approaching them. Every one of them loved him and trusted him in his justice, his honesty, his sound mind, and his judgment. So they chanted: “This trustworthy person we have accepted as an arbitrator.” They presented the matter to him and asked him to rule between them. So the Messenger, may God bless him and grant him peace, took off his robe and placed the stone on it. Then he ordered the tribal leaders to lift the robe until they brought the stone to its place from the Kaaba. Then the Messenger carried it to its place from the Kaaba. May God bless him and grant him peace, with his noble hand, and put him in his place, and thus God sufficed them\nThe evil of fighting."
  },
  {
    "number": "الوحي",
    "text": "",
    "label": "كان محمد صلى الله عليه وسلم يكثر من الذهاب إلى غار حراء، فيجلس وحده فيه أيامًا بلياليها؛ يفكر في خالق هذا الكون بعيدًا عن الناس وما يفعلونه\nمن آثام، ولقد كان يمشي تلك المسافة الطويلة ويصعد ذلك الجبل العالي، ثم يعود إلى مكة ليتزود بالطعام ويرجع إلى ذلك الغار، وظل مدة لا يرى رؤيا إلا وتحققت كما رآها، وبدأت تحدث له أشياء عجيبة لا تحدث لأي إنسان\nآخر، فقد كان في مكة حَجَر يسلم عليه كلما مر به، قال صلى الله عليه وسلم: (إني لأعرف حجرًا بمكة كان يسلم عليَّ قبل أن أبعث، إني لأعرفه\nالآن) [مسلم].\nوكان النبي صلى الله عليه وسلم يجلس ذات يوم في الغار، وإذا بجبريل -عليه السلام- ينزل عليه في صورة رجل ويقول له: اقرأ. وكان النبي صلى الله عليه وسلم لا يعرف القراءة ولا الكتابة، فخاف وارتعد، وقال للرجل: ما أنا بقارئ. وإذا بجبريل -عليه السلام- يضم النبي صلى الله عليه وسلم إليه بشدة، ثم يتركه ويقول له: اقرأ. فقال محمد: ما أنا بقارئ. وتكرر ذلك مرة ثالثة، فقال جبريل: {اقرأ باسم ربك الذي خلق . خلق الإنسان من علق . اقرأ وربك الأكرم} _[العلق:1-3]. فكانت هذه أولى آيات القرآن التي نزلت في شهر رمضان على رسول الله صلى الله عليه وسلم وهو في السنة الأربعين من عمره.\nرجع محمد صلى الله عليه وسلم إلى بيته مسرعًا، ثم رقد وهو يرتعش، وطلب من زوجته أن تغطيه قائلا: (زملونى، زملونى) وحكى لها ما رآه في الغار، فطمأنته السيدة خديجة، وقالت له: كلا والله لا يخزيك الله أبدًا، إنك لتصل الرحم وتحمل الكلَّ (الضعيف) وتُكسب المعدوم، وتُقري (تكرم) الضيف، وتعين على نوائب الحق، فلما استمع النبي صلى الله عليه وسلم إلى كلام السيدة خديجة، عادت إليه الطمأنينة، وزال عنه الخوف والرعب، وبدأ يفكر فيما حدث.\n\n\n\nحكاية ورقة بن نوفل:\nوكان للسيدة خديجة ابن عم، اسمه (ورقة بن نوفل) على علم بالديانة المسيحية فذهبت إليه ومعها زوجها؛ ليسألاه عما حدث، فقالت خديجة لورقة: يابن عم اسمع من ابن أخيك، فقال ورقة: يابن أخي ماذا ترى؟ فأخبره النبي صلى الله عليه وسلم بالذي حدث في غار حراء، فلما سمعه ورقة قال: هذا الناموس الذي كان ينزل على موسى، ثم أخبره (ورقة) أنه يتمنى أن يعيش حتى ينصره، ويكون معه عندما يحاربه قومه، ويُخرجونه من مكة، فلما سمع الرسول صلى الله عليه وسلم ذلك تعجب وسأل ورقة قائلا: أو مُخرجيَّ هم؟ فقال له: نعم، لم يأتِ أحد بمثل ما جئت به إلا عُودِيَ، ومنذ ذلك اليوم والرسول صلى الله عليه وسلم يزداد شوقًا لوحي السماء الذي تأخر نزوله عليه بعد هذه المرة.\nعودة الوحي:\nوبعد فترة، وبينما كان النبي صلى الله عليه وسلم يمشي إذا به يسمع صوتًا، فرفع وجهه إلى السماء، فرأى الملك الذي جاءه في غار حراء جالسًا على كرسي بين السماء والأرض، فارتعد الرسول صلى الله عليه وسلم من هول المنظر، وأسرع إلى المنزل، وطلب من زوجته أن تغطيه، قائلا: دثرونى . دثرونى، وإذا بجبريل ينزل إليه بهذه الآيات التي يوجهها الله إليه: {يا أيها المدثر . قم فأنذر . وربك فكبر . وثيابك فطهر . والرجز فاهجر} _[المدثر: 1-5] وفي هذه الآيات تكليف من الله سبحانه لرسوله صلى الله عليه وسلم أن يدعو الناس.\nالدعوة إلى الإسلام سرَّا:\nكان الناس في مكة يعبدون الأصنام منذ زمن بعيد، وقد ورثوا عبادتها عن آبائهم وأجدادهم؛ فبدأ الرسول صلى الله عليه وسلم بالدعوة إلى الإسلام سرَّا، وبدأ بأقرب الناس إليه، فآمنت به زوجته خديجة بنت خويلد، وآمن به أيضًا ابن عمه علي بن أبي طالب، وكان غلامًا في العاشرة من عمره، وكان رسول الله صلى الله عليه وسلم هو الذي يقوم بتربيته، وكان صديقه أبو بكر أول الذين آمنوا به من الرجال، وكان ذا مكانة عظيمة بين قومه، يأتي الناس إليه ويجلسون\nمعه، فاستغل أبو بكر مكانته هذه وأخذ يدعو من يأتي إليه ويثق فيه\nإلى الإسلام، فأسلم على يديه عبدالرحمن بن عوف، وعثمان بن عفان، والزبير ابن العوام، وطلحة بن عبيد الله .. وغيرهم.\nولم تكن الصلاة قد فرضت في ذلك الوقت بالكيفية التي نعرفها، ولكن رسول الله صلى الله عليه وسلم كان يصلي بأصحابه الذين أسلموا سرًّا ركعتين قبل طلوع الشمس وركعتين قبل الغروب، وذلك في مكان بعيد عن أعين\nالكفار.\nوذات يوم كان الرسول صلى الله عليه وسلم يصلي بأصحابه في شِعبٍ من شِعَابِ مكة، إذ أقبل عليهم أبو طالب عم النبي صلى الله عليه وسلم والذي لم يؤمن برسالته، فلما رأى الرسول صلى الله عليه وسلم وأصحابه يصلون، سأله عن هذا الدين الجديد، فأخبره الرسول صلى الله عليه وسلم به لأنه يثق في عمه ويأمل أن يدخل الإسلام، ولكن أبا طالب رفض أن يترك دين آبائه وأجداده وطمأن النبي صلى الله عليه وسلم وتعهد بحمايته من أعدائه، وأوصى ابنه عليًّا أن يلزم رسول الله صلى الله عليه وسلم، واستمر الرسول صلى الله عليه وسلم يدعو قومه سرَّا، وعدد المسلمين يزداد يومًا بعد يوم، ويقوى الإيمان في قلوبهم بما ينزله الله عليهم من القرآن الكريم، وظلوا هكذا ثلاث سنوات.",
    "number-en": "Revelation",
    "label-en": "Muhammad, may God bless him and grant him peace, would often go to the cave of Hira, and would sit alone there for days and nights. He thinks about the Creator of this universe apart from people and what they do\nOf sins, he used to walk that long distance and climb that high mountain, then return to Mecca to obtain food and return to that cave, and for a while he did not see a vision without it coming true as he saw it, and strange things began to happen to him that would not happen to any human being.\nAnother, there was a stone in Mecca that he greeted whenever he passed by. He, may God’s prayers and peace be upon him, said: (I know a stone in Mecca that used to greet me before I was sent. I know him.\nNow) [Muslim]. One day the Prophet, may God bless him and grant him peace, was sitting in the cave, and suddenly Gabriel, peace be upon him, came down to him in the form of a man and said to him: Read. The Prophet, may God bless him and grant him peace, did not know how to read or write, so he was afraid and trembling, and said to the man: I am not a reader. Then Gabriel - peace be upon him - hugged the Prophet, may God bless him and grant him peace, tightly to him, then let him go and said to him: Read. Muhammad said: I am not a reader. This was repeated a third time, and Gabriel said: {Read in the name of your Lord who created. Man was created from a clot. Read, and your Lord is the Most Generous} _[Al-Alaq: 1-3]. These were the first verses of the Qur’an that were revealed in the month of Ramadan to the Messenger of God, may God bless him and grant him peace, when he was in the fortieth year of his life.\nMuhammad, may God’s prayers and peace be upon him, quickly returned to his house, then he lay down, trembling, and asked his wife to cover him, saying: “Zamlouni, Zamaloni,” and he told her what he saw in the cave. Lady Khadija reassured him and said to him: “No, by God, may God never disgrace you. You are close to the womb, you carry all (the weak), you support the needy, you honor (honour) the guest, and you help in the calamities of truth.” When the Prophet, may God bless him and grant him peace, listened Peace be upon him, upon the words of Lady Khadija, peace returned to him. Fear and terror disappeared from him, and he began to think about what had happened.\n\n\n\nThe story of Waraqa bin Nawfal:\nMrs. Khadija had a cousin, named (Warqa bin Nawfal), who was knowledgeable about the Christian religion, so she went to him with her husband. To ask him about what happened, Khadija said to Waraqah: Cousin, listen to your nephew. Waraqah said: O nephew, what do you see? So the Prophet, may God’s prayers and peace be upon him, told him what had happened in the Cave of Hira. When Waraqah heard him, he said: This is the law that was revealed to Moses. Then Waraqa told him that he wished to live until he supported him, and to be with him when his people fought him and expelled him from Mecca. When the Messenger, may God’s prayers and peace be upon him, heard that, he was amazed and asked Waraqa, saying: Or are those who brought me out? He said to him: Yes, no one has brought anything like what you have brought except that it was repeated, and since that day the Messenger, may God bless him and grant him peace, has been increasingly longing for the revelation from heaven, which was delayed in descending upon him after this time. The return of revelation:\nAfter a while, while the Prophet, may God’s prayers and peace be upon him, was walking, he heard a voice. He raised his face to the sky and saw the king who had come to him in the cave of Hira sitting on a chair between heaven and earth. The Prophet, may God’s prayers and peace be upon him, trembled from the horror of the sight. He hurried to the house and asked his wife to cover him, saying: Cover me. They covered me, and suddenly Gabriel came down to him with these verses that God directed to him: {O, O Muddathir! Arise and warn. And your Lord, so grow up. And your clothes are pure. And if you are angry, abandon it.} _[Al-Muddaththir: 1-5] And in these verses there is a mandate from God Almighty to His Messenger, may God bless him and grant him peace, to call upon the people.\nCalling to Islam secretly:\nPeople in Mecca have been worshiping idols for a long time, and they inherited their worship from their fathers and grandfathers. So the Messenger, may God’s prayers and peace be upon him, began to call to Islam secretly, and he started with the people closest to him. His wife, Khadija bint Khuwaylid, believed in him, and his cousin Ali bin Abi Talib also believed in him. He was a ten-year-old boy, and the Messenger of God, may God’s prayers and peace be upon him, was the one raising him. His friend Abu Bakr was the first of the men to believe in him, and he had a great status among his people. People would come to him and sit.\nWith him, Abu Bakr took advantage of his position and began inviting those who would come to him and trust him\nHe converted to Islam, and Abdul Rahman bin Awf, Othman bin Affan, Al-Zubair bin Al-Awwam, and Talha bin Ubaidullah converted to Islam at his hands. And others.\nPrayer was not imposed at that time in the way we know it, but the Messenger of God, may God bless him and grant him peace, would lead his companions who had converted to Islam secretly to pray two rak’ahs before sunrise and two rak’ahs before sunset, in a place far from the eyes of the Prophet.\nInfidels.\nOne day, the Messenger, may God bless him and grant him peace, was praying with his companions in a street in Mecca, when Abu Talib, the uncle of the Prophet, may God bless him and grant him peace, who did not believe in his message, came to them. When he saw the Messenger, may God bless him and grant him peace, and his companions praying, he asked him about this new religion. So the Messenger, may God bless him and grant him peace, told him about it because he trusted his uncle and hoped that he would convert to Islam, but Abu Talib refused to leave the religion of his fathers and grandfathers and reassured the Prophet, may God bless him and grant him peace, and pledged to protect him from his enemies. He advised his son Ali to adhere to the Messenger of God, may God bless him and grant him peace, and the Messenger, may God bless him and grant him peace, continued to call his people secretly, and the number of Muslims increased day after day, and the faith in their hearts strengthened in what God revealed to them of the Holy Qur’an, and they remained like this for three days. years."
  },
  {
    "number": "مرحلة الدعوة الجهرية",
    "text": "",
    "label": "مر الله سبحانه رسوله صلى الله عليه وسلم أن يجهر بالدعوة ويبدأ بعشيرته وأهله، فقال تعالى: {وأنذر عشيرتك الأقربين} _[الشعراء:214] فنادى الرسول صلى الله عليه وسلم قريشًا، وقال: (يا بني كعب أنقذوا أنفسكم من النار، يا بني عبد شمس أنقذوا أنفسكم من النار، يا بني عبد مناف أنقذوا أنفسكم من النار، يا بني هاشم وبني عبد المطلب أنقذوا أنفسكم من النار، يا فاطمة أنقذي نفسك من النار، فإني والله لا أملك لكم من الله شيئًا إلا أن لكم رحمًا سأَبُلُّهَا بِبِلالِهَا (سَأصِلُها) ) _[مسلم].\nونزل هذا الكلام على قلوب الكفار نزول الصاعقة، فقد أصبحت المواجهة واضحة بينهم وبين رسول الله صلى الله عليه وسلم، إنه يطلب منهم أن يتركوا الأصنام التي يعبدونها، وأن يتركوا الفواحش، فلا يتعاملون بالربا، ولا يزنون، ولا يقتلون أولادهم، ولا يظلمون أحدًا، لكنهم قابلوا تلك الدعوة بالرفض، وبدءوا يسخرون من النبي صلى الله عليه وسلم، ومن دعوته، فصبر صلى الله عليه وسلم عليهم وعلى تطاولهم.\nوذات مرة، كان النبي صلى الله عليه وسلم يطوف بالبيت، فتطاول عليه بعض الكفار بالكلام، ولكنه صبر عليهم ومضى، فلما مرَّ عليهم ثانية تطاولوا عليه بمثل ما فعلوا، فصبر ولم يرد، ثم مرَّ بهم الثالثة، فتطاولوا عليه بمثل ما فعلوا أيضًا، فقال صلى الله عليه وسلم لهم: (أتسمعون يا معشر قريش؟ أما والذي نفسي بيده، لقد جئتكم بالذبح) فخاف القوم حتى إن أكثرهم وقاحة أصبح يقول للرسول\nصلى الله عليه وسلم بكل أدب: انصرف يا أبا القاسم، انصرف راشدًا، فوالله ما كنت جهولا.\nوذات يوم، أقبل رجل من بلد اسمها (إراش) إلى مكة، فظلمه أبو جهل، وأخذ منه إبله، فذهب الرجل إلى نادي قريش يسألهم عن رجل ينصره على\nأبي جهل، وهنا وجد الكفار فرصة للتسلية والضحك والسخرية من رسول الله صلى الله عليه وسلم، فأمروا الرجل أن يذهب إلى الرسول صلى الله عليه وسلم ليأخذ له حقه، فذهب الرجل إلى رسول الله صلى الله عليه وسلم، وأخذوا ينظرون إليه ليروا ما سيحدث، فقام النبي صلى الله عليه وسلم مع الرجل ليعيد له حقه من أبي جهل، فأرسلوا وراءه أحدهم؛ ليرى ما سوف يصنعه أبوجهل مع رسول الله صلى الله عليه وسلم، فذهب الرسول صلى الله عليه وسلم إلى بيت أبي جهل، وطرق بابه، فخرج أبو جهل من البيت خائفًا مرتعدًا، وقد تغير لونه من شدة الخوف، فقال له رسول الله صلى الله عليه وسلم: (أعطِ هذا الرجل حقه) فرد أبو جهل دون تردد: لا تبرح حتى أعطيه الذي له، ودخل البيت مسرعًا، فأخرج مال الرجل، فأخذه، وانصرف.\nوعندما أقبل أبو جهل على قومه بادروه قائلين: ويلك! ما بك؟ فقال لهم: والله ما هو إلا أن ضرب عليَّ وسمعت صوته فملئت منه رعبًا، ثم خرجت إليه، وإن فوق رأسه لفحلا من الإبل ما رأيتُ مثلَه قط، فوالله لو أبَيتُ لأكلني. [البيهقي]\nوبدأ كفار قريش مرحلة جديدة من المفاوضات، فذهبوا إلى أبي طالب عم النبي صلى الله عليه وسلم، وقالوا له: يا أبا طالب، إن ابن أخيك قد سبَّ\nآلهتنا، وعاب ديننا، وسفه أحلامنا، وضلل آباءنا، فإما أن تكفه عنا، وإما أن تخلى بيننا وبينه، فردَّ عليهم أبو طالب ردًّا رقيقًا، فانصرفوا عنه.\nولكن رسول الله صلى الله عليه وسلم استمر في إظهار دين الله ودعوة الناس إليه، فجمع الكفار أنفسهم مرة أخرى وذهبوا إلى أبي طالب، فقالوا له: يا أبا طالب، إن لك سنًّا وشرفًا ومنزلة فينا، وإنا قد استنهيناك من ابن أخيك فلم تنهه عنا، وإنا والله لا نصبر على هذا من شتم آبائنا، وتسفيه أحلامنا، وعيب\nآلهتنا، حتى تكفه عنا، أو ننازله وإياك في ذلك حتى يهلك أحد الفريقين.\nوأرسل أبو طالب إلى النبي صلى الله عليه وسلم، فلما جاء قال له: يابن أخي! إن قومك قد جاءوني، وقالوا كذا وكذا فأَبقِ علىَّ وعلى نفسك، ولا تُحملني من الأمر ما لا أطيق أنا ولا أنت، فاكفف عن قومك ما يكرهون من قولك، فقال النبي صلى الله عليه وسلم لعمه: (والله يا عم لو وضعوا الشمس في يميني والقمر في يساري، ما تركت هذا الأمر حتى يظهره الله أو أهلك فيه) فقال أبو طالب: امضِ على أمرك وافعل ما أحببت، فوالله! لا أسلمك لشيء أبدًا.\nلم يستطع المشركون أن يوقفوا مسيرة الدعوة للإسلام، ولم يستطيعوا إغراء الرسول صلى الله عليه وسلم بالمال أو بالجاه، وقد خاب أملهم في عمه\nأبي طالب، وها هو ذا موسم الحج يقبل، والعرب سوف يأتون من كل\nمكان، وقد سمعوا بمحمد ودعوته، وسوف يستمعون إليه وربما آمنوا به\nونصروه، فتسرب الخوف إلى قلوب الكفار في مكة، وفكروا في قول واحد يتفقون عليه ويقولونه عن محمد صلى الله عليه وسلم حتى يصرفوا العرب\nعنه، فالتفوا حول الوليد بن المغيرة، وكان أكبرهم سنًّا؛ فقال أحدهم: نقول إن محمدًا كاهن، فقال الوليد: والله ما هو بكاهن، لقد رأينا الكهان فما هو بزمزمة الكاهن ولا سجعه، فقالوا: نقول إن محمدًا مجنون، فقال لهم: ما هو بمجنون لقد رأينا الجنون وعرفناه، فقالوا: نقول إن محمدًا شاعر، فقال لهم: ما هو بشاعر لقد عرفنا الشعر كله فما هو بالشعر، فقالوا: نقول ساحر، فقال لهم: ما هو\nبساحر، لقد رأينا السحرة وسحرهم وما هو منهم.\nفقالوا للوليد بن المغيرة: فما تقول يا أبا عبد شمس؟ فأقسم لهم أن كلام محمد هو أحلى الكلام وأطيبه، وما هم بقائلين من هذا شيئًا إلا عُرف أنه باطل، وإن أقرب القول فيه أن تقولوا: إن محمدًا ساحر يفرق بين المرء وأخيه وبين الرجل وزوجته والرجل وأبيه، فوافق الكفار على رأيه وانتشروا في موسم الحج يرددون هذه الافتراءات بين الناس، حتى يصدوهم عن دعوة رسول الله صلى الله عليه وسلم، فأنزل الله تعالى في الوليد بن المغيرة قوله: {ذرني ومن خلقت\nوحيدًا . وجعلت له مالاً ممدودًا . وبنين شهودًا . ومهدت له تمهيدًا . ثم يطمع أن أزيد . كلا إنه كان لآياتنا عنيدًا . سأرهقه صعودًا . إنه فكر وقدر . فقتل كيف قدر . ثم قتل كيف قدر . ثم نظر . ثم عبس وبسر . ثم أدبر\nواستكبر . فقال إن هذا إلا سحر يؤثر . إن هذا إلا قول البشر . سأصليه\nسقر . وما أدراك ما سقر . لا تبقي ولا تذر . لواحة للبشر . عليها تسعة عشر} _[المدثر:11-30].\nإسلام عمر بن الخطاب:\nدعا الرسول صلى الله عليه وسلم الله أن يعز الإسلام بأحد العمرين: عمر بن الخطاب، أو عمرو بن هشام، وكان عمر بن الخطاب قبل أن يسلم شديد الإيذاء للمسلمين، وذات يوم حمل عمر سيفه، وانطلق يبحث عن محمد ليقتله، وفي الطريق قابله رجل، وأخبره أن أخته فاطمة قد أسلمت هي وزوجها سعيد بن زيد، فاتجه عمر غاضبًا نحو دار أخته، ودق الباب، وكان الصحابي خباب بن الأَرَتِّ -رضي الله عنه- يعلِّم أخت عمر وزوجها القرآن الكريم، فلما سمعوا صوت عمر امتلأت قلوبهم بالرعب والخوف، وأسرع خباب فاختبأ في زاوية من البيت، ودخل عمر فقال: لقد أُخبرت أنكما تبعتما محمدًا على دينه، ثم ضرب زوج أخته، وضرب أخته على وجهها حتى سال الدم من وجهها، ولكنها لم تخف، وقالت له في ثبات وشجاعة: نعم أسلمنا وآمنا بالله ورسوله، فاصنع ما شئت.\nندم عمر على ما صنع بأخته، وطلب منها الصحيفة التي كانوا يقرءون\nمنها، فقالت له: يا أخي إنك نجس وإنه لا يمسه إلا المطهرون، فقام عمر فاغتسل، فأعطته الصحيفة، فقرأ عمر: بسم الله الرحمن الرحيم {طه . ما أنزلنا عليك القرآن لتشقى . إلا تذكرة لمن يخشى . تنزيلاً ممن خلق الأرض والسموات العلى . الرحمن على العرش استوى . له ما في السموات وما في الأرض وما بينهما وما تحت الثرى . وإن تجهر بالقول فإنه يعلم السر\nوأخفى . الله لا إله إلا هو له الأسماء الحسنى} _[طه:1-8].\nوكانت هذه الآيات نورًا جذب عمر إلى الإسلام وأضاء له طريق الحق، فما إن قرأها حتى لان قلبه، وهدأ طبعه، وذهب عنه الغضب، وقال -والإيمان يفيض في جوانحه-: ما أحسن هذا الكلام وما أكرمه، ثم ذهب إلى النبي صلى الله عليه وسلم وأعلن إسلامه، وبعد قليل من إسلام عمر بن الخطاب -رضي الله\nعنه- سار رسول الله صلى الله عليه وسلم إلى الكعبة في وضح النهار بين عمر بن الخطاب وحمزة بن عبدالمطلب -رضي الله عنهما- وامتنع أصحاب رسول الله صلى الله عليه وسلم بهما، وكان المسلمون لا يقدرون أن يُصَلُّوا عند الكعبة حتى أسلم عمر بن الخطاب، فلما أسلم هو وحمزة بن عبدالمطلب صلى المسلمون عند الكعبة.                      ",
    "number-en": "The stage of public invitation",
    "label-en": "God Almighty commanded His Messenger, may God’s prayers and peace be upon him, to speak out loudly with the call and begin with his clan and his family, and God Almighty said: {And warn your closest clan}_[Al-Shu’ara’: 214] So the Messenger, may God’s prayers and peace be upon him, called out to the Quraysh and said: (O Banu Ka’b, save yourselves from the Fire, O Banu Abd Shams, save yourselves from the Fire, O Banu Abd Manaf, save yourselves from the Fire, O Banu Hashim). And the children of Abdul Muttalib, save yourselves from the Fire. O Fatima, save yourself from the Fire, for by God, I do not possess anything for you from God except that you have a womb that I will moisten with my wetness (I will moisten it))_[Muslim]. These words fell on the hearts of the infidels like a thunderbolt. The confrontation became clear between them and the Messenger of God, may God bless him and grant him peace. He asked them to abandon the idols they worship, and to abandon immoral acts, not to deal in usury, not to commit adultery, not to kill their children, and not to oppress anyone. But they rejected that call, and they began to mock the Prophet, may God bless him and grant him peace, and his call, so he, may God bless him and grant him peace, was patient with them and their arrogance. One time, the Prophet, may God’s prayers and peace be upon him, was circumambulating the House, and some infidels verbally attacked him, but he was patient with them and went on. When he passed by them a second time, they attacked him in the same way they did, so he was patient and did not respond. Then he passed by them a third time, and they attacked him in the same way they did as well, so he, may God’s prayers and peace be upon him, said to them: (Do you hear, O people of Quraysh? By the One in whose hand is my soul, I have brought you slaughter.) The people were so frightened that the most impudent of them began to say to the Messenger.\nMay God’s prayers and peace be upon him, with all politeness: Go away, O Abu al-Qasim. Go away wisely, for by God, you are not ignorant. One day, a man from a country called (Irash) came to Mecca, and Abu Jahl wronged him and took his camels from him. So the man went to the Quraysh club to ask them about a man who would support him.\nAbu Jahl, and here the infidels found an opportunity to have fun, laugh, and make fun of the Messenger of God, may God bless him and grant him peace, so they ordered the man to go to the Messenger, may God bless him and grant him peace, to obtain his rights. So the man went to the Messenger of God, may God bless him and grant him peace, and they began to look at him to see what would happen, so the Prophet, may God bless him and grant him peace, stood up with the man to return his rights to him from Abu Jahl. So they sent someone after him. To see what Abu Jahl would do with the Messenger of God, may God bless him and grant him peace, so the Messenger, may God bless him and grant him peace, went to Abu Jahl’s house and knocked on his door. Abu Jahl left the house frightened and trembling, and his color had changed from intense fear. The Messenger of God, may God bless him and grant him peace, said to him: (Give this man his due). Abu Jahl replied without hesitation: Don’t leave until I give him what is his. He entered the house quickly, took out the man’s money, took it, and left. When Abu Jahl approached his people, they rushed to him and said: Woe to you! What is with you? He said to them: By God, he only attacked me, and I heard his voice, so I was filled with terror. Then I went out to him, and above his head was a stallion of camels, the likes of which I had never seen. By God, if I refused, he would have eaten me. [Al-Bayhaqi]\nThe infidels of Quraish began a new phase of negotiations. They went to Abu Talib, the uncle of the Prophet, may God bless him and grant him peace, and said to him: O Abu Talib, your nephew has insulted you.\nOur gods, he insulted our religion, he made foolish of our dreams, and he misled our fathers. Either you stop him from us, or you leave us alone with him. Abu Talib responded to them with a gentle response, so they turned away from him. But the Messenger of God, may God bless him and grant him peace, continued to show the religion of God and call people to it, so the infidels gathered themselves again and went to Abu Talib, and they said to him: O Abu Talib, you have age, honor, and status among us, and we have prohibited you from your nephew, but you did not prohibit him from us, and by God we cannot be patient with this of cursing our fathers, making our dreams foolish, and disgraceful.\nOur gods, until you spare him from us, or we will contest with him and you in this matter until one of the two parties perishes. Abu Talib sent to the Prophet, may God bless him and grant him peace, and when he came, he said to him: O my nephew! Your people have come to me and said such-and-such, so spare me and yourself, and do not burden me with a matter that neither you nor I can bear, so restrain your people from saying what they hate. Then the Prophet, may God’s prayers and peace be upon him, said to his uncle: (By God, uncle, if they put the sun in my right hand and the moon in my left, I would not leave this matter until God makes it victorious or I perish in it.) So Abu Talib said: Go ahead and do what you like, by God! I will never hand you over to anything. The polytheists were unable to stop the process of calling to Islam, nor were they able to tempt the Messenger, may God bless him and grant him peace, with money or prestige, and their hope in his uncle was disappointed.\nAbu Talib, and here the Hajj season is approaching, and Arabs will come from all over the world\nA place, and they had heard of Muhammad and his call, and they would listen to him and perhaps believe in him\nThey supported him, so fear seeped into the hearts of the infidels in Mecca, and they thought of one saying that they would agree on and say about Muhammad, may God bless him and grant him peace, so that they would turn away the Arabs.\nAbout him, they gathered around Al-Walid bin Al-Mughirah, who was the eldest of them. One of them said: We say that Muhammad is a priest. Al-Walid said: By God, he is not a soothsayer. We have seen soothsayers, but he does not have the squeak or rhyme of a soothsayer. They said: We say that Muhammad is crazy. He said to them: He is not crazy. We have seen madness and we know it. They said: We say that Muhammad is a poet. He said to them: He is not a poet. We have known all poetry, so what is poetry? They said: We say a magician. So he said to them: What is he?\nWith a magician, we have seen magicians and their magic and what is of them. They said to Al-Walid bin Al-Mughirah: What do you say, Abu Abd Shams? So he swore to them that the words of Muhammad are the sweetest and kindest words, and they did not say anything of this except that it was known that it was false, and the closest thing to saying about it is for you to say: Muhammad is a magician who separates between a man and his brother and between a man and his wife and a man and his father. So the infidels agreed with his opinion and spread out during the Hajj season repeating these slanders among the people, so as to deter them from the call of the Messenger of God, may God bless him and grant him peace, so God Almighty revealed regarding Al-Walid ibn Al-Mughirah his saying: {Leave me and those who I created\nAlone. And I made for him an extended property. And sons are witnesses. And I made preparations for him. Then he hopes for more. No, he was stubborn towards Our signs. I will wear him down. It is thought and destiny. So he was killed as he could. Then he was killed as he could. Then he looked. Then he frowned and smiled. Then manage\nAnd he was arrogant. He said: This is nothing but magic that has an effect. This is nothing but what humans say. I will pray it\nSaqr. How do you know what has settled? Do not keep or leave. An oasis for humans. On it are nineteen} _[Al-Muddaththir: 11-30].\nOmar bin Al-Khattab’s conversion to Islam:\nThe Messenger, may God’s prayers and peace be upon him, called on God to strengthen Islam through one of the two ages: Omar ibn al-Khattab, or Amr ibn Hisham. Before he converted to Islam, Omar ibn al-Khattab was very abusive to Muslims. One day, Omar took up his sword and went looking for Muhammad to kill him. On the way, a man met him and told him that his sister Fatima had converted to Islam with her husband Saeed ibn Zaid. So Omar went angrily towards his sister’s house and knocked on the door, and the companion Khabab ibn al-Art - may God be pleased with him - was there. About him - he teaches Omar’s sister and her husband the Holy Qur’an. When they heard Omar's voice, their hearts were filled with terror and fear, and Khabbab hurried and hid in a corner of the house, and Omar entered and said: I was told that you followed Muhammad in his religion. Then he beat his sister's husband, and he beat his sister in the face until blood flowed from her face, but she was not afraid, and she said to him with steadfastness and courage: Yes, we converted to Islam and believed in God and His Messenger, so do whatever you want.\nOmar regretted what he had done to his sister, and asked her for the newspaper they were reading\nFrom it, she said to him: O brother, you are impure and only the cleansed can touch it. So Omar got up and took a bath, so she gave him the newspaper, and Omar recited: In the name of God, the Most Gracious, the Most Merciful {Taha. We did not send down the Qur’an to you so that you should be miserable. Only a reminder for those who fear. A revelation from Him who created the earth and the highest heavens. The Most Gracious is stationed above the Throne. To Him belongs whatever is in the heavens and whatever is on the earth and what is between them and what is under the earth. If you speak loudly, he knows the secret\nAnd he hid. Allah, there is no god but Him. To Him belongs the best names} _[Taha: 1-8]. These verses were a light that attracted Omar to Islam and illuminated for him the path of truth. As soon as he read them, his heart softened, his nature calmed down, and his anger went away. He said - with faith overflowing within him -: How good and honorable these words are. Then he went to the Prophet, may God bless him and grant him peace, and announced his conversion to Islam, and after a short while, Omar bin Al-Khattab - may God be pleased with him - converted to Islam.\nOn his authority - The Messenger of God, may God’s prayers and peace be upon him, walked to the Kaaba in broad daylight between Omar bin Al-Khattab and Hamza bin Abdul Muttalib - may God be pleased with them - but the companions of the Messenger of God, may God’s prayers and peace be upon him, refrained from taking them. The Muslims were unable to pray at the Kaaba until Omar bin Al-Khattab converted to Islam. When he and Hamza bin Abdul Muttalib converted to Islam, the Muslims prayed at the Kaaba."
  },
  {
    "number": "الهجرة الى الحبشة",
    "text": "",
    "label": "أصبحت مكة سجنًا كبيرًا يعذب فيه ضعفاء المسلمين، فهذا أمية بن خلف يُخرج عبده بلال بن رباح -رضي الله عنه- في حر الظهيرة ويطرحه على ظهره عريانًا فوق الرمال المحرقة، ويضع على صدره صخرة كبيرة، كل هذا العذاب لأن بلالا أسلم وسيده يريد منه أن يكفر بمحمد ويعبد الأصنام، لكن بلالا كان قوي الإيمان صلب العقيدة، لم يلن ولم يستسلم، وكان يردد قائلا: أحد .. أحد. وتحمل كل هذا العذاب حتى فَرَّجَ الله عنه.\nوعُذِّبَ المسلمون داخل بيوتهم؛ فهذا مصعب بن عمير قد حبسته أمه، ومنعت عنه الطعام، وجمعت أخواله حتى يعذبوه ليترك الإسلام، وهكذا أصبحت مكة مكانًا غير مأمون على المسلمين، فتعذيب الكفار لهم يزداد يومًا بعد يوم، ففكر النبي صلى الله عليه وسلم في مكان يطمئن فيه على أصحابه، فوقع اختياره على الحبشة، فأمر أصحابه ممن يطيقون الهجرة بالتوجه إليها، لأن فيها ملكًا لا يُظلم عنده أحد، وخرج بعض المسلمين المهاجرين إلى هناك سرًّا، وكان من بينهم عثمان بن عفان وزوجته رقية بنت النبي صلى الله عليه وسلم، وجعفر بن أبي طالب وزوجته أسماء بنت عميس، وعبدالله بن مسعود -رضي الله عنهم- وغيرهم.\nولما علم أهل قريش بذلك اشتد غيظهم ورفضوا أن يتركوا المسلمين المهاجرين إلى الحبشة وشأنهم، بل صمموا على إرجاعهم إلى مكة، فاختاروا من بينهم رجلين معروفين بالذكاء، وهما: عمرو بن العاص وعبدالله بن أبي بلتعة وأرسلوهما بهدايا إلى ملك الحبشة، فدخل عمرو بن العاص على النجاشي، وقال له: أيها الملك، إنه ضَوَى (جاء) إلى بلدك منا سفهاء، فارقوا دين قومهم، ولم يدخلوا في دينكم، وجاءوا بدين مبتدع، لا نعرفه نحن ولا أنتم، وقد بعثنا إلى الملك فيهم آباؤهم وأعمامهم وعشائرهم؛ لتردهم إليهم، فهم أعلى بهم عينًا وأعلم بما عابوا عليهم، فرفض النجاشي أن يسلِّم المسلمين لهم، حتى يبعث إليهم ويتأكد من صحة كلام عمرو وصاحبه.\nفأرسل النجاشي في طلب المسلمين المهاجرين إلى بلاده فجاءوا إليه، وأنابوا جعفر بن أبي طالب -رضي الله عنه- حتى يتحدث باسمهم، فسأله النجاشي: ما هذا الدين الذي قد فارقتم به قومكم، ولم تدخلوا في ديني، ولا في دين أحد من هذه الملل؟ فَرَدَّ عليه جعفر قائلا: أيها الملك، كنا قومًا أهل جاهلية، نعبد الأصنام، ونأكل الميتة، ونأتي الفواحش، ونقطع الأرحام، ونسيء الجوار، ويأكل القوي منا الضعيف، فكنا على ذلك حتى بعث الله إلينا رسولا منا، نعرف\nنسبه، وصدقه، وأمانته، وعفافه، فدعانا إلى الله لنوحده ونعبده، ونخلع ما كنا نعبد نحن وآباؤنا من دونه من الحجارة والأوثان، وأمرنا بصدق الحديث، وأداء الأمانة، وصلة الرحم، وحسن الجوار، والكف عن المحارم والدماء، ونهانا عن الفواحش، وقول الزور، وأكل مال اليتيم، وقذف المحصنات.\nوأمرنا أن نعبد الله وحده ولا نشرك به شيئًا، وأمرنا بالصلاة والزكاة والصيام فصدَّقناه وآمنا به، واتبعناه على ما جاء به من الله، فعبدنا الله وحده فلم نشرك به شيئًا، وحرمنا ما حرم علينا، وأحللنا ما أحل لنا، فعدا علينا قومُنا فعذبونا وفتنونا عن ديننا، ليردونا إلى عبادة الأوثان عن عبادة الله -تعالى- وأن نستحل ما كنا نستحل من الخبائث، فلما قهرونا وظلمونا وضيَّقوا علينا، وحالوا بيننا وبين ديننا، خرجنا إلى بلادك، واخترناك على من سواك، ورغبنا في جوارك، ورجونا أن لا نُظلَم عندك أيها الملك، فقال له النجاشي: هل معك مما جاء به الله من شيء؟ قال جعفر: نعم. فقال النجاشي: اقرأه عليَّ.\nفقرأ عليه جعفر أول سورة مريم، فبكى النجاشي، ثم قال: إن هذا والذي جاء به عيسى ليخرج من مشكاة واحدة، ثم قال لعمرو وصاحبه: انطلقا، فلا والله لا أسلمهم إليكما، وردَّ النجاشي الهدايا إلى عمرو ولم يسلم المسلمين إليه، وهكذا فشل المشركون في الإيقاع بين المسلمين وملك الحبشة.                      ",
    "number-en": "Migration to Abyssinia",
    "label-en": "Mecca became a large prison in which weak Muslims were tortured. This is Umayyah ibn Khalaf, who took out his servant Bilal ibn Rabah - may God be pleased with him - in the heat of the afternoon and threw him on his back naked on the burning sand, and placed a large rock on his chest. All this torture was because Bilal had converted to Islam and his master wanted him to disbelieve in Muhammad and worship idols, but Bilal was strong in faith and firm in his belief. He did not relent or surrender, and he would repeat, saying: One... one. He endured all this torment until God relieved him.\nMuslims were tortured inside their homes. This is Musab bin Umair. His mother imprisoned him, prevented him from eating, and gathered his maternal uncles to torture him so that he would leave Islam. Thus, Mecca became an unsafe place for the Muslims, as the torture of the infidels increased day after day. So the Prophet, may God bless him and grant him peace, thought of a place where he could reassure himself of his companions, so his choice fell on Abyssinia, so he ordered his companions who could bear to emigrate to go there, because there was a king under whom no one would be oppressed, and some of the Muslim immigrants went out there secretly, and among them was Uthman. Bin Affan and his wife Ruqayyah, daughter of the Prophet, may God bless him and grant him peace, Jaafar bin Abi Talib and his wife Asma bint Umays, Abdullah bin Masoud - may God be pleased with them - and others.\nWhen the people of Quraish learned of this, their anger intensified and they refused to leave the Muslims who had migrated to Abyssinia alone. Rather, they were determined to return them to Mecca, so they chose from among them two men known for their intelligence, namely: Amr ibn al-Aas and Abdullah ibn Abi Balta’a, and they sent them with gifts to the king of Abyssinia. Amr ibn al-Aas entered upon the Negus and said to him: O king, some fools have come to your country. They departed from the religion of their people, and did not enter into your religion, and they came with an innovated religion, which neither we nor you know, and we sent to the king among them their fathers, uncles, and clans. To return them to them, as they were more knowledgeable than them and more knowledgeable about what they criticized, so Al-Najashi refused to hand over the Muslims to them, until he sent to them and verified the veracity of the words of Amr and his companion.\nSo Al-Najashi sent for the Muslim immigrants to his country, and they came to him, and they appointed Jaafar bin Abi Talib - may God be pleased with him - to speak on their behalf, so Al-Najashi asked him: What is this religion that you have left your people with, and you have not entered into my religion, nor into the religion of any of these sects? Jaafar replied to him, saying: O king, we were a people of pre-Islamic times. We worshiped idols, ate dead meat, committed immoral acts, cut ties of kinship, treated bad neighbors, and the strong among us ate the weak. So we were like that until God sent to us a messenger from among us, whom we know.\nHis lineage, honesty, honesty, and chastity, so he called us to God to unite him and worship him, and to put off the stones and idols that we and our fathers used to worship besides him. He commanded us to speak truthfully, fulfill trusts, maintain family ties, be good neighbors, and abstain from forbidden things and bloodshed. He forbade us from immoral acts, false speech, consuming an orphan’s wealth, and slandering chaste women.\nHe commanded us to worship God alone and not to associate anything with Him, and He commanded us to pray, to pay zakat, and to fast, so we believed in him and believed in him, and we followed him in what he brought from God. So we worshiped God alone and did not associate anything with Him, and we forbade what was forbidden to us, and we made lawful what was lawful for us, so our people attacked us and tortured us and tempted us from our religion, to return us to the worship of idols rather than the worship of God - the Most High - and to make lawful what we had made lawful of the evil things. When they oppressed us, oppressed us, put pressure on us, and prevented us from our religion, we went out to your country, and we chose you over everyone else, and we desired your side, and we hoped that we would not be oppressed by you, O king. Then the Negus said to him: Do you have anything of what God has brought? Jaafar said: Yes. The Negus said: Read it to me.\nSo Ja'far recited to him the first of Surah Maryam, and the Negus cried, then he said: This and what Jesus brought came out of a single niche. Then he said to Amr and his companion: Go, no, by God, I will not hand them over to you. The Negus returned the gifts to Amr and did not hand over the Muslims to him, and thus the polytheists failed to create a trap between the Muslims and the king of Abyssinia."
  },
  {
    "number": "المقاطعة",
    "text": "",
    "label": "ازداد عدد المسلمين، وانضم إليهم عدد من أصحاب القوة والسيطرة، فأصبح من الصعب على المشركين تعذيبهم، ففكروا في تعذيب من نوع آخر، يشمل كل المسلمين قويهم وضعيفهم، بل يشمل كل من يحمي النبي صلى الله عليه وسلم والمسلمين حتى ولو لم يدخل في الإسلام، فقرر المشركون أن يقاطعوا بني هاشم ومن معهم، فلا يزوجونهم ولا يتزوجون منهم، ولا يبيعون لهم ولا يشترون منهم، ولا يكلمونهم، ولا يدخلون بيوتهم، وأن يستمروا هكذا حتى يُسلِّموا إليهم محمدًا ليقتلوه أو يتركوا دينهم، وأقسم المشركون على هذا العهد، وكتبوه في صحيفة وعلقوها داخل الكعبة.\nوأحكم المشركون الحصار، فاضطر الرسول صلى الله عليه وسلم ومن معه إلى الاحتباس في شعب بني هاشم، وكان رجال قريش ينتظرون التجار القادمين إلى مكة ليشتروا منهم الطعام ويمنعوا المسلمين من شرائه، فيظلوا على جوعهم، فهذا أبو لهب يقول لتجار قريش عندما يرى مسلمًا يشترى طعامًا لأولاده: يا معشر التجار، غالوا على أصحاب محمد؛ حتى لا يدركوا معكم شيئًا، فيزيدون عليهم في السلعة، حتى يرجع المسلم إلى أطفاله، وهم يتألمون من الجوع، وليس في يديه شيء يطعمهم به.\nويذهب التجار إلى أبي لهب فيربحهم فيما اشتروا من الطعام واللباس، حتى تعب المؤمنون ومن معهم من الجوع والعرى، واستمر هذا الحصار على بني هاشم والمسلمين مدة ثلاث سنوات، ولكن المسلمين أثبتوا أنهم أقوى من كل حيل المشركين، فإيمانهم راسخ في قلوبهم لا يزحزحه جوع ولا عطش، حتى وإن اضطروا إلى أكل أوراق الشجر، فلم ييأسوا، ولم ينفضُّوا من حول نبيهم صلى الله عليه وسلم.\nوشعر بعض المشركين بسوء ما يفعلونه، فقرروا إنهاء هذه المقاطعة الظالمة وأرسل الله تعالى الأرضة (دودة أو حشرة صغيرة تشبه النملة) فأكلت صحيفتهم، ولم تُبْقِ إلا اسم الله تعالى، وأوحى الله إلى نبيه بذلك، فأخبر النبي صلى الله عليه وسلم عمه أبا طالب بما حدث للصحيفة، فذهب أبو طالب إلى الكفار وأخبرهم بما أخبره محمد صلى الله عليه وسلم به، فأسرعوا إلى الصحيفة، فوجدوا ما قاله أبو طالب صدقًا، وتقدم من المشركين هشام بن عمرو، وزهير بن أبي أمية والمطعم بن عدى، وأبو البختري بن هشام، وزمعة بن الأسود، فتبرءوا من هذه المعاهدة، وبذلك انتهت المقاطعة بعد ثلاث سنوات من الصبر، والثبات\nوالتحمل.  ",
    "number-en": "Boycott",
    "label-en": "The number of Muslims increased, and a number of those with power and control joined them, so it became difficult for the polytheists to torture them, so they thought of another kind of torture, which would include all Muslims, strong and weak, but would include everyone who protects the Prophet, may God bless him and grant him peace, and the Muslims, even if he did not convert to Islam. So the polytheists decided to boycott Bani Hashim and those with them, so that they would not marry them or marry them, nor sell to them, nor buy from them, nor speak to them, nor enter their homes, and to continue like this until They would hand over Muhammad to them so that they would kill him or leave their religion. The polytheists swore an oath to this covenant, wrote it on a newspaper and hung it inside the Kaaba.\nThe polytheists tightened the siege, so the Messenger, may God bless him and grant him peace, and those with him were forced to be detained in the people of Bani Hashim. The men of Quraish were waiting for the merchants coming to Mecca to buy food from them and prevent the Muslims from buying it, so they remained hungry. This is Abu Lahab saying to the merchants of Quraish when he saw a Muslim buying food for his children: O merchants, you have exaggerated against the companions of Muhammad. So that they do not realize anything with you, so they increase them in goods, until the Muslim returns to his children, and they are suffering from hunger, and he has nothing in his hands to feed them with.\nThe merchants go to Abu Lahab, and he profits them from the food and clothing they bought, until the believers and those with them tired of hunger and nakedness. This siege on Bani Hashem and the Muslims continued for three years, but the Muslims proved that they are stronger than all the tricks of the polytheists, for their faith is firmly rooted in their hearts and cannot be moved by hunger or thirst, even if they were forced to eat tree leaves. They did not despair, nor did they disperse from around their Prophet, may God bless him and grant him peace.\nSome of the polytheists felt bad about what they were doing, so they decided to end this unjust boycott. God Almighty sent the earth (a small worm or insect that resembles an ant), which ate their newspaper, leaving only the name of God Almighty. God revealed this to His Prophet, so the Prophet, may God bless him and grant him peace, informed his uncle Abu Talib of what had happened to the newspaper. Abu Talib went to the infidels and told them what Muhammad, may God bless him and grant him peace, had told him. They hurried to the newspaper, and they found What Abu Talib said was true, and the polytheists Hisham bin Amr, Zuhair bin Abi Umayyah, Al-Mut’im bin Adi, Abu Al-Bakhtari bin Hisham, and Zamaa bin Al-Aswad came forward and disavowed this treaty, and thus the boycott ended after three years of patience and steadfastness.\nAnd endurance."
  },
  {
    "number": "عام الحزن",
    "text": "",
    "label": "في العام العاشر من البعثة كانت الأحزان على موعد مع الرسول صلى الله عليه وسلم، فقد مات عمه أبو طالب الذي كان يحميه من أهل مكة، ثم ماتت زوجته الوفية الصادقة السيدة خديجة -رضي الله عنها- التي كانت تخفف عنه، وتؤيده في دعوته إلى الله -عز وجل- وهي التي آمنت به وساعدته بمالها، ورزقه الله منها الأولاد، فكان رسول الله صلى الله عليه وسلم يحبها ويقدرها، وبشرها الرسول صلى الله عليه وسلم بالجنة -قبل موتها- فقد أتى جبريل -عليه السلام- النبي صلى الله عليه وسلم فقال: (يا رسول الله، هذه خديجة قد أتت معها إناء فيه إدام، أو طعام، أو شراب، فإذا هي أتتك فاقرأ عليها السلام من ربها\nومني، وبشِّرها ببيت في الجنة من قصب (المراد به لؤلؤة مجوفة واسعة كالقصر الكبير) لا صخب فيه ولا نصب) _[البخاري].\nفحزن الرسول صلى الله عليه وسلم حزنًا شديدًا على وفاة زوجته وعمه، وازداد قلقه على الدعوة، فقد فقد نصيرين كبيرين، وصدق ما توقعه الرسول صلى الله عليه وسلم، فقد اشتد تعذيب المشركين له ولأصحابه.\nزواج الرسول صلى الله عليه وسلم من السيدة سودة:\nكانت السيدة سودة بنت زمعة -رضي الله عنها- قد أسلمت في بداية الإسلام وهاجرت إلى الحبشة مع زوجها السكران بن عمرو، ثم عادت إلى مكة، وقد مات زوجها، فتزوجها الرسول صلى الله عليه وسلم إكرامًا لها، ورحمة بها.\nرحلة الرسول صلى الله عليه وسلم إلى الطائف\nلم ييأس الرسول صلى الله عليه وسلم بعد أن أعرض أهل مكة عن قبول الدعوة ولكنه بحث عن مكان آخر لنشر الدين، فأرض الله واسعة، وقد أرسله الله تعالى ليخرج الناس جميعًا من الظلمات إلى النور.\nفسافر رسول الله صلى الله عليه وسلم ومعه خادمه زيد بن حارثة إلى الطائف وكان ذلك بعد مضي عشر سنوات من بعثته، وظل في الطائف عشرة أيام يدعو كبار القوم إلى الإسلام، ولكن الطائف لم تكن أحسن حالا من مكة، فقد رفض أهلها قبول دعوته، ولم يكتفوا بذلك، بل إنهم سَلَّطوا عليه صبيانهم وسفهاءهم فوقفوا صفين على طول طريق الرسول صلى الله عليه وسلم يسبونه، ويقذفونه بالحجارة هو وزيد بن حارثة الذي كان يدافع عن رسول الله صلى الله عليه وسلم بنفسه ويصد الحجارة، حتى جرح في رأسه، وسال الدم من قدم الرسول صلى الله عليه وسلم.\nعندئذ توجه الرسول صلى الله عليه وسلم إلى ربه، ولجأ إليه، ورفع يديه قائلا: (اللهم إليك أشكو ضعف قوتي وقلة حيلتي وهواني على الناس، يا أرحم الراحمين، أنت رب المستضعفين، وأنت ربي، إلى من تكلني، إلى بعيد\nيتجهمني، أم إلى عدو ملكته أمري؟! إن لم يكن بك غضب عليَّ فلا أبالي، غير أن عافيتك هي أوسع لي، أعوذ بنور وجهك الذي أشرقت له الظلمات، وصلح عليه أمر الدنيا والآخرة أن يحل علي غضبك، أو أن ينزل بي سخطك، لك العتبى (التوبة والرجوع والاستغفار) حتى ترضى، ولا حول ولا قوة إلا بك)\n[ابن إسحاق].\nووجد النبي صلى الله عليه وسلم بستانًا لعتبة وشيبة ابني ربيعة فجلس فيه يريح جسده المتعب لبعض الوقت، ورأى عتبة وشيبة رسول الله صلى الله عليه وسلم على هذه الحال، فرق قلبهما له مع أنهما مشركان، فأرسلا غلامهما عداسًا بعنقود من عنب، ليقدمه إلى رسول الله صلى الله عليه وسلم فتناوله قائلا: بسم الله، فتعجب عداس، وقال: إن هذا الكلام لا يقوله أهل هذه البلاد -يعنى لا يقولون بسم الله- فسأله الرسول صلى الله عليه وسلم عن دينه وبلده، فقال عداس: أنا نصراني من أهل نينوى، فقال له رسول الله صلى الله عليه وسلم:\n(من قرية الرجل الصالح يونس بن متى؟) فقال عداس متعجبًا: وما يدريك ما يونس بن متى؟! فقال صلى الله عليه وسلم: (ذلك أخي كان نبيًّا وأنا نبي) فانكبَّ عداس على رسول الله صلى الله عليه وسلم يقبل رأسه ويديه وقدميه المجروحتين.\nوفي طريق عودة رسول الله صلى الله عليه وسلم إلى مكة، شاء الله أن يخفف عنه ما عاناه في الطائف، فعندما وقف يصلي الفجر مر به نفر من الجن، فاستمعوا له، فلما فرغ من صلاته رجعوا إلى قومهم وقد آمنوا بالله وبرسوله صلى الله عليه وسلم ، قال تعالى مخبرًا عن هذا: {قل أوحي إلي أنه استمع نفر من الجن فقالوا إنا سمعنا قرآنًا عجبًا يهدي إلى الرشد فآمنا به ولن نشرك بربنا أحدًا} _\n[الجن: 1-2].                      ",
    "number-en": "A year of sadness",
    "label-en": "In the tenth year of the mission, grief was upon the Messenger, may God bless him and grant him peace. His uncle Abu Talib, who was protecting him from the people of Mecca, died, then his loyal and sincere wife, Mrs. Khadija - may God be pleased with her - died, who had comforted him and supported him in his call to God - the Almighty - and she was the one who believed in him and helped him with her money, and God blessed him with children from her. And peace be upon him in Paradise - before her death - Gabriel - peace be upon him - came to the Prophet, may God bless him and grant him peace, and said: (O Messenger of God, This is Khadija. She brought with her a vessel containing meat, food, or drink. If she comes to you, read peace upon her from her Lord.\nAnd from me, and give her good tidings of a house in Paradise made of reeds (what is meant is a hollow, spacious pearl like a large palace) in which there will be no noise or hardship) - [Al-Bukhari].\nThe Messenger, may God bless him and grant him peace, was deeply saddened by the death of his wife and uncle, and his anxiety about the call increased, as he had lost two great supporters, and what the Messenger, may God bless him and grant him peace, expected came true, as the polytheists’ torture of him and his companions intensified. The marriage of the Messenger, may God bless him and grant him peace, to Mrs. Sawda:\nMrs. Sawda bint Zam’a - may God be pleased with her - had converted to Islam at the beginning of Islam and migrated to Abyssinia with her husband, Al-Sakran bin Amr, then she returned to Mecca, and her husband had died, so the Messenger, may God’s prayers and peace be upon him, married her out of honor and mercy towards her.\nThe journey of the Messenger, may God bless him and grant him peace, to Taif\nThe Messenger, may God bless him and grant him peace, did not despair after the people of Mecca refused to accept the call, but he looked for another place to spread the religion, for God’s land is vast, and God Almighty sent him to bring all people out of darkness into light. So the Messenger of God, may God’s prayers and peace be upon him, traveled with his servant Zaid bin Haritha to Taif, and that was ten years after his mission. He remained in Taif for ten days calling the elders of the people to Islam, but Taif was not in a better condition than Mecca. Its people refused to accept his call, and they were not satisfied with that. Rather, they imposed their children and fools on him, so they stood in two rows along the path of the Messenger, may God bless him and grant him peace, cursing him and throwing stones at him and Zaid. Bin Haritha, who was defending the Messenger of God, may God bless him and grant him peace, by himself and repelling stones, until he was injured in the head. Blood flowed from the feet of the Messenger, may God bless him and grant him peace.\nThen the Messenger, may God bless him and grant him peace, turned to his Lord, turned to Him, and raised his hands, saying: (O God, to You I complain of the weakness of my strength, my lack of resourcefulness, and my humiliation towards people. O Most Merciful of those who show mercy, You are the Lord of the oppressed, and You are my Lord, to whom do you entrust me, even far away?\nHe frowns at me, or at an enemy whose control is mine?! If you are not angry with me, then I do not care. However, your well-being is more important to me. I seek refuge in the light of your face, to which the darkness has shone, and the affairs of this world and the hereafter are right for him, whether your anger befalls me, or your anger befalls me. You are the one to repent (repent, return, and seek forgiveness) until you are satisfied, and there is no power or strength except with you.)\n[Ibn Ishaq].\nThe Prophet, may God’s prayers and peace be upon him, found an orchard for Utbah and Shaybah, the two sons of Rabi’ah, and he sat in it to rest his tired body for a while. He saw Utbah and Shaybah of the Messenger of God, may God’s prayers and peace be upon him, in this state. Their hearts were torn for him, even though they were polytheists, so they sent their boy to fetch a bunch of grapes. To present it to the Messenger of God, may God’s prayers and peace be upon him, he took it and said: In the name of God. Then Addas was amazed and said: These words are not said by the people of this country - meaning they do not say in the name of God - so the Messenger, may God’s prayers and peace be upon him, asked him about his religion and his country, and Addas said: I am a Christian from the people of Nineveh, so the Messenger of God, may God’s prayers and peace be upon him, said to him:\n(From the village of the righteous man Yunus bin Matta?) Addas said in astonishment: How do you know what Yunus bin Matta is?! He, may God’s prayers and peace be upon him, said: (That is my brother. He was a prophet, and I am a prophet.) Then Addas leaned over to the Messenger of God, may God’s prayers and peace be upon him, kissing his wounded head, hands, and feet. On the way back of the Messenger of God, may God bless him and grant him peace, to Mecca, God wanted to alleviate what he had suffered in Taif. When he stood praying the dawn prayer, a group of jinn passed by him and they listened to him. When he finished praying, they returned to their people, and they believed in God and His Messenger, may God bless him and grant him peace. God Almighty said, reporting this: It guides us to maturity, so we believe in Him, and we will not associate anyone with our Lord.}\n[Al-Jinn: 1-2]."
  },
  {
    "number": "الإسراء والمعراج",
    "text": "",
    "label": "وهكذا أعرض أهل مكة عن الإسلام، وخذل أهل الطائف النبي صلى الله عليه وسلم، وازداد إيذاء الكافرين له ولصحابته، وخاصة بعد وفاة السيدة\nخديجة -رضي الله عنها- وعمه أبي طالب، وأراد الله -سبحانه- أن يخفف عن نبيه ، فأكرمه برحلة الإسراء والمعراج؛ فبينما كان الرسول صلى الله عليه وسلم نائمًا بعد العشاء جاءه جبريل، فأيقظه وخرج به حتى انتهيا إلى دابة اسمها (البراق) تشبه البغل، ولها جناحان، فركب الرسول صلى الله عليه وسلم البراق حتى وصل بيت المقدس في فلسطين، وصلى بالأنبياء ركعتين.\nوهذه الرحلة من مكة إلى بيت المقدس تسمى (الإسراء) قال تعالى: {سبحان الذي أسرى بعبده ليلاً من المسجد الحرام إلي المسجد الأقصى الذي باركنا حوله لنريه من آياتنا إنه هو السميع البصير} _[الإسراء: 1].\nثم بدأت الرحلة السماوية من المسجد الأقصى إلى السماوات العلا وتسمى (المعراج) وإذا بأبواب السماء تفتح للنبي صلى الله عليه وسلم، فسلم على الملائكة، وظل يصعد من سماء إلى سماء يرافقه جبريل؛ فرأى الجنة والنار، ورأى من مشاهد الآخرة ما لم يره إنسان حتى وصل إلى سدرة المنتهى، وهو موضع لم يبلغه نبي أو ملك قبله ولا بعده تكريمًا له، قال تعالى: {فكان قاب قوسين أو أدنى . فأوحى إلى عبده ما أوحى} [النجم: 9-10] وفي هذه الليلة، فرض الله الصلوات الخمس على المسلمين، ثم نزل رسول الله صلى الله عليه وسلم إلى بيت المقدس، وركب البراق عائدًا إلى مكة.\nوفي الصباح، حكى رسول الله صلى الله عليه وسلم لقومه ما حدث، فكذبوه وسخروا من كلامه، وأراد الكفار أن يختبروا صدق الرسول صلى الله عليه وسلم، فطلبوا منه أن يصف بيت المقدس -ولم يكن رآه من قبل- فأظهر الله له صورة بيت المقدس، فأخذ يصفه وهو يراه، وهم لا يرونه، وأخبرهم الرسول صلى الله عليه وسلم بأشياء رآها في الطريق، وبقوم مر عليهم وهم في طريقهم إلى مكة، فخرج الناس ينتظرونهم، فجاءوا في موعدهم الذي حدده النبي صلى الله عليه وسلم فشهدوا بصدقه.\nوأسرع بعضهم إلى أبي بكر يقول له في استنكار: أسمعت ما يقول محمد؟ وكان أبو بكر مؤمنًا صادق الإيمان، فصدَّق الرسول صلى الله عليه وسلم في كل ما قاله، فسماه الرسول صلى الله عليه وسلم (الصديق) وهكذا كانت هذه الرحلة تسرية عن النبي صلى الله عليه وسلم، وتخفيفًا للأحزان التي مرَّ بها، وتأكيدًا من الله له على أنه قادر على نصرته، وكانت أيضًا ابتلاء للذين آمنوا حتى يميز الله الطيب من الخبيث.",
    "number-en": "Isra and Mi'raj",
    "label-en": "Thus, the people of Mecca turned away from Islam, and the people of Taif betrayed the Prophet, may God bless him and grant him peace, and the unbelievers’ abuse of him and his companions increased, especially after the death of Mrs.\nKhadija - may God be pleased with her - and his uncle Abu Talib, and God - Glory be to Him - wanted to ease the burden of His Prophet, so he honored him with the journey of Isra and Mi’raj. While the Messenger, may God’s prayers and peace be upon him, was sleeping after dinner, Gabriel came to him, woke him up, and took him out until they came to an animal named (Al-Buraq), which resembled a mule and had two wings. So the Messenger, may God’s prayers and peace be upon him, rode Al-Buraq until he reached Jerusalem in Palestine, and prayed two rak’ahs with the prophets.\nThis journey from Mecca to Jerusalem is called (the Night Journey). God Almighty said: {Glory be to Him who took His servant by night from the Sacred Mosque to the Al-Aqsa Mosque, whose surroundings We have blessed to show him of Our signs. Indeed, He is the Hearer, the All-Seeing} [Al-Isra: 1].\nThen the heavenly journey began from Al-Aqsa Mosque to the highest heavens, and it is called (Al-Miraj), and suddenly the gates of heaven opened for the Prophet, may God bless him and grant him peace, and he greeted the angels, and continued to ascend from heaven to heaven accompanied by Gabriel. He saw Paradise and Hell, and saw scenes of the Hereafter that no human being had seen until he reached Sidra al-Muntaha, a place that no prophet or king had reached before him or after him, in honor of him. God Almighty said: {And it was just around the corner. So He revealed to His servant what He revealed} [An-Najm: 9-10] On this night, God imposed the five daily prayers on Muslims, then the Messenger of God, may God bless him and grant him peace, descended to Jerusalem and rode Al-Buraq back to Mecca.\nIn the morning, the Messenger of God, may God bless him and grant him peace, told his people what had happened, but they lied to him and mocked his words. The infidels wanted to test the sincerity of the Messenger, may God bless him and grant him peace, so they asked him to describe Bayt al-Maqdis - and he had not seen it before. So God showed him a picture of Bayt al-Maqdis, so he began to describe it as he saw it, while they did not see it. The Messenger, may God bless him and grant him peace, told them of things he saw on the road, and of people he passed by on their way to Mecca, so the people left. They were waiting for them, so they came at their appointment set by the Prophet, may God bless him and grant him peace, and they testified to his sincerity.\nSome of them rushed to Abu Bakr and said to him in denunciation: Did you hear what Muhammad said? Abu Bakr was a sincere believer, so he believed the Messenger, may God bless him and grant him peace, in everything he said, so the Messenger, may God bless him and grant him peace, called him (the Truthful). Thus, this journey was a relief for the Prophet, may God bless him and grant him peace, an alleviation of the sorrows he went through, and an assurance from God to him that he was able to support him. It was also a test for those who believed until God distinguished the good from the bad."
  },
  {
    "number": "موسم الحج",
    "text": "",
    "label": "جاء موسم الحج في السنة العاشرة من البعثة، فاجتمعت القبائل من كل مكان وبدأ الرسول صلى الله عليه وسلم يدعوهم قائلا: (يا أيها الناس، قولوا لا إله إلا الله تفلحوا، وتملكوا بها العرب، وتذل لكم العجم، وإذا آمنتم كنتم ملوكًا في الجنة) _[الطبراني وابن سعد] ووجد الرسول صلى الله عليه وسلم ستة رجال من (يثرب) يتحدثون، فاقترب منهم، وقال لهم: (من أنتم؟)\nقالوا: نفر من الخزرج.\nقال: أَمِنْ موالى يهود (أي من حلفائهم)؟\nقالوا: نعم.\nقال: أفلا تجلسون أكلمكم؟. قالوا: بلى.\nفجلس معهم وحدثهم عن الإسلام، وتلا عليهم القرآن، فانشرحت له صدورهم، وظهرت علامات القبول على وجوههم، وكانت بينهم وبين اليهود عداوة، فكان اليهود يهددونهم بظهور نبي، وسوف يؤيدونه ويقاتلونهم معه، فلما سمعوا كلام الرسول صلى الله عليه وسلم نظر بعضهم لبعض وقالوا: تعلمون والله إنه النبي الذي توعدكم به اليهود فلا يسبقُنَّكُم إليه .. فأجابوا الرسول صلى الله عليه وسلم فيما دعاهم إليه، ووعدوه بأن يقابلوه في العام المقبل، ثم انصرفوا إلى قومهم وحدثوهم عن رسول الله صلى الله عليه وسلم، فانتشرت أخباره في يثرب. _[ابن إسحاق].\nبـيعة العقبة الأولى:\nوفي شهر ذي الحجة سنة إحدى عشرة من البعثة، قدم إلى مكة اثنا عشر رجلا من أهل يثرب من بينهم خمسة من الستة الذين كلموا الرسول صلى الله عليه وسلم في العام الماضي، واجتمع معهم رسول الله صلى الله عليه وسلم في مكان اسمه العقبة؛ فآمنوا به صلى الله عليه وسلم، وبايعوه على ألا يشركوا بالله\nشيئًا، ولا يسرقوا، ولا يرتكبوا الفواحش والمنكرات، ولا يقتلوا أولادهم، ولا يعصوه صلى الله عليه وسلم في معروف يأمرهم به.\nوكانت هذه هي بيعة العقبة الأولى، وعندما عادوا إلى يثرب أرسل رسول الله صلى الله عليه وسلم معهم مصعب بن عمير -رضي الله عنه- ليعلمهم أمور الدين ويقرأ عليهم القرآن، فأسلم على يديه كثير من أهل يثرب.\nبـيعة العقبة الثانية:\nوفي شهر ذي الحجة من العام الثاني عشر من البعثة، ذهب ثلاثة وسبعون رجلا وامرأتان من أهل يثرب إلى الحج، ليبايعوا رسول الله صلى الله عليه وسلم على الإسلام، وفي ليلة الحادي عشر من ذي الحجة تسلل الرجال والمرأتان وذهبوا إلى العقبة، وجاء إليهم الرسول صلى الله عليه وسلم ومعه عمه العباس بن عبدالمطلب، ولم يكن قد آمن وقتئذ، ولكنه جاء ليطمئن على اتفاق ابن أخيه مع أهل يثرب، وليبين لهم أنه قادر على حمايته في مكة إن لم يكونوا قادرين على حمايته في المدينة.\nوتمت بيعة العقبة الثانية، وفيها عاهد الأنصار النبي صلى الله عليه وسلم على السمع والطاعة، وقال لهم : (تبايعوني على السمع والطاعة، في النشاط\nوالكسل، وعلى النفقة في العسر واليسر، وعلى الأمر بالمعروف والنهي عن المنكر، وعلى أن تقولوا في الله لا تأخذكم لومة لائم، وعلى أن تنصروني إذا قدمت عليكم، وتمنعوني مما تمنعون منه أنفسكم وأزواجكم وأبناءكم\nولكم الجنة) _[أحمد].\nوأصبح لرسول الله صلى الله عليه وسلم أتباع أقوياء مستعدون لنصرته، والقتال من أجل الإسلام، حتى إن أحدهم وهو العباس بن عبادة -رضي الله عنه- قام وقال لرسول الله صلى الله عليه وسلم: والله الذي بعثك بالحق، إن شئت لنميلن على أهل منى غدًا بأسيافنا، ولكن الرسول صلى الله عليه وسلم لا يفعل إلا ما يأمره الله به، فقال له : (لم نؤمر بذلك، ولكن ارجعوا إلى رحالكم)\n[ابن إسحاق] واختار رسول الله صلى الله عليه وسلم منهم اثني عشر رجلا؛ ليكونوا أمراء عليهم حتى يهاجر إليهم.\nوفي الصباح، تسلل الخبر إلى كفار قريش، فاكتشفوا أمر ذلك الاجتماع\nالخطير، وخرجت قريش تطلب المسلمين من أهل يثرب فأدركوا (سعد بن عبادة) وأسروه وأخذوا يعذبونه ويَجُرُّونه حتى أدخلوه مكة، وكان سعد يجير ويحمي تجارة اثنين من كبار مكة إذا مرا ببلده، وهما جبير بن مطعم بن عدي والحارث بن حرب بن أمية، فنادى باسميهما فجاءا وخلصاه من أيدي\nالمشركين، وعاد سعد بن عبادة -رضي الله عنه- إلى يثرب.                      ",
    "number-en": "Hajj season",
    "label-en": "The Hajj season came in the tenth year of the mission, and the tribes gathered from everywhere and the Messenger, may God bless him and grant him peace, began calling on them, saying: (O people, say there is no god but God and you will succeed, and with it you will possess the Arabs, and the non-Arabs will be humiliated for you, and if you believe, you will be kings in Paradise) - [Al-Tabarani and Ibn Saad] The Messenger, may God bless him and grant him peace, found six men from Yathrib talking, so he approached them and said to them: (Who are you?)\nThey said: A group of Khazraj.\nHe said: Who is loyal to the Jews (i.e., one of their allies)?\nThey said: Yes.\nHe said: Will you not sit down and I will talk to you? They said: Yes.\nSo he sat with them and spoke to them about Islam, and recited the Qur’an to them. Their hearts were open to him, and signs of acceptance appeared on their faces. There was enmity between them and the Jews. The Jews were threatening them with the appearance of a prophet, and they would support him and fight them with him. When they heard the words of the Messenger, may God bless him and grant him peace, they looked at each other and said: You know, by God, that he is the prophet whom the Jews have threatened you with, so do not let us go before you. So they responded to the Messenger, may God bless him and grant him peace, in what he called them to do. They promised to meet him next year, then they went to their people and told them about the Messenger of God, may God bless him and grant him peace, and news of him spread in Yathrib. _[Ibn Ishaq].\nThe First Pledge of Aqaba:\nIn the month of Dhul-Hijjah, the eleventh year of the mission, twelve men from the people of Yathrib came to Mecca, including five of the six who had spoken to the Messenger, may God bless him and grant him peace, the previous year, and the Messenger of God, may God bless him and grant him peace, met with them in a place called Aqaba. So they believed in him, may God bless him and grant him peace, and pledged allegiance to him not to associate anything with God\nThey do not steal anything, they do not commit immoral acts and evils, they do not kill their children, and they do not disobey him, may God bless him and grant him peace, in doing what he commands them to do.\nThis was the first pledge of allegiance to Aqaba, and when they returned to Yathrib, the Messenger of God, may God bless him and grant him peace, sent with them Musab bin Umair - may God be pleased with him - to teach them matters of religion and read to them the Qur’an, and many of the people of Yathrib converted to Islam at his hands.\nThe Second Pledge of Aqaba:\nIn the month of Dhul-Hijjah of the twelfth year of the mission, seventy-three men and two women from the people of Yathrib went to Hajj, to pledge allegiance to the Messenger of God, may God bless him and grant him peace, on Islam. On the night of the eleventh of Dhul-Hijjah, the men and two women sneaked out and went to Aqaba, and the Messenger, may God bless him and grant him peace, came to them and with him was his uncle Abbas bin Abdul Muttalib. He had not believed at the time, but he came to reassure himself of his nephew’s agreement with the people of Yathrib, and to show them that he was capable of protecting him. In Mecca if they were not able to protect him in Medina.\nThe second pledge of allegiance to Aqaba was completed, and in it the Ansar pledged to the Prophet, may God bless him and grant him peace, to listen and obey, and he said to them: (You pledge your allegiance to me to listen and obey, in activity.\nAnd laziness, and on spending in times of hardship and ease, and on enjoining what is right and forbidding what is evil, and so that you say in the name of God, do not let the blame of a blamer overtake you, and so that you support me when I come upon you, and prevent me from what you prevent yourselves, your wives, and your children from.\nParadise is yours)_[Ahmed].\nThe Messenger of God, may God bless him and grant him peace, had strong followers who were ready to support him and fight for Islam, to the point that one of them, Al-Abbas ibn Ubadah - may God be pleased with him - stood up and said to the Messenger of God, may God bless him and grant him peace: By God who sent you with the truth, if you wish, we will attack the people of Mina tomorrow with our swords, but the Messenger, may God bless him and grant him peace, only does what God commands him to do, so he said to him: (We were not commanded to do that, but return to your travels.)\n[Ibn Ishaq] The Messenger of God, may God bless him and grant him peace, chose twelve men from them; To be their princes until he migrates to them.\nIn the morning, the news reached the infidels of Quraysh, and they discovered the matter of that meeting\nDangerous, and the Quraysh went out asking the Muslims from the people of Yathrib, so they found (Saad bin Ubadah) and captured him and began torturing him and dragging him until they brought him into Mecca. Saad was protecting and protecting the trade of two of the prominent people of Mecca when they passed through his country, and they were Jubayr bin Mutim bin Adi and Al-Harith bin Harb bin Umayyah, so he called their names, so they came and rescued him from the hands of\nThe polytheists, and Saad bin Ubadah - may God be pleased with him - returned to Yathrib."
  },
  {
    "number": "الهجرة من مكة الى المدينة",
    "text": "",
    "label": "أصبح كفار مكة في غيظ شديد، بعدما صار لرسول الله صلى الله عليه وسلم أنصار في يثرب، وهم أهل حرب يجيدون القتال، وسوف ينصرون\nالإسلام، فشعر كفار مكة أن الأمر سيخرج من أيديهم، فانقضوا على المسلمين بالتعذيب والأذى، والتف المسلمون حول نبيهم الكريم صلى الله عليه وسلم يطلبون منه الإذن في ترك مكة كلها، ويهاجرون بدينهم، حتى يستطيعوا أن يعبدوا الله تعالى وهم آمنون، فأذن لهم الرسول صلى الله عليه وسلم بالهجرة إلى المدينة. فبدأ المسلمون يتسللون سرًّا إلى المدينة، تاركين ديارهم وأموالهم من أجل دينهم.\nوجاء أبو بكر الصديق -رضي الله عنه- إلى الرسول صلى الله عليه وسلم يستأذنه في الهجرة، فطلب منه الرسول صلى الله عليه وسلم أن ينتظر لعل الله يجعل له صاحبًا، ففهم أبو بكر أنه سيظفر بالهجرة مع رسول الله صلى الله عليه وسلم، فانتظر مسرورًا، وأخذ يُعِدُّ للرحلة المباركة، فجهزَّ ناقتين ليركبهما هو ورسول الله صلى الله عليه وسلم إلى المدينة.\nالمؤامرة:\nاجتمع زعماء مكة في دار الندوة -ذلك البيت الكبير الواسع الذي كان\nلقصي بن كلاب- وعلى وجوههم الغضب؛ للتشاور في أمر الرسول صلى الله عليه وسلم، فقد شعروا أنه يعد نفسه للهجرة إلى المدينة، وإذا تم له ذلك فسوف تصبح المدينة مركزًا كبيرًا يتجمع فيه المسلمون من كل مكان حول النبي صلى الله عليه وسلم، وبذلك يشكلون خطرًا على تجارة أهل مكة عندما تمر بالمدينة في طريقها إلى الشام ذهابًا وإيابًا، وبدأ النقاش، فقال بعضهم: نُخرج محمدًا من بلادنا فنستريح منه، وقال آخرون: نحبسه حتى يموت.\nوقال أبو جهل: نأخذ من كل قبيلة شابًّا قويًّا، ونعطي كلا منهم سيفًا صارمًا قاطعًا، لينقضوا على محمد، ويضربوه ضربة قاتلة، وهكذا لا يستطيع عبد مناف -قوم محمد- محاربة القبائل كلها، فيقتنعون بأخذ ما يريدون من مال تعويضًا عن قتل محمد، وكان الشيطان اللعين يجلس بينهم في صورة شيخ نجدي وهم لا يعرفونه، فلما سمع ذلك الرأي قال في حماس: القول ما قال الرجل، وهذا الرأي لا رأى غيره، فاتفقوا جميعًا عليه.\nوسجل القرآن الكريم ما دار في اجتماع المشركين ذلك، فقال تعالى: {إذ يمكر بك الذين كفروا ليثبتوك أو يقتلوك أو يخرجوك ويمكرون ويمكر الله والله خير الماكرين} _[الأنفال: 30] وتدخلت عناية الله؛ فجاء جبريل إلى الرسول صلى الله عليه وسلم يأمره ألا يبيت هذه الليلة في فراشه وأن يستعد للهجرة، قالت عائشة -رضي الله عنها-: فبينما نحن يومًا جلوس في بيت أبي بكر في حَرِّ الظهيرة، قال قائل لأبي بكر: هذا رسول الله صلى الله عليه وسلم، ولم يكن يأتينا في مثل هذه الساعة، فقال أبو بكر -رضي الله عنه-: فداءً له أبي وأمي، والله ما جاء به في هذه الساعة إلا أمر.\nفجاء رسول الله صلى الله عليه وسلم، فاستأذن، فأذن له، فدخل، فقال النبي صلى الله عليه وسلم لأبي بكر: (أخرج مَنْ عندك) فقال أبو بكر: إنما هم أهلك بأبي أنت يا رسول الله، قال: (فإني قد أذن لي في الخروج) فقال أبو بكر: الصحبة بأبي أنت يا رسول الله، قال رسول الله صلى الله عليه وسلم: (نعم).\nأحداث الهجرة:\nكان الله -سبحانه- قادرًا على أن يرسل ملكًا من السماء يحمل رسوله إلى المدينة كما أسرى به ليلا من مكة إلى المسجد الأقصى وعرج به السماء، ولكن جعل الهجرة فرصة كبيرة لنتعلم من رسول الله صلى الله عليه وسلم دروسًا عظيمة في كيفية التفكير والتخطيط والأخذ بالأسباب التي توصل إلى النجاح.\nولنبدأ بأول هذه الدروس، فكيف يخرج النبي صلى الله عليه وسلم هو وصاحبه أبو بكر -رضي الله عنه- من بين هؤلاء الكفار دون أن يلحقوا بهما؟ فلو خرجا من مكة سالمين فإن المسافة طويلة بين مكة والمدينة وسوف يخرج وراءهما الكفار ويدركونهما، لابد إذن من الاختباء في مكان ما؛ حتى ييأس الكفار من البحث عنهما، ومن هنا وضع رسول الله صلى الله عليه وسلم خطة محكمة لتتم الهجرة بسلام.\nفأمام بيت رسول الله صلى الله عليه وسلم وقف مجموعة من شباب قريش في الليل، ينتظرون حتى يخرج الرسول صلى الله عليه وسلم، فينقضوا عليه\nويقتلوه، وكان هؤلاء الكفار يتطلعون بين الحين والحين إلى فراش رسول الله صلى الله عليه وسلم ليطمئنوا على وجوده، فأمر النبي صلى الله عليه وسلم\nعليَّ بن أبي طالب -رضي الله عنه- بالنوم في فراشه، وأن يتغطى ببردته، وطمأنه بأن المشركين لن يؤذوه بإذن الله.\nواستجاب عليٌّ -رضي الله عنه- بكل شجاعة وحماس، ونفذ ما أمره الرسول صلى الله عليه وسلم به، وأراد الرسول صلى الله عليه وسلم من ذلك تضليل المشركين، فإذا نظروا إليه من الباب ووجدوه في فراشه، ظنوا أنه صلى الله عليه وسلم ما زال نائمًا، وقد كانت عند الرسول صلى الله عليه وسلم أمانات كثيرة تركها المشركون عنده، فأراد الرسول صلى الله عليه وسلم أن يردها إلى أصحابها، فأمر عليًّا أن ينتظر في مكة لأداء هذه المهمة، رغم أنهم أخرجوا المسلمين من ديارهم، وآذوهم، ونهبوا أموالهم ولكن المسلم يجب أن\nيكون أمينًا.\nوكان أبو جهل يقول لأصحابه متهكمًا برسول الله صلى الله عليه وسلم: إن محمدًا يزعم أنكم إن تابعتموه أصبحتم ملوك العرب والعجم، ثم بعثتم من بعد موتكم، فدخلتم الجنة، وإن لم تفعلوا ذبحكم ثم بعثتم من بعد موتكم فتدخلون النار تحرقون فيها.\nونام علي -رضي الله عنه- في فراش الرسول صلى الله عليه وسلم، وتوجه النبي صلى الله عليه وسلم إلى الباب، وخرج وفي قبضته حفنة من التراب فنثرها على رءوس المشركين، وهو يقرأ سورة يس إلى قوله تعالى: {وجعلنا من بين أيديهم سدًّا ومن خلفهم سدًّا فأغشيناهم فهم لا يبصرون} _[يس: 9] وإذا برجل يمر عليهم فرأى التراب على رءوسهم، فقال لهم: خيبكم الله، قد خرج عليكم محمد، ثم ما ترك منكم رجلا إلا وقد وضع على رأسه ترابًا، أفما ترون ما بكم؟ فوضع كل رجل منهم يده على رأسه فإذا عليه التراب.\nفنظروا من الباب، فوجدوا رجلا نائمًا في مكان الرسول صلى الله عليه وسلم وعليه غطاؤه، فقالوا: هذا محمد في فراشه، وعليه بردة، ثم اقتحموا دار النبي صلى الله عليه وسلم، فوجدوا عليًّا في فراشه، فخرجوا يبحثون عن الرسول صلى الله عليه وسلم في كل مكان، وكان الرسول صلى الله عليه وسلم خلال هذه الفترة قد وصل إلى بيت صاحبه أبي بكر -رضي الله عنه- وعزما على الذهاب إلى غار ثور ليختبئا فيه.\nوحمل أبو بكر الصديق -رضي الله عنه- كل ماله، وخرج مع رسول الله صلى الله عليه وسلم من باب صغير في نهاية المنزل حتى لا يراهما أحد، وانطلقا حتى وصلا الغار، وهناك وقف رسول الله صلى الله عليه وسلم ودخل أبوبكر\nأولا؛ ليطمئن على خلوِّ الغار من الحيَّات والعقارب، ثم سدَّ ما فيه من فتحات حتى لا يخرج منها شيء، وبعد ذلك دخل الرسول صلى الله عليه وسلم.\nوها هي ذي أسماء بنت أبي بكر يدخل عليها جدها أبو قحافة بعد أن علم بخروج ولده أبي بكر مع رسول الله صلى الله عليه وسلم، وكان رجلا كبيرًا قد عَمِىَ، يسألها عما تركه أبو بكر في بيته ويقول: والله إني لأراه فجعكم بماله مع نفسه، قالت: كلا يا أبتِ! إنه قد ترك لنا خيرًا كثيرًا، وأخذت أحجارًا فوضعتها في المكان الذي كان أبوها يضع ماله فيه، ثم وضعت عليها ثوبًا، ثم أخذت بيده وقالت: يا أبت، ضع يدك على هذا، فوضع يده عليه فقال: لا بأس ، فإن كان ترك لكم هذا فقد أحسن، وفي هذا بلاغ لكم.\nأما كفار مكة فإنهم حيارى، يبحثون عن الرسول صلى الله عليه وسلم وصاحبه ويضربون كفًّا بكف من الحيرة والعجب، فالصحراء على اتساعها مكشوفة أمامهم، ولكن لا أثر فيها لأحد ولا خيال لإنسان، فتتبعوا آثار الأقدام، فقادتهم إلى غار ثور، فوقفوا أمام الغار، وليس بينهم وبين الرسول صلى الله عليه وسلم وصاحبه سوى أمتار قليلة، حتى إن أبا بكر رأى أرجلهم فقال لرسول الله صلى الله عليه وسلم: يا رسول الله، لو نظر أحدهم تحت قدميه لرآنا، فقال له الرسول صلى الله عليه وسلم : (يا أبا بكر، ما ظنك باثنين الله ثالثهما)\n[متفق عليه].\nوصدق رسول الله صلى الله عليه وسلم، فقد انصرف القوم، ولم يفكر أحدهم أن ينظر في الغار، وسجل القرآن هذا، فقال تعالى: {إلا تنصروه فقد نصره الله إذ أخرجه الذين كفروا ثاني اثنين إذ هما في الغار إذ يقول لصاحبه لا تحزن إن الله معنا فأنزل الله سكينته عليه وأيده بجنود لم تروها وجعل كلمة الذين كفروا السفلى وكلمة الله هي العليا والله عزيز حكيم} [التوبة: 40].\nومكث الرسول صلى الله عليه وسلم وصاحبه في الغار ثلاثة أيام، وكان\nعبدالله بن أبي بكر يذهب إليهما بأخبار الكفار ليلا، وأخته أسماء تحمل لهما الطعام، أما عامر بن فهيرة راعي غنم أبي بكر فقد كان يسير بالأغنام فوق آثار أقدام عبدالله وأسماء حتى لا يترك أثرًا يوصل إلى الغار، وبعد انتهاء الأيام\nالثلاثة، خف طلب المشركين للرسول صلى الله عليه وسلم وصاحبه، فخرجا من الغار، والتقيا بعبد الله بن أريقط، وقد اتفقا معه على أن يكون دليلهما في هذه الرحلة مقابل أجر.\nتحرك الركب بسلام، وأبو بكر لا يكف عن الالتفات والدوران حول النبي صلى الله عليه وسلم خوفًا عليه، ورسول الله صلى الله عليه وسلم يقرأ القرآن، ولا يلتفت حوله فهو واثق من نصر الله -تعالى- له، ولا يخشى أحدًا، وبينما أبو بكر يلتفت خلفه إذا بفارس يقبل نحوهما من بعيد، كان الفارس هو سراقة بن مالك وقد دفعه إلى ذلك أن قريشًا لما يئست من العثور على الرسول صلى الله عليه وسلم وصاحبه، جعلوا مائة ناقة جائزة لمن يرده إليهم حيًّا أو ميتًا.\nفانطلق سراقة بن مالك بفرسه وسلاحه في الصحراء طمعًا في الجائزة، فغاصت أقدام فرسه في الرمال مرتين حين رأى رسول الله صلى الله عليه وسلم، فنزل سراقة مسرعًا عن الفرس، حتى نزعت أقدامها من الرمال، فأيقن سراقة أن الله تعالى يحرس رسوله صلى الله عليه وسلم، ولن يستطيع إنسان مهما فعل أن ينال منه، فطلب من رسول الله أن يعفو عنه، وعرض عليه الزاد فقال له النبي صلى الله عليه وسلم: (لا حاجة لنا، ولكن عمِّ عنا الخبر) فوعده سراقة ألا يخبر\nأحدًا، وعاد إلى مكة، وهكذا خرج سراقة يريد قتلهما وعاد وهو يحرسهما ويبعد الناس عنهما، فسار النبي صلى الله عليه وسلم وصاحبه إلى المدينة تحرسهما عناية الله.\nوأثناء رحلة رسول الله صلى الله عليه وسلم وأبي بكر إلى المدينة مرَّا بمنازل خزاعة ودخلا خيمة أم معبد الخزاعية، وكانت سيدة كريمة، تطعم وتسقي من مرَّ بها، فسألاها: عما إذا كان عندها شيء من طعام؟ فأخبرتهما أنها لا تملك شيئًا في ذلك الوقت، فقد كانت السنة شديدة القحط، فنظر رسول الله صلى الله عليه وسلم إلى شاة في جانب الخيمة فقال: ما هذه الشاة يا أم معبد؟\nفأخبرته أنها شاة منعها المرض عن الخروج إلى المراعي مع بقية الغنم، فقال: هل بها من لبن؟ قالت: هي أجهد من ذلك، فقال: أتأذنين لي أن أحلبها؟ قالت: نعم إن رأيت بها حلبًا فاحلبها.\nفمسح رسول الله صلى الله عليه وسلم بيده ضرعها، وسمى الله ودعا، وطلب إناء فحلب فيه حتى علته الرغوة، فسقاها فشربت حتى شبعت، وسقى رفيقيه أبا بكر وعبد الله بن أريقط حتى شبعا، ثم شرب، وحلب فيه ثانية حتى ملأ الإناء، ثم تركه صلى الله عليه وسلم وانصرف.\nالرسول صلى الله عليه وسلم في قباء:\nعلم أهل المدينة بهجرة الرسول صلى الله عليه وسلم إليهم، فكانوا يخرجون كل يوم بعد صلاة الصبح إلى مشارف المدينة، وعيونهم تتطلع إلى الطريق، وتشتاق لمقدم الرسول صلى الله عليه وسلم إليهم، ولا يعودون إلى بيوتهم إلا إذا اشتد حر الظهيرة، ولم يجدوا ظلا يقفون فيه.\nوفي يوم الاثنين الثاني عشر من ربيع الأول انتظر أهل يثرب رسول الله صلى الله عليه وسلم كعادتهم، حتى اشتد الحر عليهم، فانصرفوا لبيوتهم، وبعد قليل أقبل رسول الله صلى الله عليه وسلم وصاحبه، فأبصرهما رجل يهودي كان يقف على نخلة، فصاح بأعلى صوته: يا بني قيلة، هذا صاحبكم قد جاء، فأسرع المسلمون لاستقبال نبيهم وصاحبه أبي بكر الذي كان يُظل رسول الله صلى الله عليه وسلم بردائه من حر الشمس.\nوبينما الرسول صلى الله عليه وسلم في قُبَاء، في بيت سعد بن خيثمة يستقبل الوافدين عليه، أقبل عليُّ بن أبي طالب من مكة بعد أن ظل فيها ثلاثة أيام بعد خروج الرسول صلى الله عليه وسلم؛ ليرد الأمانات إلى أهلها، وقد ظل الرسول صلى الله عليه وسلم في قباء أربعة أيام يستقبل أهل المدينة، وعندما أقبل يوم الجمعة ترك رسول الله صلى الله عليه وسلم قباء متوجهًا للمدينة بعد أن أسس مسجد قباء، وهو أول مسجد بني في الإسلام، وقال الله -عز وجل- عنه: {لمسجد أسس على التقوى من أول يوم أحق أن تقوم فيه فيه رجال يحبون أن يتطهروا والله يحب المطهرين} _[التوبة: 108].\nوكانت الهجرة حدثًا فاصلا بين عهدين، فقد أعز الله المسلمين بعد أن كانوا مضطهدين، وصارت لهم دار آمنة يقيمون فيها، ومسجد يصلون فيه، ويؤدون فيه شعائرهم، ويتشاورون في أمورهم، لهذا كله اتفق الصحابة على جعل الهجرة بداية للتاريخ الإسلامي، فقد تحول المسلمون من الضعف والحصار والاضطهاد إلى القوة والانتشار ورد العدوان.                      ",
    "number-en": "Migration from Mecca to Medina",
    "label-en": "The infidels of Mecca became extremely angry after the Messenger of God, may God bless him and grant him peace, had supporters in Yathrib. They are people of war who are good at fighting, and they will be victorious.\nIslam, so the infidels of Mecca felt that the matter would be out of their hands, so they attacked the Muslims with torture and harm, and the Muslims gathered around their noble Prophet, may God bless him and grant him peace, asking him for permission to leave all of Mecca and emigrate with their religion, so that they could worship God Almighty while they were safe, so the Messenger, may God bless him and grant him peace, gave them permission to migrate to Medina. Muslims began to secretly infiltrate the city, abandoning their homes and money for the sake of their religion.\nAbu Bakr Al-Siddiq - may God be pleased with him - came to the Messenger, may God’s prayers and peace be upon him, to ask him for permission to migrate. The Messenger, may God’s prayers and peace be upon him, asked him to wait, perhaps God would give him a companion. Abu Bakr understood that he would be successful in migrating with the Messenger of God, may God’s prayers and peace be upon him, so he waited happily, and began to prepare for the blessed journey. He prepared two camels for him and the Messenger of God, may God’s prayers and peace be upon him, to ride to Medina. Plot:\nThe leaders of Mecca gathered in Dar al-Nadwah - that large, spacious house that was\nBy Qusayy bin Kilab - with anger on their faces; To consult on the matter of the Messenger, may God bless him and grant him peace, as they felt that he was preparing himself to emigrate to Medina, and if this was accomplished, Medina would become a large center in which Muslims from everywhere would gather around the Prophet, may God bless him and grant him peace, and thus they would pose a threat to the trade of the people of Mecca when it passed through Medina on its way to the Levant back and forth, and the discussion began, and some of them said: We take Muhammad out of our country so we can rest from him, and others said: We imprison him until he dies. Abu Jahl said: We take a strong young man from each tribe, and give each of them a sharp, cutting sword, so that they can attack Muhammad and strike him with a fatal blow. Thus, Abd Manaf - Muhammad’s people - cannot fight all the tribes, so they are convinced to take whatever money they want in compensation for killing Muhammad. The accursed devil was sitting among them in the form of a Najdi sheikh, and they did not know him. When he heard that opinion, he said in enthusiasm: The opinion is what the man said, and this opinion is the opinion of no other, so they all agreed on it. The Holy Qur’an recorded what took place in that meeting of the polytheists, and God Almighty said: {When those who disbelieved were plotting against you to defeat you, or kill you, or expel you, and they were plotting, and Allah was plotting, and Allah is the best of planners}_[Al-Anfal: 30] And God’s providence intervened; So Gabriel came to the Messenger, may God bless him and grant him peace, ordering him not to spend the night in his bed and to prepare for the migration. Aisha - may God be pleased with her - said: One day while we were sitting in Abu Bakr’s house in the heat of the afternoon, someone said to Abu Bakr: This is the Messenger of God, may God bless him and grant him peace, and he did not come to us at such an hour, so Abu Bakr - may God be pleased with him - said: May my father and mother be sacrificed for him. By God, he brought nothing at this hour except an order.\nSo the Messenger of God, may God’s prayers and peace be upon him, came and asked for permission. He gave him permission, and he entered. Then the Prophet, may God’s prayers and peace be upon him, said to Abu Bakr: “Get out of your company.” Abu Bakr said: “The only concern for your family is your father, O Messenger of God.” He said: “I have been given permission to go out.” Abu Bakr said: “You are my father’s companion, O Messenger of God.” The Messenger of God, may God’s prayers and peace be upon him, said: “Yes.” Migration events:\nGod - Glory be to Him - was able to send an angel from heaven to carry His Messenger to Medina, just as He was taken by night from Mecca to Al-Aqsa Mosque and taken to heaven. But He made the migration a great opportunity for us to learn from the Messenger of God, may God bless him and grant him peace, great lessons in how to think, plan, and take the reasons that lead to success. Let us begin with the first of these lessons. How did the Prophet, may God’s prayers and peace be upon him, and his companion Abu Bakr - may God be pleased with him - emerge from among these infidels without catching up with them? If they leave Mecca safely, the distance is long between Mecca and Medina, and the infidels will come out after them and overtake them. Therefore, they must hide somewhere; Until the infidels despaired of searching for them, and from here the Messenger of God, may God bless him and grant him peace, developed a precise plan for the migration to take place in peace. In front of the house of the Messenger of God, may God bless him and grant him peace, a group of young men from Quraish stood at night, waiting until the Messenger, may God bless him and grant him peace, came out and attacked him.\nAnd kill him, and these infidels would look from time to time to the bed of the Messenger of God, may God bless him and grant him peace, to be sure of his presence. So the Prophet, may God bless him and grant him peace, ordered\nAli bin Abi Talib - may God be pleased with him - by sleeping in his bed, covering himself with his cloak, and reassuring him that the polytheists would not harm him, God willing. Ali - may God be pleased with him - responded with all courage and enthusiasm, and carried out what the Messenger, may God’s prayers and peace be upon him, ordered him to do. The Messenger, may God’s prayers and peace be upon him, wanted to mislead the polytheists. If they looked at him from the door and found him in his bed, they thought that he, may God’s prayers and peace be upon him, was still asleep. The Messenger, may God’s prayers and peace be upon him, had many trusts that the polytheists had left with him, so the Messenger, may God’s prayers and peace be upon him, wanted to return them to their owners, so he ordered Ali. To wait in Mecca to perform this task, even though they expelled the Muslims from their homes, harmed them, and plundered their money, but the Muslim must\nBe faithful. Abu Jahl used to say to his companions, mocking the Messenger of God, may God bless him and grant him peace: Muhammad claims that if you follow him, you will become the kings of the Arabs and non-Arabs, then you will be resurrected after your death, and you will enter Paradise, and if you do not, he will slaughter you and then you will be resurrected after your death, so you will enter the Fire and be burned in it.\nAli - may God be pleased with him - slept in the bed of the Messenger, may God bless him and grant him peace, and the Prophet, may God bless him and grant him peace, went to the door and came out with a handful of dirt in his fist, which he scattered on the heads of the polytheists. As he recites Surat Yasin, up to the Almighty’s saying: {And We made before them a barrier, and behind them a barrier, so We covered them so that they could not see}_[Yasin: 9] And behold, a man passed by them and saw dust on their heads, and he said to them: May God disappoint you. Muhammad has revolted against you, and then he did not leave a man among you except when he placed dust on his head. So do you not see what is wrong with you? So each man put his hand on his head and found dust on it. So they looked through the door and found a man sleeping in the place of the Messenger, may God bless him and grant him peace, with his cover on. They said: This is Muhammad in his bed, wearing a cloak. Then they stormed the house of the Prophet, may God bless him and grant him peace, and found Ali in his bed. They went out searching for the Messenger, may God bless him and grant him peace, everywhere. During this period, the Messenger, may God bless him and grant him peace, had arrived at the house of his friend Abu Bakr - may God be pleased with him - and decided to go to the Cave of Thawr to hide in it. Abu Bakr Al-Siddiq - may God be pleased with him - carried all his money, and left with the Messenger of God, may God’s prayers and peace be upon him, through a small door at the end of the house so that no one would see them. They set off until they reached the cave, and there the Messenger of God, may God’s prayers and peace be upon him, stood and Abu Bakr entered.\nFirst; To ensure that the cave was free of snakes and scorpions, then he closed the openings in it so that nothing could come out of them, and after that the Messenger, may God bless him and grant him peace, entered. And here was Dhu Asma bint Abi Bakr. Her grandfather, Abu Quhafa, entered upon her after he learned that his son, Abi Bakr, had gone out with the Messenger of God, may God bless him and grant him peace. He was an old man who had become blind. He asked her about what Abu Bakr had left in his house and said: By God, I see him spoiling you with his money along with himself. She said: No, father! He left us a lot of goodness, and she took stones and placed them in the place where her father used to put his money, then she put a dress on them, then she took his hand and said: Father, put your hand on this. So he put his hand on it and said: It is okay. If he left this to you, then he did well, and this is a report to you. As for the infidels of Mecca, they are bewildered, searching for the Messenger, may God’s prayers and peace be upon him, and his companion, and they are shaking hand to hand with confusion and amazement. The vast desert is open before them, but there is no trace of anyone in it, nor the shadow of a human being. So they followed the footprints, and it led them to the Cave of Thawr. They stood in front of the cave, and there was only a few meters between them and the Messenger, may God’s prayers and peace be upon him, and his companion, so much so that Abu Bakr saw their feet and said to the Messenger of God, may God’s prayers and peace be upon him: Oh. The Messenger of God, if one of them looked under his feet, he would see us, and the Messenger, may God bless him and grant him peace, said to him: (O Abu Bakr, What do you think of two, God is the third?\n[Agreed upon].\nAnd the Messenger of God, may God bless him and grant him peace, spoke the truth. The people had departed, and none of them thought to look into the cave. The Qur’an recorded this, and God Almighty said: {If you do not help him, God has helped him when those who disbelieved expelled him, the second of the two, when they were in the cave, when he said to his companion, “Do not grieve. Indeed, God is with us.” Then God sent down His tranquility upon him and supported him with soldiers that you did not see, and made the word of those who disbelieved the lowest, and the word of God the highest, and God is Mighty, Wise.} [Al-Tawbah: 40]. The Messenger, may God bless him and grant him peace, and his companion stayed in the cave for three days\nAbdullah bin Abi Bakr would go to them with news of the infidels at night, and his sister Asma would carry food for them. As for Aamer bin Fuhaira, the shepherd of Abu Bakr’s sheep, he would walk the sheep over the footprints of Abdullah and Asma so as not to leave a trace leading to the cave, and after the days were over\nFor the three of them, the polytheists’ request to the Messenger, may God bless him and grant him peace, and his companion became less frequent, so they left the cave and met Abdullah bin Ariqat, and they agreed with him to be their guide on this journey in exchange for a reward. The caravans moved peacefully, and Abu Bakr did not stop turning and circling around the Prophet, may God’s prayers and peace be upon him, out of fear for him. The Messenger of God, may God’s prayers and peace be upon him, was reading the Qur’an, but did not look around, for he was confident that God Almighty would grant him victory, and he did not fear anyone. While Abu Bakr was looking behind him, he saw a knight approaching them from afar. The knight was Suraqa bin Malik, and he was prompted to do so by the fact that the Quraysh had given up on finding the Messenger, may God’s prayers and peace be upon him. And his owner, they made one hundred camels a reward for whoever returned him to them, dead or alive. So Suraqa bin Malik set out with his horse and his weapon into the desert, hoping for the prize. His horse’s feet sank into the sand twice when he saw the Messenger of God, may God bless him and grant him peace. So Suraqa quickly got off the horse, until its feet were removed from the sand. Suraqa was certain that God Almighty was guarding His Messenger, may God bless him and grant him peace, and that no man, no matter what he did, would be able to get him. So he asked the Messenger of God to pardon him, and offered him the provisions, so the Prophet, may God bless him and grant him peace, said to him. Peace be upon him: (We have no need, but let us know the news.) So Suraqa promised him not to tell\nOne Sunday, and he returned to Mecca. Thus, Suraqa went out wanting to kill them and returned, guarding them and keeping people away from them. So the Prophet, may God bless him and grant him peace, and his companion walked to Medina, guarded by God’s care.\nDuring the journey of the Messenger of God, may God bless him and grant him peace, and Abu Bakr to Medina, they passed by the houses of Khuza’i and entered the tent of the mother of the temple of Khuza’i. She was a generous woman who fed and gave water to those who passed by. They asked her: Did she have any food? So she told them that she did not have anything at that time, as the year had been very droughty, so the Messenger of God, may God bless him and grant him peace, looked at a sheep in the side of the tent and said: What is this sheep, Umm Ma’abad?\nSo I told him that it was a sheep that had been prevented by illness from going out to the pastures with the rest of the sheep. He said: Does it have any milk? She said: She is more tired than that, so he said: Do you allow me to milk her? She said: Yes, if you see milk in it, milk it. So the Messenger of God, may God bless him and grant him peace, wiped her udder with his hand, named God and called, and asked for a vessel and milked in it until it foamed, then he gave her water and she drank until she was full, and he gave his two companions Abu Bakr and Abdullah bin Uriqat water until they were full, then he drank, and milked in it again until he filled the vessel, then he, may God bless him and grant him peace, left it and went away.\nThe Messenger, may God bless him and grant him peace, in Quba:\nThe people of Medina learned of the migration of the Messenger, may God bless him and grant him peace, to them, so they would go out every day after the morning prayer to the outskirts of Medina, with their eyes looking toward the road and longing for the Messenger, may God bless him and grant him peace, to come to them. They do not return to their homes unless the afternoon heat becomes intense and they do not find shade in which to stand.\nOn Monday the twelfth of Rabi’ al-Awwal, the people of Yathrib waited for the Messenger of God, may God bless him and grant him peace, as was their custom, until the heat became intense for them, so they departed to their homes. After a short while, the Messenger of God, may God bless him and grant him peace, and his companion came, and a Jewish man who was standing on a palm tree saw them and shouted at the top of his voice: O Banu Qayla, this is your companion has come, so the Muslims hastened to meet their Prophet and his companion, Abu Bakr, who was shadowing the Messenger of God, may God bless him and grant him peace. With his robe from the heat of the sun. While the Messenger, may God bless him and grant him peace, was in Quba, in the house of Saad bin Khaythamah, receiving those arriving to him, Ali bin Abi Talib came from Mecca after staying there for three days after the departure of the Messenger, may God bless him and grant him peace. To return the trusts to their people, the Messenger, may God bless him and grant him peace, remained in Quba for four days, receiving the people of the city, and when Friday came, the Messenger of God, may God bless him and grant him peace, left Quba and headed to the city after he founded the Quba Mosque, which is the first mosque built in Islam. God Almighty said about him: “A mosque founded on piety from the first day is more deserving of having men standing in it who love to purify themselves, and God loves those who purify themselves” [Al-Tawbah: 108].\nThe Hijra was an event separating two eras. God gave the Muslims glory after they had been persecuted, and they had a safe house in which to reside, a mosque in which they prayed, performed their rituals, and consulted about their affairs. For all of this, the Companions agreed to make the Hijra the beginning of Islamic history, as the Muslims turned from weakness, siege, and persecution to strength, expansion, and response to aggression."
  },
  {
    "number": "الرسول في المدينة",
    "text": "",
    "label": "كانت يثرب قبل الهجرة تموج بالصراعات والحروب والدسائس، فنار العداوة مشتعلة بين قبيلتي الأوس والخزرج، والحرب بينهما سجال، فإذا انتصر أحدهما عمل الآخر بكل طاقته على إلحاق الهزيمة به، حتى فني الرجال، وترملت النساء وتيتم الأبناء، وكان اليهود يقفون خلف الستار، يزيدون النار اشتعالا، فيمدون الطرفين بالسلاح، ويثيرون بينهما العداوات والفتن؛ آملين أن يقضي بعضهم على بعض، حتى تكون لليهود السيادة والكلمة الأولى في المدينة.\nواجتمع أهل يثرب على (عبدالله بن أبي بن سلول) لتكون له الكلمة العليا في إدارة المدينة، ولكن الله أراد السلامة للمدينة؛ وأراد لها أن تكون مركز الدولة الإسلامية، فأقبل موكب رسول الله صلى الله عليه وسلم على المدينة، فاستقبله أهلها استقبالا عظيمًا؛ وكان أمل كل واحد منهم أن يستضيف الرسول صلى الله عليه وسلم في بيته، فكلما مرت الناقة التي تحمل رسول الله صلى الله عليه وسلم ببيت، خرج أهل ذلك البيت، وتعلقوا بزمامها، وهم يرجون أن ينزل رسول الله صلى الله عليه وسلم عندهم، فكان يقول لهم: (دعوا الناقة فإنها مأمورة) أي اتركوا الناقة فإنها ستقف وحدها حيث أمرها الله تعالى.\nوفي مكان يملكه يتيمان من بني النجار أمام دار أبي أيوب الأنصاري بركت الناقة، فقال صلى الله عليه وسلم: (هذا إن شاء الله المنزل) فحمل أبو أيوب رحل النبي صلى الله عليه وسلم إلى بيته. [ابن إسحاق] وإذا بفتيات صغيرات من بني النجار، يخرجن فرحات بمقدم الرسول صلى الله عليه وسلم وينشدن:\nنَحْنُ جَوارٍ مِن بنـي النـَّجَّـار يا حبَّـذَا محمـدٌ مـن جـَـارِ\nوفي بيت أبي أيوب الأنصاري المكون من طابقين، نزل رسول الله صلى الله عليه وسلم في الطابق السفلي، فقال له أبو أيوب: يا نبي الله، بأبي أنت وأمي، إني لأكره وأعظِّم أن أكون فوقك، وتكون تحتي، فاظهر (اصعد) أنت فكن في الأعلى، وننزل نحن فنكون في السفل، فقال رسول الله صلى الله عليه وسلم:\n(يا أبا أيوب، إنه لأرفق بنا وبمن يغشانا أن نكون في أسفل البيت) _[أحمد].\nوهكذا كان الرسول صلى الله عليه وسلم لا يثقل على أهل البيت، وكان الصحابي أبو أيوب الأنصاري كريمًا في ضيافته، فإن صنع طعامًا لا يأكل هو زوجته إلا بعد أن يأكل رسول الله صلى الله عليه وسلم منه أولا، ثم يأكلان من موضع أصابعه حبًّا فيه وطلبًا لبركته.\nبناء المسجد:\nعاش المسلمون في المدينة حياة آمنة مطمئنة، يغشاها الهدوء والسكينة، ورسول الله صلى الله عليه وسلم بينهم في وطنهم الجديد، لقد أصبحت لهم دولة دينها الإسلام، وقائدها الرسول صلى الله عليه وسلم، وكان أول ما فكر فيه الرسول صلى الله عليه وسلم هو بناء مسجد يجتمعون فيه، فيؤدون فيه صلاتهم، ويقضون أمورهم، ويتشاورون فيما يخصهم، فاشترى صلى الله عليه وسلم الموضع الذي بركت فيه الناقة؛ ليبني فيه المسجد.\nوتجمع المسلمون لبناء المسجد، ورسول الله صلى الله عليه وسلم معهم، ينظف المكان، ويحمل معهم الطوب، ويشارك في البناء، فهذا يقطع النخيل، وهذا يحفر أماكن الأعمدة، وذاك يقيم الجدار، وآخر يعد الطين، وهذا يحمل الطوب، كلهم ينشدون:\nلَئِنْ قَـعَـدنا والنبــي يَعمَــل لـَذَاك منـَّا العمـلُ المضَـلَّلُ\nوينشدون أيضًا::\nلا عَيْشَ إلا عيـشُ الآخِـرَة اللَّهُمَّ فارحَمِ الأنْصَارَ والمهاجِرَة\nومن المسجد بدأ رسول الله صلى الله عليه وسلم ينظم دولته، وكان أهم شيء في هذه الدولة هم الأفراد الذين يعيشون فيها؛ لأنها تنهض بهم وتعتمد عليهم، فكان المسلمون في المدينة عندئذ قسمين:\n-المهاجرون، وهم أهل مكة الذين هاجروا بدينهم إلى المدينة.\n-الأنصار، وهم أهل المدينة الأصليون، الذين اعتنقوا الإسلام، واستضافوا المسلمين في بلدهم، ونصروا الرسول صلى الله عليه وسلم.\nوفي بداية الهجرة كان المهاجرون في المدينة يعانون من الوحشة والإحساس بالغربة، فحياة المدينة وجَوُّها يختلفان عن مكة، مما جعل أكثرهم يتعرض للمرض، فتوجه رسول الله صلى الله عليه وسلم إلى ربه ودعاه أن يحبب المدينة إلى قلوب المهاجرين، وأن يزيل مرض الحمى عنهم، فاستجاب الله تعالى لنبيه وحبَّبَ إلى المهاجرين العيش في المدينة، وصاروا يتحركون في شوارعها، وسوقها بحماس ومرح كأنهم ولدوا ونشئوا فيها.\nالصلح بن الأوس والخزرج:\nوكان الأنصار قبيلتين كبيرتين: الأوس، والخزرج، وكانت الحروب لا تنقطع بينهما قبل أن يعتنقوا الإسلام، فصالح الرسول صلى الله عليه وسلم بينهما، ونزع الله من قلوبهم العداوة والكراهية، وحل محلها الحب والمودة والوئام.\nالمؤاخاة:\nوالآن بعد أن استقر المهاجرون، وصلح حال الأنصار، بقي أن يندمجوا سويًّا فيصبحوا أخوة مسلمين، فلا فرق بين مهاجر وأنصاري، لذلك آخى رسول الله صلى الله عليه وسلم بينهم فجعل لكل مهاجر أخًا من الأنصار، فأبو بكر الصديق أخ لخارجة بن زهير، وعمر بن الخطاب أخ لعتبان بن مالك، وعبد الرحمن بن عوف أخ لسعد بن الربيع، ولم تكن الأخوة مجرد كلمة تقال، بل طبقها المسلمون تطبيقًا فعليًّا فهذا سعد بن الربيع الأنصاري يأخذ أخاه\nعبد الرحمن بن عوف، ويعرض عليه أن يعطيه نصف ما يملك، ولكن عبد الرحمن بن عوف يشكره ويقول له: بارك الله لك في أهلك ومالك، ولكن دُلَّني على السوق، وذهب عبدالرحمن إليه فربح وأكل من عمل يده. _[البخاري].\nولم يقتصر ذلك على سعد بن الربيع بل فعله كثير من الصحابة حتى إنه كان يرث بعضهم بعضًا بناءً على هذه الإخوة، فيرث المهاجر أخاه الأنصاري، ويرث الأنصاري أخاه المهاجر، وظلوا على ذلك حتى جعل الله التوارث بين ذوي الأرحام، وقد أثنى الله -عز وجل- على المهاجرين والأنصار، فقال تعالى: {للفقراء والمهاجرين الذين أخرجوا من ديارهم وأموالهم يبتغون فضلاً من الله ورضوانًا وينصرون الله ورسوله أولئك هم الصادقون . والذين تبوءوا الدار والإيمان من قبلهم يحبون من هاجر إليهم ولا يجدون في صدورهم حاجة مما أوتوا ويؤثرون على أنفسهم ولو كان بهم خصاصة ومن يوق شح نفسه فأولئك هم المفلحون} _[الحشر: 8-9].\nوجمعهم الله سبحانه في آية واحدة، فقال تعالى: {والذين آمنوا وهاجروا وجاهدوا في سبيل الله والذين آووا ونصروا أولئك هم المؤمنون حقًّا لهم مغفرة ورزق كريم} [الأنفال: 74] وفي هذا المجتمع الآمن المستقر، حيث يحب كل مسلم أخاه، أخذ رسول الله صلى الله عليه وسلم يعلم أصحابه أمور دينهم فيدعوهم إلى كل خير، وينهاهم عن كل شر، وهم ينفذون ذلك راضين سعداء بهداية الله لهم، ووجود رسول الله صلى الله عليه وسلم بينهم، وبدأ الناس يتوافدون إلى المدينة، معلنين إسلامهم وانضمامهم لهذه الدولة المنظمة.\nاليهود في المدينة:\nوكان يسكن مع المسلمين في المدينة اليهود وبعض المشركين الذين يحقدون على الإسلام، ويكرهون قيام دولته، لذلك وضع الرسول صلى الله عليه وسلم معاهدة تنظم العلاقة بين المسلمين وغيرهم حتى يأمن مكر الكفار، وهذه بعض المبادئ التي احتوتها المعاهدة:\n1-المهاجرون والأنصار أمة من دون الناس يتعاونون فيما بينهم، وهم يد واحدة على من عاداهم.\n2-دماؤهم محفوظة، فلا يقتل مؤمن مؤمنًا، ولا ينصر مؤمن كافرًا على أخيه المؤمن.\n3-لليهود حريتهم الدينية فلا يُجبرون على الإسلام.\n4-اليهود الذين يسكنون المدينة يشاركون في الدفاع عنها، ولا يعينون أعداء الإسلام، ولا ينصرونهم.\n5-كل ظالم أو آثم أو متهاون خائن لا ينفذ ما في هذا العهد عليه اللعنة والغضب، ويقوم الآخرون بحربه.\n6-إذا حدث خلاف في أي أمر، فإن الحكم هو كتاب الله وسنة نبيه صلى الله عليه وسلم.\nوهكذا وضَّح الرسول صلى الله عليه وسلم حقوق كل طائفة في المدينة وواجباتها، ورسم المنهج الذي يتعاملون به بكل أمانة وعدل، فلم يظلم اليهود بل حفظ لهم حقوقهم، ورغم ذلك أظهر اليهود وجههم القبيح، وكراهيتهم للرسول صلى الله عليه وسلم رغم علمهم أنه صادق، واتضح ذلك في موقفهم من عبدالله بن سلام عندما أسلم.\nفقد كان عبد الله بن سلام من علماء اليهود، ومن ساداتهم، فلما أسلم كتم إسلامه، ولم يخبر اليهود، وطلب من النبي صلى الله عليه وسلم أن يسألهم عنه أولاً، فبعث رسول الله صلى الله عليه وسلم إليهم فقال: (أي رجل فيكم ابن سلام؟) قالوا: ذاك سيدنا وابن سيدنا، وأعلمنا وابن أعلمنا، فقال: (أفرأيتم إن أسلم؟) فقالوا: حاشا لله، ما كان ليسلم، فقال رسول الله صلى الله عليه وسلم: (يابن سلام، اخرج عليهم) فخرج فقال لهم: (يا معشر يهود، اتقوا الله، فوالله الذي لا إله إلا هو إنكم لتعلمون أنه رسول الله، وأنه جاء بالحق) فقالوا: كذبت. [البخاري].\nوهكذا كانت عداوة اليهود للنبي صلى الله عليه وسلم وللمسلمين واضحة منذ أول يوم في المدينة رغم أنهم يعرفون أنه رسول الله حقًّا وصدقًا، وقد اشتدوا في تكذيب رسول الله صلى الله عليه وسلم، وإظهار حقدهم عليه عند تحويل القبلة من بيت المقدس إلى الكعبة، وظهرت سفاهة عقولهم واضحة حين تشاوروا فيما بينهم، واتفقوا أن يؤمنوا بدين الله أول النهار، ويكفروا في آخره حتى يسعى الناس إلى تقليدهم، والسير على خطاهم، ولكن الله فضحهم بكفرهم في كتابه الحكيم، وأظهر حقدهم على المسلمين بعد تآلف قلوب أهل المدينة من الأوس والخزرج، وسعيهم إلى الوقيعة فيما بينهم، ولكنهم لم يفلحوا في ذلك.\nزواج الرسول صلى الله عليه وسلم من السيدة عائشة:\nوبعد ثمانية أشهر من الهجرة كان الرسول صلى الله عليه وسلم قد أنهى بناء المسجد، واستقر المسلمون في المدينة، فأتم الرسول صلى الله عليه وسلم زواجه بالسيدة عائشة ودخل بها، وكان قد عقد عليها قبل الهجرة، وكان الرسول\nصلى الله عليه وسلم بعد زواجه منها يقدرها، ويفضلها، فعن عمرو بن العاص قال: قلت يا رسول الله، أي الناس أحب إليك؟ قال: (عائشة) قلت: ومن الرجال؟ قال: (أبوها) _[الترمذي].",
    "number-en": "The messenger is in the city",
    "label-en": "Before the migration, Yathrib was rife with conflicts, wars, and intrigues. The fire of hostility was burning between the Aws and Khazraj tribes, and the war between them was a dispute. If one of them was victorious, the other would work with all his might to defeat him, until the men perished, the women became widows, and the children were orphaned. The Jews were standing behind the curtain, increasing the fire, supplying both sides with weapons, and stirring up enmity and strife between them. Hoping that they would eliminate each other, so that the Jews would have sovereignty and the first word in the city. The people of Yathrib gathered around Abdullah bin Abi bin Salul so that he would have the highest say in managing the city, but God wanted safety for the city. He wanted it to be the center of the Islamic state, so the procession of the Messenger of God, may God bless him and grant him peace, approached Medina, and its people gave him a great reception. The hope of each one of them was to host the Messenger, may God bless him and grant him peace, in his house. Whenever the camel carrying the Messenger of God, may God bless him and grant him peace, passed by a house, the people of that house would come out and cling to its reins, hoping that the Messenger of God, may God bless him and grant him peace, would come down to them. He used to say to them: (Leave the she-camel, for she is commanded) meaning, leave the she-camel, for she will stand alone where God Almighty commanded her.\nIn a place owned by two orphans from Banu al-Najjar, in front of the house of Abu Ayyub al-Ansari, the she-camel blessed, and he, may God’s prayers and peace be upon him, said: (God willing, this is the house.) So Abu Ayyub carried the Prophet, may God’s prayers and peace be upon him, to his house. [Ibn Ishaq] And suddenly, young girls from Bani al-Najjar came out, rejoicing at the arrival of the Messenger, may God bless him and grant him peace, and chanting:\nWe are neighbors from Banu al-Najjar, oh my love, Muhammad is from the neighborhood\nIn the two-storey house of Abu Ayyub al-Ansari, the Messenger of God, may God bless him and grant him peace, went downstairs, and Abu Ayyub said to him: O Prophet of God, may my father and mother be sacrificed for you. I hate and venerate that I be above you, and you are below me, so appear (go up) and you will be at the top, and we will come down and be at the bottom, so the Messenger of God, may God bless him and grant him peace, said:\n(O Abu Ayyub, It is more kind to us and to those who cover us if we are at the bottom of the house) - [Ahmed].\nThus, the Messenger, may God’s prayers and peace be upon him, did not burden the family, and the companion Abu Ayyub al-Ansari was generous in his hospitality. If he made food, he would not eat it with his wife until after the Messenger of God, may God’s prayers and peace be upon him, had eaten from it first, and then they would eat from where his fingers were, out of love for it and seeking his blessing. Building the mosque:\nThe Muslims in the city lived a safe and reassured life, filled with calm and tranquility, with the Messenger of God, may God bless him and grant him peace, among them in their new homeland. They had become a state whose religion was Islam, and whose leader was the Messenger, may God bless him and grant him peace. The first thing the Messenger, may God bless him and grant him peace, thought of was building a mosque in which they would gather, perform their prayers, settle their affairs, and consult about what concerned them. So, may God bless him and grant him peace, he bought the place where the camel had blessed; To build a mosque there. The Muslims gathered to build the mosque, and the Messenger of God, may God bless him and grant him peace, was with them, cleaning the place, carrying bricks with them, and participating in the construction. One cut palm trees, another dug the places for the columns, another erected the wall, another prepared the clay, and this carried the bricks. They all chanted:\nIf we sit while the Prophet is working, then that is a misleading act of ours.\nThey also sing::\nThere is no life except the life of the Hereafter, O God, have mercy on the Ansar and the Emigrants\nFrom the mosque, the Messenger of God, may God bless him and grant him peace, began organizing his state. The most important thing in this country were the individuals who lived in it. Because it promotes them and relies on them, the Muslims in Medina at that time were divided into two groups:\n-The immigrants, they are the people of Mecca who migrated with their religion to Medina.\n-The Ansar, who are the original people of Medina, who converted to Islam, hosted Muslims in their country, and supported the Messenger, may God bless him and grant him peace. At the beginning of the migration, the immigrants in Medina were suffering from loneliness and a feeling of alienation. The life and atmosphere of Medina differed from that of Mecca, which made most of them exposed to illness. So the Messenger of God, may God bless him and grant him peace, turned to his Lord and called on him to make Medina beloved to the hearts of the immigrants and to remove the disease of fever from them. So God Almighty responded to His Prophet and made the immigrants beloved to live in Medina, and they began to move in its streets and market with enthusiasm and joy as if they had been born and raised. In it. Al-Sulh bin Al-Aws and Al-Khazraj:\nThe Ansar were two large tribes: the Aws and the Khazraj, and wars continued between them before they embraced Islam. The Messenger, may God bless him and grant him peace, reconciled between them, and God removed enmity and hatred from their hearts, and replaced them with love, affection, and harmony.\nfraternization:\nNow that the immigrants have settled down and the situation of the Ansar has been improved, it remains for them to merge together and become Muslim brothers. There is no difference between an immigrant and an Ansari. Therefore, the Messenger of God, may God bless him and grant him peace, made a brotherhood between them and gave every immigrant a brother from the Ansar. Abu Bakr Al-Siddiq is a brother to Kharijah bin Zuhair. Omar bin Al-Khattab is a brother to Itban bin Malik, and Abdul Rahman bin Awf is a brother to Saad bin Al-Rabi’. Brotherhood was not just a word said, but rather the Muslims applied it in practical application. This is Saad bin Al-Rabi’ Al-Ansari taking his brother.\nAbd al-Rahman bin Awf, and offers to give him half of what he owns, but Abd al-Rahman bin Awf thanks him and says to him: May God bless your family and your money, but direct me to the market, and Abd al-Rahman went to him and he won and ate what he worked with. _[Bukhari].\nThis was not limited to Saad bin Al-Rabi’, but many of the Companions did it to the point that they would inherit from each other based on these brothers, so the immigrant would inherit his Ansari brother, and the Ansari would inherit his immigrant brother, and they continued to do so until God made inheritance between relatives. God Almighty praised the immigrants and the Ansar, and the Almighty said: {For the poor and the immigrants who were expelled from their homes and their wealth, seeking bounty from God and contentment, and they helped God. And His Messenger - those are the truthful ones. And those who lived in the abode and the faith before them love those who emigrated to them, and do not find in their hearts any need for what they were given, and prefer them over themselves, even if they were in poverty.\nGod Almighty gathered them together in one verse, and the Almighty said: {And those who believe and emigrate and strive in the cause of God and those who give shelter and support - these are the true believers. For them is forgiveness and a generous provision} [Al-Anfal: 74] In this safe and stable society, where every Muslim loves his brother, the Messenger of God, may God bless him and grant him peace, began to teach his companions the matters of their religion, calling them to all good and forbidding them from all evil. They carried out this, satisfied and happy with God’s guidance to them and the presence of the Messenger of God, may God bless him and grant him peace, among them. People began to flock to Medina, declaring their conversion to Islam and their joining of this organized state.\nJews in the city:\nJews and some polytheists who hated Islam and hated the establishment of its state lived with the Muslims in Medina. Therefore, the Messenger, may God bless him and grant him peace, established a treaty regulating the relationship between Muslims and others so that he would be safe from the deception of the infidels. These are some of the principles contained in the treaty:\n1- The Muhajireen and Ansar are a nation other than the people, cooperating with each other. They are one hand against those who are hostile to them.\n2- Their blood is preserved, so no believer kills a believer, and no believer supports an unbeliever against his fellow believer.\n3-Jews have their religious freedom and are not forced to convert to Islam.\n4-The Jews who live in the city participate in its defense, and do not aid the enemies of Islam, nor do they support them.\n5- Every oppressor, sinner, or negligent traitor who does not implement what is in this covenant will be subject to curse and wrath, and others will wage war against him.\n6-If a dispute occurs in any matter, the ruling is the Book of God and the Sunnah of His Prophet, may God bless him and grant him peace. Thus, the Messenger, may God bless him and grant him peace, clarified the rights and duties of each sect in Medina, and laid out the method by which they would deal with all honesty and justice. He did not oppress the Jews, but rather preserved their rights. Despite this, the Jews showed their ugly face and their hatred for the Messenger, may God bless him and grant him peace, despite their knowledge that he was truthful, and this became clear in their attitude towards Abdullah bin Salam when he converted to Islam. Abdullah bin Salam was one of the Jewish scholars and one of their masters. When he converted to Islam, he concealed his conversion to Islam and did not tell the Jews. He asked the Prophet, may God’s prayers and peace be upon him, to ask them about him first. So the Messenger of God, may God’s prayers and peace be upon him, sent to them and said: (Which man among you is Ibn Salam?) They said: That is our master and the son of our master, and the most knowledgeable of us and the son of the most knowledgeable of us. He said: (Have you thought that I should convert to Islam?) They said: God forbid, he would not have embraced Islam, so the Messenger of God, may God’s prayers and peace be upon him, said. He said: (O son of Salam, go out to them.) So he went out and said to them: (O community of Jews, fear God. By God, besides whom there is no god, you know that he is the Messenger of God. And he came with the truth.” They said: “You lied.” [Bukhari].\nThus, the enmity of the Jews to the Prophet, may God bless him and grant him peace, and to the Muslims was clear from the first day in Medina, even though they knew that he was the true and truthful Messenger of God. They escalated in their denial of the Messenger of God, may God bless him and grant him peace, and showed their hatred for him when he turned the qiblah from the Holy House to the Kaaba. The foolishness of their minds became clear when they consulted among themselves and agreed to believe in the religion of God at the beginning of the day, and disbelieve at the end of it, so that people would seek to imitate them and follow their example. Their mistake, but God exposed them for their disbelief in His wise book. Their hatred for the Muslims became apparent after the hearts of the people of Medina, including the Aws and Khazraj, united, and they sought to create a wedge between them, but they did not succeed in that.\nThe marriage of the Messenger, may God bless him and grant him peace, to Mrs. Aisha:\nEight months after the Hijra, the Messenger, may God bless him and grant him peace, had finished building the mosque, and the Muslims settled in the city. The Messenger, may God bless him and grant him peace, consummated his marriage to Mrs. Aisha and consummated her marriage, which he had contracted with her before the Hijra.\nAfter his marriage to her, may God’s prayers and peace be upon him, he appreciated her and favored her. On the authority of Amr bin Al-Aas, he said: I said, O Messenger of God, which people do I love to you? He said: (Aisha) I said: And who are the men? He said: (Her father) _[Al-Tirmidhi]."
  },
  {
    "number": "مرحلة الجهاد",
    "text": "",
    "label": "لقد ترك المسلمون مكة كلها للكفار، وهاجروا إلى المدينة، ولكن الصراع بينهما لم ينته، بل زاد عما كان عليه في مكة، واتخذ شكلا جديدًا، بعد أن نزل الإذن من الله بقتال المشركين، قال تعالى: {أذن للذين يقاتلون بأنهم ظلموا وأن الله على نصرهم لقدير . الذين أخرجوا من ديارهم بغير حق إلا أن يقولوا ربنا الله ولولا دفع الله الناس بعضهم ببعض لهدمت صوامع وبيع وصلوات ومساجد يذكر فيها اسم الله كثيرًا ولينصرن الله من ينصره إن الله لقوي عزيز . الذين إن مكناهم في الأرض أقاموا الصلاة وآتوا الزكاة وأمروا بالمعروف ونهوا عن المنكر ولله عاقبة الأمور} [الحج: 39-41].\nوقد أصبح المسلمون في المدينة قوة كبيرة بانضمام الأنصار إليهم، فلماذا لا يستردون حقوقهم المسلوبة؟ وخاصة أن المدينة تقع على الطريق بين مكة والشام حيث تمر قوافل أهل مكة التجارية، لذلك قرر رسول الله صلى الله عليه وسلم إرسال سرايا من جيش المسلمين يزعجون قريشًا ويستطلعون أخبارها، ومن هذه السرايا:\nسرية سيف البحر:\nفي شهر رمضان من السنة الأولى للهجرة خرج حمزة بن عبد المطلب ومعه ثلاثون من المهاجرين لاعتراض قافلة لقريش قادمة من الشام يقودها أبو جهل في ثلاثمائة رجل، ولكن رجلا اسمه مجدي بن عمرو صَالَحَ بين الفريقين، ولم يحدث قتال، وعرف الكفار منذ ذلك الوقت أن المسلمين مستعدون لمواجهتهم.\nسرية رابغ:\nوفي شهر شوال من السنة نفسها خرج عبيدة بن الحارث بن عبد المطلب ومعه ستون رجلا من المهاجرين، واعترضوا قافلة بقيادة أبي سفيان، وكان بينهما رمي بالنبال، ولكن لم يقع قتال.\nسرية الخرار:\nكانت في شهر ذي القعدة من السنة الأولى، وفيها خرج سعد بن أبي وقاص ومعه عشرون مسلمًا، ولكنهم لم يعثروا على القافلة التي خرجوا من\nأجلها، وهكذا تحول المسلمون من الضعف إلى القوة، وأصبحوا مصدرًا لرعب الكفار.\nغزوة الأبواء (ودان):\nوفي العام الثاني من الهجرة واصل الرسول صلى الله عليه وسلم إرسال السرايا لمعرفة أخبار أهل مكة، وليدرب المسلمين على مواجهة قريش، وكان صلى الله عليه وسلم يشارك في بعض هذه الأعمال العسكرية، ومن الغزوات التي شارك فيها غزوة الأبواء (ودان)، وفيها خرج رسول الله صلى الله عليه وسلم بنفسه مع سبعين من المهاجرين في شهر صفر لاعتراض قافلة لقريش، لكنه لم يلتقِ بها فعقد معاهدة مع بني ضمرة أمَّنَهُم على أنفسهم، ووعدوه ألا يحاربوه ولا يعينوا عليه أعداءه، وأن يقفوا إلى جانبه إذا دعاهم لذلك، وهكذا كان صلى الله عليه وسلم لا يترك صغيرة أو كبيرة يؤمِّن بها دولته، ويقوِّي علاقتها بجيرانها إلا فعلها.\nغزوة بواط:\nوفيها خرج النبي صلى الله عليه وسلم في شهر ربيع الأول من السنة الثانية، ومعه مائتان من الصحابة؛ لاعتراض قافلة لقريش يقودها أمية بن خلف لكنه لم يلحق بها.\nغزوة بدر الأولى:\nوسببها أن رجلا اسمه كرز بن جابر الفهري اعتدى هو وبعض المشركين على مراعي المدينة ومواشيها، فطارده الرسول صلى الله عليه وسلم وبعض المسلمين ولكنه فرَّ هاربًا، وقد وقعت هذه الغزوة قريبًا من بئر بدر ولذلك سميت بدر الأولى.\nغزوة العُشَيرة:\nوقد حاول فيها الرسول صلى الله عليه وسلم ومن معه اعتراض قافلة لقريش ذاهبة من مكة إلى الشام، ولكنه لم يدركها، فعقد رسول الله صلى الله عليه وسلم معاهدة مع بني مدلج حلفاء بني ضمرة.\n\nسرية نخلة:\nخرج فيها عبد الله بن جحش الأسدي مع ثمانية مهاجرين، وأمرهم الرسول صلى الله عليه وسلم أن يعسكروا بين مكة والطائف في مكان يسمى نخلة فمرت قافلة لقريش في آخر يوم من شهر الله الحرام رجب، فهاجمها عبد الله\nومن معه، فقتل من المشركين عمرو بن الحضرمي، وأسروا عثمان بن عبدالله بن المغيرة، والحكم بن كيسان، وفر نوفل بن عبد الله.\nوعادت السرية إلى رسول الله صلى الله عليه وسلم، فأنكر عليهم القتال في شهر الله الحرام، واشتد غضب المشركين، وقالوا: إن محمدًا قد أحل القتال في الأشهر الحرم، فاشتد ذلك على المسلمين؛ فأنزل الله -عز وجل- قوله: {يسألونك عن الشهر الحرام قتال فيه قل قتال فيه كبير وصد عن سبيل الله وكفر به والمسجد الحرام وإخراج أهله منه أكبر عند الله والفتنة أكبر من القتل} [_البقرة: 217].\nفهؤلاء المشركون الذين ينكرون على المسلمين القتال في الأشهر الحرم، قد فعلوا أكبر من ذلك، حين أشركوا بالله، وأخرجوا المؤمنين من ديارهم، وحرموهم من أموالهم وأولادهم وهذا أكبر عند الله -عز وجل- في الإثم والعقوبة.",
    "number-en": "Jihad stage",
    "label-en": "The Muslims left all of Mecca to the infidels, and migrated to Medina, but the conflict between them did not end. Rather, it increased from what it was in Mecca, and took a new form, after the permission was revealed from God to fight the polytheists. The Almighty said: {He has given permission to those who fight because they have wronged, and that God is able to grant them victory. Those who were expelled from their homes unjustly unless they said, “Our Lord is God.” And had God not repulsed the people one by another, the silos, synagogues, prayer halls, and mosques in which the name of God is frequently mentioned would have been demolished. And let God help whomever He helps. Indeed, God is Powerful, Mighty. Those who, if We establish them in the land, establish prayer and pay zakat, enjoin what is right and forbid what is wrong, and to Allah is the outcome of all matters.} [Al-Hajj: 39-41].\nThe Muslims in Medina had become a great force with the Ansar joining them, so why did they not regain their stolen rights? Especially since the city is located on the road between Mecca and the Levant, where the commercial caravans of the people of Mecca pass, so the Messenger of God, may God bless him and grant him peace, decided to send companies of the Muslim army to disturb the Quraysh and find out its news. Among these brigades:\nSaif Al-Bahr Company:\nIn the month of Ramadan in the first year of the Hijra, Hamza bin Abdul Muttalib went out with thirty of the immigrants to intercept a Quraysh convoy coming from the Levant led by Abu Jahl with three hundred men, but a man named Majdi bin Amr reconciled between the two groups, and no fighting occurred, and the infidels knew from that time that the Muslims were ready to confront them.\nRabigh Secret:\nIn the month of Shawwal of the same year, Ubaidah bin Al-Harith bin Abdul Muttalib went out with sixty men from the immigrants, and they intercepted a convoy led by Abu Sufyan, and there was archery shooting between them, but no fighting took place. Kharar Secret:\nIt was in the month of Dhul-Qa'dah of the first year, and in it Saad bin Abi Waqqas went out with twenty Muslims, but they did not find the caravan that they had left.\nHe postponed it, and thus the Muslims turned from weakness to strength, and they became a source of terror for the infidels.\nThe Battle of Al-Abwa (Wadan):\nIn the second year of the Hijra, the Messenger, may God’s prayers and peace be upon him, continued to send companies to find out news from the people of Mecca, and to train Muslims to confront the Quraysh. He, may God’s prayers and peace be upon him, participated in some of these military actions, and among the raids in which he participated was the Battle of Al-Abwa (Wadan). In it, the Messenger of God, may God’s prayers and peace be upon him, went out himself with seventy of the immigrants in the month of Safar to intercept a Quraysh caravan, but he did not meet them, so he made a treaty with the Banu Damra in which he gave them security for themselves, and they promised him that they would not fight him or help his enemies against him, and that they would stand by his side if he called them to do so. Thus, he, may God’s prayers and peace be upon him, would not leave a small or large one through which he could secure his state and strengthen its relationship with its neighbors unless he did it. Battle of Bawat:\nThe Prophet, may God bless him and grant him peace, went out in the month of Rabi’ al-Awwal of the second year, with two hundred companions. To intercept a Quraysh convoy led by Umayyah bin Khalaf, but he did not catch up with it.\nBadr's First Battle:\nThe reason for it was that a man named Karaz bin Jabir al-Fihri, along with some polytheists, attacked the city’s pastures and livestock. The Messenger, may God bless him and grant him peace, and some Muslims chased him, but he fled. This raid took place close to the Badr Well, and that is why it was called Badr the First. The raid of the clan:\nThe Messenger, may God bless him and grant him peace, and those with him tried to intercept a Quraysh caravan going from Mecca to the Levant, but he did not catch it, so the Messenger of God, may God bless him and grant him peace, concluded a treaty with Banu Mudlij, allies of Banu Damra.\n\nNakhla secret:\nAbdullah bin Jahsh Al-Asadi went out with eight immigrants, and the Messenger, may God bless him and grant him peace, ordered them to camp between Mecca and Taif in a place called Nakhla. A Quraysh caravan passed on the last day of the sacred month of Rajab, and Abdullah attacked it.\nAnd those with him. The polytheists killed Amr ibn al-Hadrami, and captured Uthman ibn Abdullah ibn al-Mughirah and al-Hakam ibn Kaysan. Nofal bin Abdullah fled.\nThe company returned to the Messenger of God, may God’s prayers and peace be upon him, and he denounced them for fighting in God’s sacred month. The anger of the polytheists intensified, and they said: Muhammad had permitted fighting during the sacred months, so this became more severe for the Muslims. So God Almighty revealed His saying: “They ask you about the sacred month, fighting during it. Say, fighting during it is great, and turning away from the path of God and disbelieving in it, and the Sacred Mosque and expelling its people from it is greater in the sight of God, and strife is greater than murder.” [_Al-Baqarah: 217]. These polytheists, who forbid Muslims from fighting during the sacred months, have done greater than that, when they associated others with God, expelled the believers from their homes, and deprived them of their money and children, and this is greater in the sight of God - the Almighty - in sin and punishment."
  },
  {
    "number": "تحويل القبلة",
    "text": "",
    "label": "كان المسلمون بعد هجرتهم إلى المدينة، يتوجهون في صلاتهم نحو بيت المقدس في فلسطين، وظلوا على ذلك ستة عشر شهرًا أو سبعة عشر شهرًا، وكان رسول الله صلى الله عليه وسلم ينظر إلى السماء داعيًا الله -تعالى- أن تكون قبلة المسلمين تجاه الكعبة، فاستجاب الله دعاء نبيه، وأنزل القرآن الكريم آمرًا المسلمين بالتوجه إلى المسجد الحرام بمكة في صلاتهم، قال تعالى: {قد نرى تقلب وجهك في السماء فلنولينك قبلة ترضاها فول وجهك شطر المسجد الحرام وحيث ما كنتم فولوا وجوهكم شطره} [البقرة: 144] وكان بعض المسلمين قد ماتوا قبل تحويل القبلة، فقال رجال من المسلمين: وددنا لو علمنا من مات منا قبل أن نصرف إلى القبلة (أي: المسجد الحرام) وكيف بصلاتنا نحو بيت المقدس؟ فأنزل الله: {وما كان الله ليضيع إيمانكم إن الله بالناس لرءوف رحيم} [_البقرة: 143].\nوقد شنَّ اليهود حربًا من الجدل على المسلمين إثر تحويل القبلة، إذ قالوا لرسول الله صلى الله عليه وسلم: يا محمد، ما ولاك عن قبلتك التي كنت عليها، وأنت تزعم أنك على ملة إبراهيم ودينه؟ ارجع إلى قبلتك التي كنت عليها نتبعك ونصدقك، فنزل قول الله تعالى: {سيقول السفهاء من الناس ما ولاهم عن قبلتهم التي كانوا عليها قل لله المشرق والمغرب يهدي من يشاء إلى صراط مستقيم} [البقرة: 142].\nوقال تعالى: {ولله المشرق والمغرب فأينما تولوا وجوهكم فثم وجه الله إن الله واسع عليم} [_البقرة: 115].\nوقال تعالى: {ليس البر أن تولوا وجوهكم قبل المشرق والمغرب ولكن البر من آمن بالله واليوم الآخر والملائكة والكتاب والنبيين} [البقرة: 177].\nفالله سبحانه رب الأمكنة والأزمنة جميعًا، ولقد كانت عودة المسلمين إلى الكعبة رجوعًا إلى الأصل الذي بناه أبو الأنبياء إبراهيم -عليه السلام- فتوجه المسلمون بعد ذلك إلى مكة كل يوم في صلاتهم خمس مرات، وكان تحويل القبلة في العام الثاني من الهجرة، وفي ذلك العام فرض الله الصوم والزكاة.                      ",
    "number-en": "Shifting the Qibla",
    "label-en": "After their migration to Medina, the Muslims were heading towards Jerusalem in Palestine in their prayers, and they continued that way for sixteen or seventeen months. The Messenger of God, may God bless him and grant him peace, was looking at the sky, calling on God - the Almighty - for the Muslims’ qibla to be towards the Kaaba. God answered the prayer of His Prophet, and revealed the Holy Qur’an, commanding the Muslims to turn to the Sacred Mosque in Mecca in their prayers. A qiblah that pleases you, so turn your face towards the Sacred Mosque, and wherever you are, turn your faces towards it.} [Al-Baqarah: 144] Some Muslims had died before turning the qiblah, so some Muslim men said: We wish we knew who among us died before we turned to the qiblah (i.e.: the Sacred Mosque), and how about our prayers towards Bayt al-Maqdis? So God revealed: {And God would not cause your faith to be lost. Indeed, God is Most Compassionate and Merciful to people} [_Al-Baqarah: 143].\nThe Jews launched a war of controversy against the Muslims after changing the qiblah, when they said to the Messenger of God, may God bless him and grant him peace: O Muhammad, what has turned you away from the qiblah you used to follow, when you claim that you follow the religion and religion of Abraham? Return to your qiblah which you used to follow. We will follow you and believe you. Then the words of God Almighty were revealed: {The foolish among people will say, ‘What has turned them away from the qiblah which they used to follow?’ Say, ‘To Allah belongs the east and the west. He guides whom He wills to a straight path.’” [Al-Baqarah: 142].\nAnd the Almighty said: {And to Allah belongs the East and the West, so wherever you turn your faces, there is the face of Allah. Indeed, Allah is Ample, All-Knowing} [_Al-Baqarah: 115].\nAnd God Almighty said: {Righteousness is not that you turn your faces towards the east and the west, but righteousness is he who believes in God and the Last Day and the angels and the Book and the prophets} [Al-Baqarah: 177].\nGod Almighty is the Lord of all places and times, and the return of the Muslims to the Kaaba was a return to the origin built by the father of the prophets, Abraham - peace be upon him - so the Muslims then headed to Mecca every day in their prayers five times, and the turning of the Qiblah was in the second year of the Hijra, and in that year God imposed fasting and zakat."
  }
]