[
  {
    "text": "قال صلى الله عليه وسلم: من صلى الفجر في جماعة ثم قعد يذكر الله حتى تطلع الشمس ثم صلى ركعتين كانت له كأجر حجة وعمرة تامة ، تامة ، تامة",
    "text-en": "He, may God’s prayers and peace be upon him, said: Whoever prays Fajr in congregation, then sits remembering God until the sun rises, then prays two rak’ahs, will have the reward of a complete, complete, complete Hajj and Umrah."
  },
  {
    "text": "قال صلى الله عليه وسلم: كلمتان خفيفتان على اللسان ، ثقيلتان في الميزان ، حبيبتان إلى الرحمن ( سبحان الله وبحمده سبحان الله العظيم )",
    "text-en": "He, peace and blessings of God be upon him, said: Two words that are light on the tongue, heavy on the scale, and beloved to the Most Merciful (Glory be to God and praise be to Him, Glory be to God the Great)"
  },
  {
    "text": "قال صلى الله عليه وسلم: من صام يوماً في سبيل الله باعد الله وجه من جهنم سبعين عاماً",
    "text-en": "He, may God bless him and grant him peace, said: Whoever fasts a day for the sake of God, God will keep him away from Hell for seventy years"
  },
  {
    "text": "قال صلى الله عليه وسلم: من صام يوماً في سبيل الله باعد الله وجه من جهنم سبعين عاماً",
    "text-en": "He, may God bless him and grant him peace, said: Whoever fasts a day for the sake of God, God will keep him away from Hell for seventy years"
  },
  {
    "text": "قال صلى الله عليه وسلم: من صلى علي واحدة صلى الله عليه عشر صلوات وحط عنه عشر خطيئات ورفع له عشر درجات",
    "text-en": "He, peace and blessings of God be upon him, said: Whoever prays over one person, God will bless him ten times, remove ten sins from him, and raise him ten degrees."
  },
  {
    "text": "من عاد مريضاً لم يزل في خرفة الجنة حتى يرجع",
    "text-en": "Whoever visits a sick person will remain in the depths of Paradise until he returns"
  },
  {
    "text": "قال صلى الله عليه وسلم: من قال حين يسمع النداء ، اللهم رب هذه الدعوة التامة و الصلاة القائمة آت محمداً الوسيلة والفضيلة وابعثه المقام المحمود الذي وعدته حلت له شفاعتي يوم القيامة",
    "text-en": "He, peace and blessings of God be upon him, said: Whoever says when he hears the call, O God, Lord of this perfect call and established prayer, give Muhammad the means and virtue and send him to the praiseworthy station that You promised him, my intercession will be granted to him on the Day of Resurrection."
  },
  {
    "text": "قال صلى الله عليه وسلم: من توضأ فأحسن الوضوء ، ثم قال أشهد إن لا إله إلا الله وحده لا شريك له ، وأشهد إن محمداً عبده ورسوله ، اللهم اجعلني من التوابين واجعلني من المتطهرين ، فتحت له أبواب الجنة الثمانية يدخل من أيها شاء",
    "text-en": "He, peace and blessings of God be upon him, said: Whoever performs ablution and performs it well, then says, “I bear witness that there is no god but God alone, with no partner, and I bear witness that Muhammad is His servant and His Messenger. O God, make me among those who repent and make me among those who purify themselves.” The eight gates of Paradise will be opened for him, and he may enter through whichever one he wishes."
  },
  {
    "text": "قال صلى الله عليه وسلم: من قرأ أية الكرسي دبر كل صلاة لم يمنعه من دخول الجنة إلا أن يموت",
    "text-en": "He, may God bless him and grant him peace, said: Whoever recites Ayat Al-Kursi after every prayer, nothing will prevent him from entering Paradise unless he dies."
  },
  {
    "text": "قال صلى الله عليه وسلم: من قال لا إله إلا الله وحده لا شريك له ، له الملك وله الحمد وهو على كل شئ قدير ، في يوم مئة مرة كانت له عدل عشر رقاب ، وكتبت له مئة حسنة ، ومحيت عنه مئة سيئة , وكانت له حرزاً من الشيطان يومه ذلك حتى يمسي ولم يأت أحد بأفضل مما جاء به الا رجل عمل أكثر منه",
    "text-en": "He, peace and blessings of God be upon him, said: Whoever says: There is no god but God alone, with no partner, to Him belongs dominion, to Him is praise, and He is capable of all things. One hundred times in a day, he will have the equivalent of ten slaves, a hundred good deeds will be recorded for him, a hundred bad deeds will be erased from him, and it will be a protection for him from Satan on that day until evening, and no one will bring anything better than what he brought except a man who has done more than him."
  },
  {
    "text": "قال صلى الله عليه وسلم: من صلى العشاء في جماعة فكأنما قام نصف ليله ، ومن صلى الصبح في جماعة فكأنما صلى الليل كله",
    "text-en": "He, may God’s prayers and peace be upon him, said: Whoever prays Isha’ in a group, it is as if he stayed up for half the night, and whoever prays Fajr in a group, it is as if he prayed the whole night."
  },
  {
    "text": "قال صلى الله عليه وسلم: من غسل يوم الجمعة و أغتسل ثم بكر وابتكر ومشي ولم يركب ودنا من الامام ، و أنصت ولم يلغ كان له بكل خطوة يخطوها من بيته إلى المسجد عمل سنة أجر صيامها و قيامها",
    "text-en": "He, may God’s prayers and peace be upon him, said: Whoever performs the ritual bath on Friday, takes a bath, then gets up early, rises early, walks, does not ride, and approaches the imam, and listens and does not cancel, will have the reward of every step he takes from his house to the mosque for every step he takes from his house to the mosque, a sunnah of reward for fasting and standing in prayer."
  },
  {
    "text": "قال صلى الله عليه وسلم: من صلى على جنازة فله قيراط ، فإن شهد دفنها فله قيراطان ، القيراط مثل أحد",
    "text-en": "He, may God’s prayers and peace be upon him, said: Whoever prays at a funeral gets one qirat, and if he witnesses its burial, he gets two qirats. A qirat is equivalent to one Uhud."
  },
  {
    "text": "قال صلى الله عليه وسلم: من قال حين يمسيى بسم الله الذي لا يضر مع اسمه شئ في الأرض ولا في السماء وهو السميع العليم - ثلاث مرات لم يصبه فجأة بلا ، حتى يصبح ، ومن قالها حين يصبح ثلاث مرات لم يصبه فجأة بلا ، حتى يمسي",
    "text-en": "He, may God’s prayers and peace be upon him, said: Whoever says in the evening, “In the Name of God, with whose name nothing on earth or in the sky can be harmed, and He is the All-Hearing, the All-Knowing” three times will not suddenly be struck by “no” until the morning, and whoever says it three times in the morning will not suddenly be struck by “no” until the evening."
  },
  {
    "text": "قال صلى الله عليه وسلم: من قرأ سورة الكهف يوم الجمعة أضاء له من النور ما بين الجمعتين",
    "text-en": "He, may God’s prayers and peace be upon him, said: Whoever recites Surah Al-Kahf on Friday, the light between the two Fridays will shine for him"
  },
  {
    "text": "قال صلى الله عليه وسلم: لأن أقول سبحان الله والحمد لله ولا إله إلا الله و الله اكبر ، أحب إلى مما طلعت عليه الشمس",
    "text-en": "He, may God’s prayers and peace be upon him, said: Because I say, Glory be to God, and praise be to God, and there is no god but God, and God is great, I love more than what the sun rises upon."
  },
  {
    "text": "قال صلى الله عليه وسلم: صوم يوم عرفه يكفر سنتين ماضيه ومتقبله ، وصوم عاشورا ، يكفر سنه ماضية",
    "text-en": "He, may God’s prayers and peace be upon him, said: Fasting on the day of Arafah atones for two past and future years, and fasting on Ashura atones for a past year."
  }
]