[
  {
    "number": "أبناء الرسول صلى الله عليه وسلم ",
    "text": "",
    "label": "رُزق النبيّ عليه السلام بثلاثةٍ ذكورٍ، وأربعة إناثٍ، وفيما يأتي ذكر بعض تفاصيلهم:\n\nرقيّة، وأمّها خديجة -رضي الله عنها-، طلّقها عتبة بن أبي لهب قبل الدخول بها، فتزوّجها عثمان -رضي الله عنه-، وأنجبت عبد الله، وتوفيت يوم غزوة بدر.\n\n\nزينب، وأمّها خديجة، وهي أكبر بنات الرسول عليه السلام، تزوّجت من أبي العاص بن الربيع، وأنجبت أمامة، وبالرغم من أنّ الإسلام فرّق بينهما فترةً من الزمن إلّا أنّ أبا العاص لم يتزوّج غيرها؛ رغبةً بها عن كُلّ من سواها، حتى أعلن إسلامه في السنة السادسة للهجرة، وهاجر إلى المدينة، فردّ النبيّ -عليه السلام- عليه زوجته زينب، ومكثت عنده إلى أن توفّيت في السنة الثامنة، وتوفّي بعدها زوجها بأربع سنواتٍ.\n\n\nأمّ كلثوم، وأمّها خديجة، تزوّجت أمّ كلثوم من عثمان بن عفان بعد وفاة أختها رقيّة، ومكثت عنده إلى أن توفّيت في العام التاسع للهجرة،\n\n\nفاطمة، وأمّها خديجة، وهي أحبّ بنات الرسول إليه وأشبههنّ به، وهي أصغر أخواتها كذلك، تزوّجت من عليّ بن أبي طالب -رضي الله عنه-، وكانت آخر من توفّي من عقب النبيّ عليه السلام.\n\n\nالقاسم، وأمّه خديجة، وبه كان يُكنّى رسول الله -صلّى الله عليه وسلّم-.\n\n\nعبد الله، وأمّه خديجة، وقد اختُلف في موعد ولادته؛ فقيل قبل البعثة وقيل بعدها ولذلك لقّب بالطيّب الطاهر.\n\n\nإبراهيم، وأمّه ماريّة القبطيّة -رضي الله عنها-، وُلد في المدينة في السنة الثامنة للهجرة.",
    "number-en": "The sons of the Messenger, may God bless him and grant him peace",
    "label-en": "The Prophet, peace be upon him, was blessed with three males and four females, and some of their details are mentioned below:\n\nRuqayyah, and her mother Khadija - may God be pleased with her - Utbah bin Abi Lahab divorced her before consummating the marriage with her, so Othman - may God be pleased with him - married her, and she gave birth to Abdullah, and she died on the day of the Battle of Badr.\n\n\nZainab and her mother, Khadija, who is the eldest daughter of the Messenger, peace be upon him, married Abu Al-Aas bin Al-Rabi’, and gave birth to Umamah. Although Islam separated them for a period of time, Abu Al-Aas did not marry anyone else. Desiring her more than anyone else, until he declared his conversion to Islam in the sixth year of the Hijra, and immigrated to Medina, then the Prophet - peace be upon him - returned his wife Zainab to him, and she stayed with him until she died in the eighth year, and her husband died four years after that.\n\n\nUmm Kulthum and her mother Khadija. Umm Kulthum married Othman bin Affan after the death of her sister Ruqayyah, and she stayed with him until she died in the ninth year of the Hijra.\n\n\nFatima, and her mother, Khadija, is the most beloved of the Prophet’s daughters and the most similar to him, and she is also the youngest of her sisters. She married Ali bin Abi Talib - may God be pleased with him - and she was the last to die following the Prophet, peace be upon him.\n\n\nAl-Qasim, and his mother Khadija, and he was the nickname of the Messenger of God - may God bless him and grant him peace.\n\n\nAbdullah, and his mother Khadija, and the date of his birth was disputed. It was said before the mission and it was said after it, and that is why he was called the pure and pure.\n\n\nIbrahim and his mother, Maria the Coptic - may God be pleased with her - were born in Medina in the eighth year of the Hijra."
  },
  {
    "number": "زوجات الرسول صلى الله عليه وسلم ",
    "text": "",
    "label": "ُعَدّ النبيّ محمد-صلّى الله عليه وسلّم- أفضل الأنبياء، وخاتمهم، وقد خصّه الله بخصائص كثيرة تميّزه عن غيره، منها الزواج بأكثر من أربع نساء؛ فقد تزوّج بإحدى عشرة زوجة شرّفهنّ الله بقوله: (النَّبِيُّ أَوْلَى بِالْمُؤْمِنِينَ مِنْ أَنفُسِهِمْ وَأَزْوَاجُهُ أُمَّهَاتُهُمْ)، وهنّ أيضاً زوجاته -صلّى الله عليه وسلّم- في الجنّة، وقد تُوفّي رسول الله وهو راضٍ عنهنّ، وعددهنّ حينئذٍ تسع، وهنّ: سودة، وعائشة، وحفصة، وأم سلمة، وزينب بنت جحش، وأم حبيبة، وجويرية، وصفيّة، وميمونة -رضي الله عنهنّ-.",
    "number-en": "The wives of the Messenger, may God bless him and grant him peace",
    "label-en": "The Prophet Muhammad - may God bless him and grant him peace - is considered the best of the prophets, and their seal. God has bestowed upon him many characteristics that distinguish him from others, including marrying more than four women. He married eleven wives, whom God honored by saying: (The Prophet has more right to the believers than they themselves, and his wives are their mothers), and they are also his wives - may God bless him and grant him peace - in Paradise, and the Messenger of God died while he was satisfied with them, and their number is Then there were nine, and they were: Sawda, Aisha, Hafsa, Umm Salamah, Zainab bint Jahsh, Umm Habibah, Juwayriyah, Safiyya, and Maimuna - may God be pleased with them."
  },
  {
    "number": "ترتيب زوجات الرسول صلى الله عليه وسلم",
    "text": "",
    "label": "تعدّدت أقوال المؤرخين من أهل السّير في موضوع الترتيب الزمني لزواج النبيّ -صلّى الله عليه وسلّم من أمّهات المؤمنين؛ ومنشأ ذلك كان بسبب اختلاف الآراء في الأمر الضابط لاعتماد الزواج، هل يكون بمجرد عقد النكاح أم بالدّخول، وعلى الرأي الذي يرى اعتماد الزواج بالدّخول بهنّ فإنّ ترتيبهنّ يكون على النحو الآتي:\n\nخديجة بنت خويلد -رضي الله عنها-.\nسودة بنت زمعة -رضي الله عنها-.\nعائشة بنت أبي بكر -رضي الله عنها-.\nحفصة بنت عمر بن الخطاب -رضي الله عنها-.\nزينب بنت خزيمة -رضي الله عنها-.\nأم سلمة -رضي الله عنها-.\nزينب بنت جحش -رضي الله عنها-.\nجويريّة بنت الحارث -رضي الله عنها-.\nصفيّة بنت حُيَيّ -رضي الله عنها-.\nأم حبيبة -رضي الله عنها-.\nميمونة بنت الحارث -رضي الله عنها-.",
    "number-en": "Ranking of the Prophet’s wives, may God bless him and grant him peace",
    "label-en": "There are many statements by biographers on the subject of the chronological order of the Prophet’s marriage, may God bless him and grant him peace, to the mothers of the believers. The origin of this was due to the difference of opinions regarding the matter governing the approval of marriage, whether it is done by simply contracting the marriage or by consummation. According to the opinion that considers marriage to be approved by consummation of them, their order is as follows:\n\nKhadija bint Khuwaylid - may God be pleased with her -.\nSawda bint Zam’a - may God be pleased with her -.\nAisha bint Abi Bakr - may God be pleased with her -.\nHafsa bint Omar bin Al-Khattab - may God be pleased with her -.\nZainab bint Khuzaymah - may God be pleased with her -.\nUmm Salamah - may God be pleased with her -.\nZainab bint Jahsh - may God be pleased with her -.\nJuwayriyah bint Al-Harith - may God be pleased with her -.\nSafiya bint Huyay - may God be pleased with her -.\nUmm Habiba - may God be pleased with her -.\nMaymunah bint Al-Harith - may God be pleased with her -."
  },
  {
    "number": "نبذه عن حياة زوجات الرسول صلى الله عليه وسلم ",
    "text": "",
    "label": "خديجة بنت خويلد\n\nهي أمّ المؤمنين خديجة بنت خويلد بن أسد بن عبد العزى القُرَشيّة، وأمّها فاطمة بنت زائدة، وقد كانت -رضي الله عنها- امرأة غنيّة تستأجر الرجال؛ للعمل في تجارتها، وسمعت بصدق رسول الله، وأمانته، فأحبّت أن تستأجره، فوافق النبيّ على ذلك، وبدأت تجارتها بالزيادة والربح أضعاف ما كانت عليه، فأُعجِبت بشخص النبيّ، وعَرضت الزواج عليه عن طريق صديقتها نفيسة بنت منية، فقَبِل النبيّ بذلك، وكان أبوها خويلد هو من تولّى أمر زواجها.\n\nوقد كانت -رضي الله عنها- مثالاً للزوجة الصالحة، ولها العديد من الفضائل؛ فهي أوّل من شهد أن لا إله إلا الله، وأنّ محمداً رسول الله على الإطلاق، وهي أمّ لأبناء رسول الله جميعهم ما عدا إبراهيم الذي أنجبَته مارية القبطية، كما أنّها بُشِّرَت بالجنّة، ونالت شَرف السلام من الله، وجبريل -عليه السلام-. وتجدر الإشارة إلى أنّ السيّدة خديجة -رضي الله عنها- تُوفِّيت في شهر رمضان عن عُمْر خمسٍ وستّين سنة، وقد سبّب هذا الحدث الحزن الشديد لرسول الله؛ فقد كانت -رضي الله عنها- قرّة عينه، ورفيقته في السرّاء والضراء، إذ استمرّ زواجه بها خمساً وعشرين سنة.   ",
    "number-en": "A summary of the lives of the Prophet’s wives, may God bless him and grant him peace",
    "label-en": "Khadija bint Khuwaylid\n\nShe is the Mother of the Believers, Khadija bint Khuwaylid bin Asad bin Abd al-Uzza al-Qurashiyah, and her mother is Fatima bint Zaida. She was - may God be pleased with her - a rich woman who hired men. To work in her trade, and she heard of the sincerity and honesty of the Messenger of God, so she wanted to hire him, so the Prophet agreed to that, and her business began to increase and profit many times what it was, so she admired the person of the Prophet, and she proposed marriage to him through her friend Nafisa bint Munya, so the Prophet accepted that, and her father, Khuwaylid, was the one who took care of her marriage.\n\nShe - may God be pleased with her - was an example of a good wife, and she had many virtues. She is the first to bear witness that there is no god but God, and that Muhammad is the Messenger of God at all, and she is the mother of all of the sons of the Messenger of God except Abraham, whom Maria the Coptic gave birth to. She was also given the good tidings of Paradise, and received the honor of peace from God and Gabriel - peace be upon him. It should be noted that Mrs. Khadija - may God be pleased with her - died in the month of Ramadan at the age of sixty-five years, and this event caused great sadness for the Messenger of God. She - may God be pleased with her - was the apple of his eye, and his companion in good and bad times, as his marriage to her lasted twenty-five years."
  },
  {
    "number": "سودة بنت زمعة",
    "text": "",
    "label": "هي أم المؤمنين سودة بنت زمعة بن قيس بن عبد شمس بن عبد ود بن نصر بن مالك، وأمّها الشموس بنت قيس بن زيد من بني النجّار، كانت مُتزوِّجة من السكران بن عمرو، وقد تُوفِّي عنها بعد إسلامه، وتزوّجها النبيّ -عليه الصلاة والسلام- بعد وفاة أم المؤمنين خديجة -رضي الله عنها- بثلاث سنوات؛ حيث خطبتها له خولة بنت حكيم، فوافق على ذلك؛ إذ عاش وحيداً بعد فِراق زوجته خديجة طوال هذه الفترة.\n\nوقد ورد الكثير من الفضائل في ما يتعلّق بأمّ المؤمنين سودة -رضي الله عنها-، من ذلك أنّها جعلت يومها من رسول الله لعائشة -رضي الله عنها- عندما كبرت؛ حرصاً منها على البقاء في عِصمته -صلّى الله عليه وسلّم-، وحبّاً به، وابتغاءً لمرضاته، روى مسلم عن أم المؤمنين عائشة -رضي الله عنها- أنّها قالت: (ما رَأَيْتُ امْرَأَةً أَحَبَّ إلَيَّ أَنْ أَكُونَ في مِسْلَاخِهَا مِن سَوْدَةَ بنْتِ زَمْعَةَ، مِنِ امْرَأَةٍ فِيهَا حِدَّةٌ، قالَتْ: فَلَمَّا كَبِرَتْ، جَعَلَتْ يَومَهَا مِن رَسولِ اللهِ صَلَّى اللَّهُ عليه وَسَلَّمَ لِعَائِشَةَ، قالَتْ: يا رَسولَ اللهِ، قدْ جَعَلْتُ يَومِي مِنْكَ لِعَائِشَةَ، فَكانَ رَسولُ اللهِ صَلَّى اللَّهُ عليه وَسَلَّمَ، يَقْسِمُ لِعَائِشَةَ يَومَيْنِ، يَومَهَا وَيَومَ سَوْدَةَ). ويُشار إلى أنّ وفاتها -رضي الله عنها- كانت في آخر خِلافة عمر بن الخطّاب، وقِيل سنة أربع وخمسين، في خلافة معاوية بن أبي سفيان -رضي الله عنهم- جميعاً.  ",
    "number-en": "Sawda bint Zam'a",
    "label-en": "She is the Mother of the Believers, Sawda bint Zam’a bin Qais bin Abd Shams bin Abd Wad bin Nasr bin Malik, and her mother Al-Shumos bint Qais bin Zaid from Banu Al-Najjar. She was married to Al-Sakran bin Amr, and he died from her after his conversion to Islam. The Prophet, peace and blessings be upon him, married her three years after the death of the Mother of the Believers, Khadija - may God be pleased with her. Khawla bint Hakim proposed to him, and he agreed to that. He lived alone after separating from his wife, Khadija, throughout this period.\n\nMany virtues have been mentioned regarding the Mother of the Believers Sawda - may God be pleased with her - including that she made her day from the Messenger of God to Aisha - may God be pleased with her - when she grew up; Out of her desire to remain infallible to him - may God bless him and grant him peace - and out of love for him and seeking to please him, Muslim narrated on the authority of the Mother of the Believers Aisha - may God be pleased with her - that she said: (I have not seen a woman more beloved to me to be in her slaughterhouse than Sawda bint Zamah. From a woman who was sharp. She said: When she grew up, she made her day from the Messenger of God, may God bless him and grant him peace, to Aisha. She said: O Messenger of God, I made my day from you. For Aisha, so the Messenger of God, may God bless him and grant him peace, used to allocate two days to Aisha, her day and the day of Sawdah. It is noteworthy that her death - may God be pleased with her - occurred at the end of the caliphate of Omar bin Al-Khattab, and it was said in the year fifty-four, in the caliphate of Muawiyah bin Abi Sufyan - may God be pleased with them all."
  },
  {
    "number": "عائشة بنت أبي بكر ",
    "text": "",
    "label": "وهي أمّ المؤمنين عائشة بنت أبي بكر الصدّيق -رضي الله عنهما-، وأمّها أم رومان بنت عامر بن عويمر،تزوّجها النبيّ بعد وفاة أمّ المؤمنين خديجة -رضي الله عنها-؛ إذ جاءت خولة بنت حكيم تعرض على الرسول الزواج بعائشة -رضي الله عنها-، فقَبِلَ بها، وكان عمرها ستّ سنوات، وكانوا يعتقدون في الجاهلية أنّ المؤاخاة تمنع المصاهرة، فأُشكِل الأمر على أبي بكر، إلّا أنّ النبي بيّن له أنّه أخوه في الدين، وهي له حلال، وكان ذلك في شوّال من السنة الثالثة قبل الهجرة، وكان مَهرها اثنتي عشرة أوقية ونصفاً، وقد دخل بها بعد ثلاث سنين؛ أي في السنة الأولى للهجرة، وتُوفِّي عنها وعمرها ثماني عشرة سنة.\n\n\nوكانت عائشة -رضي الله عنها- من أفقه نساء الأمة، حتى إذا أُشكِل أمر على الصحابة رجعوا إليها، وقد وردت فضائلها الكثيرة في القرآن، والسنّة، ومن ذلك:\n\nقوله تعالى: (لَّوْلَا إِذْ سَمِعْتُمُوهُ ظَنَّ الْمُؤْمِنُونَ وَالْمُؤْمِنَاتُ بِأَنفُسِهِمْ خَيْرًا وَقَالُوا هَـذَا إِفْكٌ مُّبِينٌ)، حيث شهد الله لها بالمنزلة العالية من الايمان، والعِفّة.\nرواية الإمام البخاريّ عن عمرو بن العاص أنّه قال: (أنَّ النبيَّ صَلَّى اللهُ عليه وسلَّمَ، بَعَثَهُ علَى جَيْشِ ذَاتِ السُّلَاسِلِ، فأتَيْتُهُ فَقُلتُ: أيُّ النَّاسِ أحَبُّ إلَيْكَ؟ قَالَ: عَائِشَةُ، فَقُلتُ: مِنَ الرِّجَالِ؟ فَقَالَ: أبُوهَا)، حيث صرَّح النبيّ -عليه السلام- بأنّها أحبّ الأزواج إليه، أمّا وفاتها -رضي الله عنها- فقد كانت في السابع عشر من رمضان سنة ثمان وخمسين للهجرة عن عُمْر سبعة وستّين عاماً، ودُفِنَت في البقيع.                      ",
    "number-en": "Aisha bint Abi Bakr",
    "label-en": "She is the Mother of the Believers, Aisha bint Abu Bakr Al-Siddiq - may God be pleased with them both - and her mother is Umm Ruman bint Amer bin Uwaimer. The Prophet married her after the death of the Mother of the Believers Khadija - may God be pleased with her -; Khawla bint Hakim came and proposed to the Messenger to marry Aisha - may God be pleased with her - and he accepted her. She was six years old, and they believed in pre-Islamic times that fraternization prevented marriage, so the matter was problematic for Abu Bakr, except that the Prophet explained to him that he was his brother in religion, and she was permissible for him. This was in Shawwal of the third year before the Hijra, and her dowry was twelve and a half ounces, and he consummated the marriage with her three years later. That is, in the first year of the Hijra, he died when she was eighteen years old.\n\n\nAisha - may God be pleased with her - was one of the most intelligent women of the nation, so much so that when the Companions faced a problem, they would turn to her. Her many virtues were mentioned in the Qur’an and Sunnah, including:\n\nGod Almighty says: (If only when you heard it, the believing men, both male and female, thought good about themselves and said, “This is clear falsehood,” where God testified to her high status of faith and chastity.\nImam al-Bukhari’s narration on the authority of Amr ibn al-Aas is that he said: (The Prophet, may God’s prayers and peace be upon him, sent him to the army of Dhat al-Silasal, so I came to him and said: Which of the people is most beloved to you? He said: Aisha, so I said: Who are the men? He said: Her father), as the Prophet - peace be upon him - declared that she was the most beloved of his husbands. As for her death - may God be pleased with her - it was on the seventeenth of Ramadan in the year fifty-eight AH, at the age of sixty-seven years, and she was buried in Al-Baqi’."
  },
  {
    "number": "حفصه بنت عمر بن الخطاب ",
    "text": "",
    "label": "وهي أمّ المؤمنين حفصة بنت عمر بن الخطّاب، وأمّها زينب بنت مظعون بن حبيب، وُلِدت قبل البعثة بخمس سنين، وكانت -رضي الله عنها- مُتزوِّجة من خُنَيس السهميّ -رضي الله عنه-، والذي استُشهِد بعد غزوة أحد سنة ثلاث للهجرة؛ إثر إصابات ألمّت به، وقِيل بعد غزوة بدر، فحزن عمر -رضي الله عنه- على ابنته الشابّة؛ لما تشعر به من الوحدة والترمُّل، فعرض -بعد انقضاء عدّتها بقليلٍ- على صديقَيه أبي بكر، وعثمان -رضي الله عنهما- الزواج بها، فلم يلقَ الجواب الذي أمِلَ به منهما، وكان قد عَلِم لاحقاً أنّهما قد سَمِعَا النبيّ يذكرها، فخطبها النبيّ، وكان صداقها بِساطاً، ووسادتَين، وكساءً، ورداءَين أخضرَين.\n\nوقد تميّزت -رضي الله عنها- بعِلمها، وحِرصها على التعلُّم؛ فقد رَوت عن رسول الله، وعن أبيها ستّين حديثاً، وعُرِفت بفصاحتها، وبلاغتها، وتأثُّر كلامها وأسلوبها بالقرآن، كما أنّها كانت من ذوات الرأي والمشورة؛ لرجاحة عقلها، أمّا وفاتها -رضي الله عنها- فقد كانت عن عُمرٍ ناهز الستّين عاماً في شعبان سنة خمس وأربعين، وقِيل إحدى وأربعين للهجرة في جمادى، وذُكِر أنّ قبرها في المدينة.                      ",
    "number-en": "Hafsa bint Omar bin Al-Khattab",
    "label-en": "She is the Mother of the Believers, Hafsa bint Omar bin Al-Khattab, and her mother is Zainab bint Maz’un bin Habib. She was born five years before the mission, and she - may God be pleased with her - was married to Khunnis Al-Sahmi - may God be pleased with him -, who was martyred after the Battle of Uhud in the year three of the Hijra. As a result of injuries he suffered, and it was said after the Battle of Badr, Omar - may God be pleased with him - became sad for his young daughter. Because of her feeling of loneliness and widowhood, he proposed - shortly after the end of her waiting period - to his two friends Abu Bakr and Othman - may God be pleased with them - to marry her, but he did not receive the answer he had hoped for from them, and he had learned later that they had heard the Prophet mentioning her, so the Prophet proposed to her, and her dowry was a rug, two pillows, a cloak, and two green robes.\n\nShe was distinguished - may God be pleased with her - by her knowledge and her eagerness to learn. She narrated sixty hadiths on the authority of the Messenger of God and on the authority of her father, and she was known for her eloquence and eloquence, and her words and style were influenced by the Qur’an. She was also one of those with opinions and advice. Because of her sound mind, as for her death - may God be pleased with her - she was over sixty years old in Shaban in the year forty-five, and it was said that it was forty-one AH in Jumada, and it was mentioned that her grave is in Medina."
  },
  {
    "number": "زينب بنت خزيمة",
    "text": "",
    "label": "وهي أمّ المؤمنين زينب بنت خزيمة بن الحارث بن عبد الله بن عمرو بن عبد مناف، استشهد زوجها عبد الله بن جحش في غزوة أُحد، وبعد أن عَلم النبيّ بخبر ترمُّلها تزوّجها، وكان ذلك في العام الثالث من الهجرة في شهر رمضان، ولم تستمرّ حياتها مع النبيّ سوى شهرَين أو أكثر، ثمّ تُوفِّيت -رضي الله عنها- في المدينة المُنوَّرة عن عُمر ناهز الثلاثين عاماً.\n\nويُشار إلى أنّ أم المؤمنين زينب -رضي الله عنها- كانت تُسمّى بأمّ المساكين في الجاهليّة؛ لعَطفها، وحنانها عليهم، وعندما أسلمت شاركت في معركة بدرٍ من خلال تقديم الرعاية للجرحى.                      ",
    "number-en": "Zainab bint Khuzaymah",
    "label-en": "She is the Mother of the Believers, Zainab bint Khuzaymah bin Al-Harith bin Abdullah bin Amr bin Abd Manaf. Her husband, Abdullah bin Jahsh, was martyred in the Battle of Uhud. After the Prophet learned of her widowhood, he married her. This was in the third year of the Hijra in the month of Ramadan, and her life with the Prophet only lasted two months or more. Then she died - may God be pleased with her - in Medina at the age of thirty years.\n\nIt is noteworthy that the Mother of the Believers, Zainab - may God be pleased with her - was called the Mother of the Poor in pre-Islamic times. For her kindness and compassion towards them, and when she converted to Islam, she participated in the Battle of Badr by providing care for the wounded."
  },
  {
    "number": "أم سلمة ",
    "text": "",
    "label": "وهي أمّ المؤمنين أمّ سلمة، هند بنت أبي أمية ابن المغيرة بن عبدالله، قُرَشيّة من بني مخزوم، وأمّها عاتكة بنت عامر بن ربيعة، وقد كانت -رضي الله عنها- مُتزوّجة من أبي سلمة -رضي الله عنه-، فعندما تُوفِّي دَعَت الله أن يُخلِفها خيراً منه، فتقدّم لها رسول الله؛ تكريماً لها، ولزوجها؛ فقد بذلا الكثير في سبيل الدعوة، وحناناً منه على صِبيانها، ودخل بها في شوّال، أو جمادى الآخرة سنة أربع للهجرة، وتولّى ابنها عمر أمر تزويجها، وكان صداقها صُحفة كثيفة؛ وهي آنية الطعام،، وفراش حَشوُه ليف؛ والليف هو: قشور النخل،، ورحىً؛ أي أداة الطحن.\n\nوقد تميّزت أم سلمة -رضي الله عنها- بالكثير من الفضائل التي خَصّها الله بها عن غيرها من أمّهات المؤمنين، ومنها: رجاحة عقلها، وفصاحتها، وبلاغتها؛ فقد اكتسبت ذلك من آبائها، وأجدادها، ومن عَيشها في بيت النبوّة، كما أنّها عُرِفت بعِلمها الشرعيّ الغزير؛ فقد رَوت الكثير عن رسول الله -عليه السلام-، ورُوِيَ عنها الكثير، وكانت سبباً في نزول بعض آيات القرآن الكريم. أمّا وفاتها -رضي الله عنها- فقد كانت في خِلافة يزيد بن معاوية سنة تسعٍ وخمسين للهجرة، عن عُمرٍ ناهز التسعين عاماً، ودُفِنَت في البقيع، وهي آخر زوجات النبيّ موتاً، وقِيل إنّ آخرهنّ هي السيّدة ميمونة، وقِيل إنّها حفصة.",
    "number-en": "Umm Salamah",
    "label-en": "She is the Mother of the Believers, Umm Salamah, Hind bint Abi Umayyah Ibn al-Mughirah bin Abdullah, a Qurayshite from Banu Makhzum, and her mother is Atika bint Amer bin Rabi’ah. She - may God be pleased with her - was married to Abu Salamah - may God be pleased with him. When he died, she prayed to God to give her a better successor than him, so the Messenger of God proposed to her. In honor of her and her husband; They did a lot for the sake of the call, and he was kind to her children, and he consummated marriage with her in Shawwal, or Jumada al-Akhirah, in the year four AH, and her son Omar took charge of her marriage, and her dowry was a large sum of money. It is a dining utensil, and a mattress stuffed with fiber. Fiber is: palm husks, and millstones. Any grinding tool.\n\nUmm Salamah - may God be pleased with her - was distinguished by many virtues that God bestowed upon her from other mothers of the believers, including: her clear mind, her eloquence, and her eloquence. She acquired this from her fathers, grandfathers, and from living in the House of Prophethood, and she was also known for her abundant legal knowledge. She narrated a lot about the Messenger of God, peace be upon him, and many things were narrated about her, and she was the reason for the revelation of some verses of the Holy Qur’an. As for her death - may God be pleased with her - it was during the caliphate of Yazid bin Muawiyah in the year fifty-nine AH, at the age of ninety years, and she was buried in Al-Baqi. She was the last of the Prophet’s wives to die, and it was said that the last of them was Mrs. Maimuna, and it was said that she was Hafsa."
  },
  {
    "number": "زينب بنت جحش ",
    "text": "",
    "label": "وهي أمّ المؤمنين زينب بنت جحش بن رئاب بن يعمر بن صبر بن مرة، ابنة عمّة رسول الله؛ فأمّها أميمة بنت عبد المطلب بن هاشم، وكانت مُتزوّجة من مولى رسول الله زيد بن حارثة -رضي الله عنه-، وعندما طلَّقها، أمر الله نبيَّه بالزواج منها بقوله: (فَلَمَّا قَضَى زَيْدٌ مِّنْهَا وَطَرًا زَوَّجْنَاكَهَا لِكَيْ لَا يَكُونَ عَلَى الْمُؤْمِنِينَ حَرَجٌ فِي أَزْوَاجِ أَدْعِيَائِهِمْ إِذَا قَضَوْا مِنْهُنَّ وَطَرًا وَكَانَ أَمْرُ اللَّـهِ مَفْعُولًا)،ولهذا كانت تَفخر -رضي الله عنها- بأنّ الله زوّجَها من فوق سبع سموات بلا وليٍّ ولا شاهدٍ كما ورد في قولها: ( إنَّ اللَّهَ أنْكَحَنِي في السَّمَاءِ). أمّا وفاتها -رضي الله عنها- فقد كانت سنة عشرين للهجرة في خلافة عمر بن الخطّاب -رضي الله عنه-.\n\nوقد وردت فضائلها، ومناقبها -رضي الله عنها- واضحةً بنصّ الآيات، والأحاديث، ومن ذلك:\n\nقوله تعالى: (فَلَمَّا قَضَى زَيْدٌ مِّنْهَا وَطَرًا زَوَّجْنَاكَهَا)، فكان لها الشرف العظيم -رضي الله عنها- عندما تولّى الله -سبحانه- أمرَ تزويجها برسول الله.\nقول رسول الله -صّلى الله عليه وسلّم-: (أَسْرَعُكُنَّ لَحَاقًا بي أَطْوَلُكُنَّ يَدًا. قالَتْ: فَكُنَّ يَتَطَاوَلْنَ أَيَّتُهُنَّ أَطْوَلُ يَدًا. قالَتْ: فَكَانَتْ أَطْوَلَنَا يَدًا زَيْنَبُ، لأنَّهَا كَانَتْ تَعْمَلُ بيَدِهَا وَتَصَدَّقُ)، فقد بشّرها رسول الله بأنّها أوّل زوجاته لحاقاً به، وأثنى عليها بكثرة تصدُّقها.                      ",
    "number-en": "Zainab bint Jahsh",
    "label-en": "She is the Mother of the Believers, Zainab bint Jahsh bin Ri'ab bin Ya'mar bin Sabr bin Murrah, the paternal aunt of the Messenger of God. Her mother was Umaima bint Abdul Muttalib bin Hashim, and she was married to the servant of the Messenger of God, Zaid bin Haritha - may God be pleased with him. There is no blame on the believers for the wives of their pretenders when they have fulfilled their duty and the command of God is being carried out. That is why she was proud - may God be pleased with her - that God had married her off from above the seven heavens without a guardian or a witness, as stated in her saying: (God granted me a marriage in heaven.) As for her death - may God be pleased with her - it was in the twentieth year of the Hijra during the caliphate of Omar bin Al-Khattab - may God be pleased with him.\n\nHer virtues and virtues - may God be pleased with her - have been mentioned clearly in the text of the verses and hadiths, including:\n\nGod Almighty says: (And when Zaid had completed his period with her, We made her in marriage to you), so she had the great honor - may God be pleased with her - when God - Glory be to Him - took charge of her marriage to the Messenger of God.\nThe Messenger of God - may God bless him and grant him peace - said: “The quickest of you to catch up with me is the one who has the longest hand.” She said: “So they were fighting each other, ‘O you who have the longest hand.’” She said: “The one who has the longest hand among us was Zainab.” Because she used to work with her hands and give alms), the Messenger of God gave her good news that she was the first of his wives to follow him, and he praised her for her abundance of alms."
  },
  {
    "number": "جويريه بنت الحارث ",
    "text": "",
    "label": "كانت أمّ المؤمنين جويريّة بنت الحارث -رضي الله عنها- من بني المصطلق، وكان والدها الحارث زعيمَهم، فأراد قتال رسول الله؛ إرضاءً لغطرسته، وحبّاً في السُّلطة، إلّا أنّه هُزِم أمام رسول الله، ووقع أكثر من سبعمئة منهم أسرى في يده، ومنهم ابنة الحارث (برّة) التي أسماها رسول الله فيما بعد جويريّة، وكانت قد أتت رسول الله تسأله فكاك* نفسها، فقال رسولُ اللهِ: ((أو ما هو خيرٌ مِن ذلك؟) فقالت: وما هو؟ قال: (أتزوَّجُكِ وأقضي عنكِ كتابتَكِ) فقالت: نَعم قال: (قد فعَلْتُ))، وأعتق قومها من الأسر؛ صداقاً لها.]\n\nوقد كانت -رضي الله عنها- كثيرة الصيام، والقِيام، كثيرة العطف على الفقراء، والمساكين، مُحِبّةً للخير، والسلام، حريصةً على وحدة صفّ المسلمين وظهر ذلك جليّاً في موقفها المُحايد في مواجهة الفِتن التي داهمت المسلمين زمن خلافة عثمان، وعند استشهاد علي -رضي الله عنهم- جميعاً، وكانت تدعو الله أن يحقنَ* دماء المسلمين، وقد كانت وفاتها -رضي الله عنها- بعدما أضعفَها الكِبر في السنّ، والمرض الذي لم ينفع معه العلاج في سنة خمسين، وقِيل ستٍّ وخمسين للهجرة.                      ",
    "number-en": "Juwayriyah bint Al-Harith",
    "label-en": "The Mother of the Believers was Juwayriyah bint Al-Harith - may God be pleased with her - from the Banu Al-Mustaliq, and her father Al-Harith was their leader, so he wanted to fight the Messenger of God. To satisfy his arrogance and his love of power, he was defeated before the Messenger of God, and more than seven hundred of them fell into his hands as prisoners, including the daughter of Al-Harith (Barra), whom the Messenger of God later called Juwayriyah. She had come to the Messenger of God asking him to redeem herself. The Messenger of God said: ((Or what is better than that?) She said: What is it? He said: (Should I marry you and make up for it?) Your writing about you.” She said: “Yes.” He said: “I have done it.” Her people were freed from captivity. As a friendship for her.]\n\nShe - may God be pleased with her - fasted and prayed a lot, was very kind to the poor and the needy, loved goodness and peace, and was keen on the unity of Muslims. This was evident in her neutral stance in the face of the temptations that attacked the Muslims at the time of the caliphate of Uthman, and at the martyrdom of Ali - may God be pleased with them all. She used to pray to God to spare the blood of Muslims, and her death - may God be pleased with her - occurred after she was weakened by old age and illness. For whom the treatment did not work in the year fifty, and it was said that fifty-six of the Hijra."
  },
  {
    "number": "صفيّة بنت حُيَيّ بن أخطب",
    "text": "",
    "label": "وهي أمّ المؤمنين صفيّة بنت حُيَيّ بن أخطب، من ذرية رسول الله هارون -عليه السلام-، وأمّها برة بنت سموأل، وكانت قبل إسلامها مُتزوّجةً من كنانة بن الربيع؛ وهو شاعر يهوديّ قُتِلَ يوم خيبر، فسُبِيَت، فصارت في سهم دحية الكلبيّ -رضي الله عنه-، فجعلها لرسول الله، وكان صداقها* عِتقها.\n\nحازت -رضي الله عنها- على الكثير من الفضائل، والمناقب، ومنها أنّ النبيّ خصّها بالرعاية، والعطف الخاصّ؛ لكونها غريبة، فنساؤه جميعهنّ قُرَشيّات ما عداها؛ فكثيراً ما كان يُذكّرها بأنّها حفيدة الأنبياء، ومن جميل رعايته أيضاً ما رواه البخاريّ عن أنس بن مالك -رضي الله عنه- أنّه قال: (فَرَأَيْتُ رَسولَ اللَّهِ صَلَّى اللهُ عليه وسلَّمَ يُحَوِّي لَهَا ورَاءَهُ بعَبَاءَةٍ، ثُمَّ يَجْلِسُ عِنْدَ بَعِيرِهِ، فَيَضَعُ رُكْبَتَهُ، فَتَضَعُ صَفِيَّةُ رِجْلَهَا علَى رُكْبَتِهِ حتَّى تَرْكَبَ). وقد كانت وفاتها -رضي الله عنها- في خِلافة معاوية -رضي الله عنه- سنة خمسين، وقِيل اثنتين وخمسين للهجرة، ودُفِنَت في البقيع.",
    "number-en": "Safiya bint Huyay bin Akhtab",
    "label-en": "She is the Mother of the Believers, Safiyya bint Huyay bin Akhtab, from the descendants of the Messenger of God Harun - peace be upon him -, and her mother is Barra bint Samawal, and before her conversion to Islam, she was married to Kinana bin Al-Rabi’. He was a Jewish poet who was killed on the Day of Khaybar. She was taken captive and became part of Dihya al-Kalbi’s share - may God be pleased with him. He assigned her to the Messenger of God, and her dowry was her emancipation.\n\nShe acquired - may God be pleased with her - many virtues and virtues, including that the Prophet devoted her to special care and kindness. Because she is strange, his wives are all Quraysh except for her. He often reminded her that she was the granddaughter of the prophets, and one of the beauty of his care was also what Al-Bukhari narrated on the authority of Anas bin Malik - may God be pleased with him - that he said: (I saw the Messenger of God, may God bless him and grant him peace, wrapping a cloak behind him for her, then sitting by his camel. Then he puts his knee, and Safiya puts her leg on his knee until she rides.) She died - may God be pleased with her - during the caliphate of Muawiyah - may God be pleased with him - in the year fifty, and it was said fifty-two AH, and she was buried in Al-Baqi."
  },
  {
    "number": "أم حبيبة ",
    "text": "",
    "label": "وهي أمّ المؤمنين رملة بنت أبي سفيان بن حرب بن أمية، وأمّها صفية بنت أبي العاص بن أمية، كانت مُتزوّجة من عُبيدالله بن جحش بن رئاب، وهي أقرب أزواج النبيّ نَسباً إليه؛ فهي من بنات عمّه، إلى جانب أنّها كانت أبعد أزواجه دياراً عندما عَقَدَ عليها؛ حيث تزوّجها وهي في الحبشة، وزوّجها إيّاه النجاشيّ، إضافة إلى أنّها كانت أكثر نسائه صداقاً؛ فقد بلغ مهرها الأربعمئة دينار، أصدقها إيّاها النجاشيّ.\n\nهاجرت أم حبيبة -رضي الله عنها- الهجرة الثانية إلى الحبشة مع زوجها عُبيدالله بن جحش، إلّا أنّه ارتدّ عن الدين، وثبتت -رضي الله عنها- على دينها، وهجرتها. أمّا وفاتها -رضي الله عنها- فقد كانت في المدينة المُنوّرة سنة أربعٍ وأربعين، وقِيل اثنتين وأربعين للهجرة.",
    "number-en": "Umm Habiba",
    "label-en": "She is the Mother of the Believers, Ramla bint Abi Sufyan bin Harb bin Umayyah, and her mother is Safiyya bint Abi Al-Aas bin Umayyah. She was married to Ubaidullah bin Jahsh bin Riab, and she is the closest of the Prophet’s wives in lineage to him. She is one of his cousins, and she was the furthest away from his wife when he married her. He married her while she was in Abyssinia, and the Negus married her to him, in addition to the fact that she was his most loyal woman. Her dowry amounted to four hundred dinars, and the Negus gave it to her.\n\nUmm Habibah - may God be pleased with her - migrated the second migration to Abyssinia with her husband Ubaid Allah bin Jahsh, but he apostatized from the religion, and she - may God be pleased with her - remained steadfast in her religion and migrated. As for her death - may God be pleased with her - it was in Medina in the year forty-four, and it was said that it was forty-two AH."
  },
  {
    "number": "ميمونه بنت الحارث ",
    "text": "",
    "label": "وهي أمّ المؤمنين ميمونة بنت الحارث بن حزن بن بجير بن الهزم، وأمّها هند بنت عوف بن زهير، تزوّجت في الجاهليّة من مسعود بن عمرو الثقفيّ الذي فارقها، فتزوّجت بعده أبا رُهم بن عبد العزى الذي تُوفِّي عنها، فتزوّجها النبيّ -عليه الصلاة والسلام-، وكانت -رضي الله عنها- من سادات النساء، وهي أخت أم الفضل زوجة العبّاس عمّ النبيّ، وقد جعلت أمرها للعبّاس عندما خطبها النبيّ، فزوّجها إيّاه، وكان ذلك في شهر ذي القعدة سنة سبعٍ للهجرة في سَرف*، ويُشار إلى أنّها كانت آخر امرأة تزوّجها النبيّ.\n\nورد الكثير من فضائلها -رضي الله عنها-؛ فقد رَوت عدّة أحاديث عن رسول الله، وكانت وَرِعة تقيّة تصل الأرحام، فقد روى ابن حجر عن يزيد بن الأصم عن عائشة أنّها قالت تصف ميمونة: ( أما أنَّها كانَت من أتقانا للَّهِ وأوصلِنا للرَّحِمِ)، أمّا وفاتها -رضي الله عنها- فقد كانت في سَرف، وقِيل في مكّة، ثمّ حُمِلَت إلى سَرف بأمر من ابن أختها ابن عبّاس -رضي الله عنه-، وكان ذلك سنة إحدى وخمسين، وقِيل إحدى وستّين للهجرة، عن عُمر بلغ ثمانين عاماً.                     ",
    "number-en": "Maimuna bint Al-Harith",
    "label-en": "She is the Mother of the Believers, Maimuna bint Al-Harith bin Hazn bin Bujair bin Al-Hazm, and her mother is Hind bint Awf bin Zuhair. She was married in pre-Islamic times to Masoud bin Amr Al-Thaqafi, who separated from her. After him, she married Abu Rahm bin Abdul-Uzza, who died from her, so the Prophet - peace and blessings be upon him - married her. She - may God be pleased with her - was one of the masters of women, and she is the sister of Umm Al-Fadl, the wife of Al-Abbas, the Prophet’s uncle. She made her decision up to Abbas when the Prophet proposed to her, so he married her to him. This was in the month of Dhul-Qa’dah in the seventh year of the Hijra in Saraf*, and it is noteworthy that she was the last woman whom the Prophet married.\n\nMany of her virtues - may God be pleased with her - were mentioned: She narrated several hadiths on the authority of the Messenger of God, and she was pious and pious and connected with family ties. Ibn Hajar narrated on the authority of Yazid ibn al-Asam on the authority of Aisha that she said describing Maimunah: (But she was one of the most fearful of God and connected us to the womb). As for her death - may God be pleased with her - it was in Saraf, and it was said in Mecca, then she was carried to Saraf by order of her sister’s son, Ibn Abbas - may God be pleased with him -, and that was in the year fifty-one, and it is said that sixty-one of the Hijra, at the age of eighty years."
  },
  {
    "number": "مارية القبطية ",
    "text": "",
    "label": "هل تعد مارية القبطية من زوجات الرسول\nوُلِدت أم إبراهيم؛ مارية بنت شمعون القبطية في مصر، وقد أهداها المقوقس للنبيّ -صلّى الله عليه وسلّم- في السنة السابعة للهجرة، فأسلمت ودخل بها الرسول بمُلك اليمين، وأنجبت له إبراهيم، ويجدر بالذكر أنّ السيّدة مارية لا يُطلَق عليها (أمّ المؤمنين) كزوجات الرسول؛ إذ إنّ كلّ امرأة عقدَ عليها الرسول ودخل بها فهي من أمهات المؤمنين، أمّا السيّدة مارية -رضي الله عنها- فهي من إمائه -صلّى الله عليه وسلّم-، وليست من زوجاته، وتوفّيت رضي الله عنها في خلافة عمر بن الخطاب في شهر محرّم في العام السادس عشر للهجرة، ودُفنت بالبقيع.",
    "number-en": "Maria the Copt",
    "label-en": "Is Maria the Coptic considered one of the Prophet’s wives?\nIbrahim's mother was born; Mariyah, the daughter of Shimun al-Qibtiyya, in Egypt. Al-Muqawqis gave her to the Prophet - may God bless him and grant him peace - in the seventh year of the Hijra. She converted to Islam and the Messenger entered into the kingdom of the right with her, and she gave birth to him. Ibrahim. It is worth noting that Lady Mariyah is not called (Mother of the Believers) like the Prophet’s wives; Since every woman with whom the Messenger had a marriage and consummated his marriage is one of the mothers of the believers, as for Mrs. Maria - may God be pleased with her - she is one of his female slaves - may God bless him and grant him peace - and not one of his wives. She, may God be pleased with her, died during the caliphate of Omar ibn Al-Khattab in the month of Muharram in the sixteenth year of the Hijra, and was buried in Al-Baqi’."
  },
  {
    "number": "مكانة زوجات الرسول صلى الله عليه وسلم ",
    "text": "",
    "label": "تُعَدّ أمّهات المؤمنين -رضي الله عنهنّ- بصفتهنّ زوجات لرسول الله أفضل الأزواج على الإطلاق، وفي ما يأتي ذِكر بعضِ الأسباب التي تُوَضّح مكانتهنّ، وأفضليتهنّ:\n\nخصّهنّ الله بنزول الوحي في بيوتهنّ؛ بقوله: (وَاذْكُرْنَ مَا يُتْلَى فِي بُيُوتِكُنَّ مِنْ آيَاتِ اللَّـهِ وَالْحِكْمَةِ).\nحرّم الله نكاحهنّ بعد رسول الله؛ بقوله: (وَمَا كَانَ لَكُمْ أَن تُؤْذُوا رَسُولَ اللَّـهِ وَلَا أَن تَنكِحُوا أَزْوَاجَهُ مِن بَعْدِهِ أَبَدًا).\nوصفهنّ الله بالزوجيّة؛ بقوله: (يَا أَيُّهَا النَّبِيُّ قُل لِّأَزْوَاجِكَ)،[٥٣] للدلالة على الإنسجام والتوافق في علاقتهنّ برسول الله.                      ",
    "number-en": "The status of the Prophet’s wives, may God bless him and grant him peace",
    "label-en": "The Mothers of the Believers - may God be pleased with them - in their capacity as wives of the Messenger of God are considered the best wives ever. Below are some of the reasons that clarify their status and preference:\n\nGod singled them out for revelation in their homes. By saying: (And remember what is recited in your homes of the signs of God and wisdom).\nGod forbade their marriage after the Messenger of God. By saying: (And it is not for you to harm the Messenger of God, nor to marry his wives after him ever.)\nGod described them as married; By saying: (O Prophet, tell your wives),[53] to indicate harmony and compatibility in their relationship with the Messenger of God."
  },
  {
    "number": "حقوق زوجات الرسول صلى الله عليه وسلم على المسلمين ",
    "text": "",
    "label": "ُعَدّ أمّهات المؤمنين -رضي الله عنهنّ- زوجات لرسول الله في الدنيا، والآخرة؛ ولهذا فإنّه يجب على المسلم توقيرهنّ، واحترامهنّ، ومَحبتهنّ في الله، والترضّي عنهنّ عند ذِكرهنّ، والدفاع عنهنّ، والتصدّي لكلّ أذىً يُقال فيهنّ.                      ",
    "number-en": "The rights of the wives of the Messenger, may God bless him and grant him peace, to Muslims",
    "label-en": "The mothers of the believers - may God be pleased with them - are considered wives of the Messenger of God in this world and the hereafter. Therefore, a Muslim must revere them, respect them, love them for the sake of God, be satisfied with them when they are mentioned, defend them, and confront every harm said about them."
  },
  {
    "number": "الحكمة من تعدد زوجات الرسول صلى الله عليه وسلم ",
    "text": "",
    "label": "تعدُّد زوجات الرسول هو وحيٌ، وأمرٌ من الله، دلّت عليه الكثير من الآيات، منها قوله -تعالى-: ( لَّا يَحِلُّ لَكَ النِّسَاءُ مِن بَعْدُ وَلَا أَن تَبَدَّلَ بِهِنَّ مِنْ أَزْوَاجٍ وَلَوْ أَعْجَبَكَ حُسْنُهُنَّ إِلَّا مَا مَلَكَتْ يَمِينُكَ وَكَانَ اللَّـهُ عَلَى كُلِّ شَيْءٍ رَّقِيبًا)، وبدراسة سيرة النبيّ -صلّى الله عليه وسلّم-، وكيفيّة زواجه بنسائه، يتبيّن أنّ السبب في تعدُّد زوجاته مُتعلِّقٌ بعدّة حِكَم يمكن إجمالها بما يأتي:\n\nالحكمة التعليميّة: تُعَدّ النساء نصف المجتمع، وهنّ بحاجة إلى من يجيب عن أسئلتهنّ المُتعلِّقة بهنّ كنساء؛ من حَيض، ونَفاس، وأمورٍ زوجيّة، وغيرها، وليست كلّ النساء تتغلّب على حيائها لتسأل رسول الله في شيء، وما كان لرسول الله الإجابة عن كلّ سؤال بتفاصيله الدقيقة عن المرأة؛ فقد كان رسول الله حَيِيّاً؛ لذا فإنّه بزواجه أعدّ داعيات عالمات بأمور دينهنّ، يُجِبن عن تساؤلات النساء الدقيقة.\nالحكمة التشريعيّة: كانت عادة التّبني من العادات المعروفة بين العرب عند مجيء الإسلام، وكان النبي -عليه السلام- قد تبنّى زيد بن حارثة، وشاءت إرادة الله -تعالى- إبطال عادة التّبني وإبطال آثاره، ولأجل أن يكون هذا الحكم واضحاً في أذهان المسلمين؛ فقد أمر المولى سبحانه النبيَّ بالزواج من زينب بنت جحش، وهي يومئذ طليقة ابنه بالتبني؛ فشكّل هذا الزواج أمراً إلهياً وتشريعاً جديداً بحرمة التبني وإبطال أثره.\nالحكمة الاجتماعية: إنّ ما يحدث بالزواج من مصاهرة، ونَسب، كفيل بأن يجمع القلوب برباطٍ وثيق، كزواجه -صلّى الله عليه وسلّم- من أمهات المؤمنين: عائشة، وحفصة -رضي الله عنهما-؛ حُبّاً بأبويهما.\nالحكمة السياسية: لا تؤلّف المصاهرة بين القلوب على مستوى الأشخاص فحَسب، بل على مستوى العشائر، والقبائل، وبطبيعة الحال فإنّ المُتعارَف عليه هو نُصرة النسيب، والصِّهر، وحمايته، والالتفاف حوله، وقد كان ذلك مَدعاةً لزواجه -صلّى الله عليه وسلّم- من أمّهات المؤمنين: جويريّة، وصفيّة، وأم حبيبة -رضي الله عنهنّ-.                      ",
    "number-en": "The wisdom behind the Prophet’s multiple wives, may God bless him and grant him peace",
    "label-en": "The Prophet’s polygamy is a revelation and a command from God, which is indicated by many verses, including the Almighty’s saying: (It is not lawful for you to have women afterward, nor for you to exchange for them any other wives, even if your beauty pleases you, except what Your right hand reigns, and God is Watcher over all things.” By studying the biography of the Prophet - may God bless him and grant him peace - and how he married his wives, it becomes clear that the reason for his multiple wives is related to several rulings that can be summarized as follows:\n\nEducational wisdom: Women are half of society, and they need someone to answer their questions related to them as women. Menstruation, postpartum bleeding, marital matters, etc. Not all women overcome their shyness to ask the Messenger of God about anything, and the Messenger of God was not able to answer every question with precise details about the woman. The Messenger of God was alive. Therefore, with his marriage, he prepared female preachers who were knowledgeable about matters of their religion and would answer women’s delicate questions.\nLegislative wisdom: The custom of adoption was one of the well-known customs among the Arabs at the advent of Islam, and the Prophet - peace be upon him - had adopted Zaid bin Haritha, and the will of God Almighty wanted to nullify the custom of adoption and nullify its effects, and in order for this ruling to be clear in the minds of Muslims; The Lord Almighty ordered the Prophet to marry Zainab bint Jahsh, who was at that time the ex-wife of his adopted son. This marriage constituted a divine command and new legislation prohibiting adoption and nullifying its effect.\nSocial Wisdom: What happens through marriage in terms of affinity and lineage is enough to unite hearts with a close bond, such as his marriage - may God bless him and grant him peace - to the mothers of the believers: Aisha and Hafsa - may God be pleased with them -; For the love of their parents.\nPolitical wisdom: Intermarriage between hearts is not only formed at the level of individuals, but also at the level of clans and tribes, and of course, what is known about him is to support the relative, the son-in-law, protect him, and rally around him. This was the reason for his marriage - may God bless him and grant him peace - to the mothers of the believers: Juwayriyah, Safiya, and Umm Habiba - may God be pleased with them."
  }
]