[
  {
    "number": "ختم القرآن مرة واحدة ",
    "text": "",
    "label": "يستطيع المسلم ختم القرآن الكريم مرّةً واحدةً في شهر رمضان؛ بقراءة جزءٍ كلّ يومٍ، فالجزء عبارةٌ عن عشرين صفحةً، ويُقسّم إلى أربعة أجزاءٍ، تُقرأ في أربعة أوقاتٍ مختلفةٍ، كلّ جزءٍ منها خمس صفحاتٍ، فتُقرأ الخمس صفحاتٍ الأولى بعد صلاة الفجر، والخمس الثانية من بعد صلاة الظهر أو العصر، ثمّ خمس صفحاتٍ بعد صلاة المغرب، ثمّ تُقرأ الصفحات الخمس الأخيرة بعد صلاة التراويح، أو حين السُّحور، وبذلك يكون المسلم قد ختم القرآن مرّةً واحدةً في شهر رمضان بسهولةٍ ويُسرٍ، كما يُمكن تقسيم الجزء إلى خمسة أجزاءٍ، كلّ جزءٍ منها أربع صفحاتٍ، فتُقرأ كلّ أربع صفحاتٍ ما بين الأذان والإقامة لكلّ صلاةٍ، فيكون بذلك قد أتمّ قراءة جزءٍ كاملٍ في اليوم، ويُختم القرآن مرّةً واحدةً في الشهر.",
    "number-en": "Complete the Qur’an once",
    "label-en": "A Muslim can complete the Holy Qur’an once in the month of Ramadan. By reading a part every day, the part is twenty pages, and is divided into four parts, which are read at four different times, each part of which is five pages, so the first five pages are read after the dawn prayer, the second five after the noon or afternoon prayer, then five pages after the sunset prayer, then the last five pages are read after the Tarawih prayer, or during suhoor, and thus the Muslim has completed the Qur’an once in the month of Ramadan. Easily and conveniently, the part can be divided into five parts, each part of which is four pages, so every four pages are read between the call to prayer and the iqamah for each prayer, thus one has completed reading a full part for the day, and has completed the Qur’an once a month."
  },
  {
    "number": "ختم القرآن مرتين",
    "text": "",
    "label": "يستطيع المسلم أن يختم القرآن مرّتين في شهر رمضان؛ بقراءة جزأين كلّ يومٍ، بقراءة عشر صفحاتٍ في أربعة أوقاتٍ مختلفةٍ من اليوم، أو قراءة ثمان صفحاتٍ بين كلّ أذانٍ وإقامةٍ، أو بعد كلّ صلاةٍ.",
    "number-en": "Complete the Qur’an twice",
    "label-en": "A Muslim can complete the Qur’an twice in the month of Ramadan. By reading two parts each day, by reading ten pages at four different times of the day, or by reading eight pages between each call to prayer and iqamah, or after each prayer."
  },
  {
    "number": "ختم القرآن ثلاث مرات",
    "text": "",
    "label": "يُمكن للمسلم ختم القرآن الكريم ثلاث مرّاتٍ في شهر رمضان؛ بتخصيص ساعةٍ ونصف يومياً للقراءة، على ثلاث فتراتٍ مختلفةٍ، موزّعةٍ طوال اليوم، بجعل الفترة الواحدة نصف ساعةٍ، فيُقرأ جزءٌ واحدٌ في النصف ساعة الأولى، ثم يُقرأ جزءٌ ثانٍ في النصف ساعة الثانية، ثمّ جزءٌ ثالثٌ في الفترة الأخيرة، وبذلك يُتمّ ثلاثة أجزاءٍ في اليوم الواحد.",
    "number-en": "Complete the Qur’an three times",
    "label-en": "A Muslim can complete the Holy Qur’an three times in the month of Ramadan. By allocating an hour and a half daily for reading, in three different periods, distributed throughout the day, by making one period half an hour, so one part is read in the first half hour, then a second part is read in the second half hour, then a third part in the last period, thus completing three parts in one day."
  },
  {
    "number": "ختم القرآن أربعة مرات",
    "text": "",
    "label": "يستطيع المسلم ختم القرآن الكريم في سبعة أيامٍ، اقتداءً بالسلف الصالح؛ إذ كانوا يجعلون القرآن سبعة أجزاءٍ، ويقرؤونه في سبعة أيّامٍ، حيث يبتدؤون اليوم الأول بقراءة السُّور الثلاث الأولى من القرآن، ثمّ السُّور الخمس التي تليها، ثمّ السُّور السَّبع، ثمّ السُّور التسع، ثمّ السُّور الإحدى عشر، ثمّ السُّور الثلاث عشرة، ثمّ يختمون اليوم السابع بقراءة سور المُفصّل؛ من سورة ق، إلى آخر سورة النَّاس.",
    "number-en": "He completed the Qur’an four times",
    "label-en": "A Muslim can complete the Holy Qur’an in seven days, following the example of the righteous predecessors. They used to make the Qur’an into seven parts, and recite it in seven days. They would begin the first day by reading the first three surahs of the Qur’an, then the five surahs that follow them, then the seven surahs, then the nine surahs, then the eleven surahs, then the thirteen surahs, then they would end the seventh day by reading the al-Mufassal surahs. From Surat Q, to the end of Surat An-Nas."
  },
  {
    "number": "ختم القرآن عشر مرات",
    "text": "",
    "label": "يُمكن للمسلم ختم القرآن الكريم كلّ ثلاثةٍ أيّامٍ؛ بتوزيع أوقات قراءته على خمسة أوقاتٍ في اليوم والليلة، فيقرأ جزءاً ما بين الأذان والإقامة، من بعد أذان الفجر، بتقدير وقت قراءة الجزء بعشرين دقيقةً، لمن يقرأ قراءةً سريعةً مع مراعاة أحكام التجويد، ثمّ يخصّص ساعةً بعد صلاة الفجر، لقراءة ثلاثة أجزاءٍ من القرآن، ثمّ يقرأ جزأين بعد صلاة الظهر، ثمّ ثلاثة أجزاءٍ بعد صلاة العصر، ثمّ يقرأ جزءاً بعد صلاة المغرب أو العشاء.",
    "number-en": "Complete the Qur’an ten times",
    "label-en": "A Muslim can complete the Holy Qur’an every three days. By distributing his reading times over five times a day and night, he reads a part between the call to prayer and the iqamah, after the dawn call to prayer, estimating the reading time for the part at twenty minutes, for those who read quickly, taking into account the rules of Tajweed. Then he allocates an hour after the dawn prayer to read three parts of the Qur’an, then he reads two parts after the noon prayer, then three parts after the afternoon prayer, then he reads a part after the evening or evening prayers."
  }
]