[
  {
    "number": "كيفية الصلاة",
    "text": "",
    "label": "الصلاة هي الركن الثاني من أركان الإسلام الخمسة، وأول ما يُسأَل عنه العبد يوم القيامة باعتبارها عمود الدين، واتصال روحي بين العبد وربه، فكانت الصلاة منذ أن فُرضت خمسون صلاة، فأصبحت خمس صلوات في اليوم تخفيفًا على الأمة، يؤديها المسلم في طمأنينة لكسب رضى الله سبحانه وتعالى، ففي الصلاة تكون الراحة والسكينة والرقي بالنفس وسموّها، لأنّ تأديتها تريح المسلم، فمن أراد الصلاة يجب عليه أن يطبّق شروطها الصحيحة لتُقبل.\n\nشروط الصلاة:\nطهارة البدن: الوضوء أو الاغتسال أو التيمّم في حال عدم وجود ماء. طهارة الثوب. استقبال القبلة. استحضار النية: محلُّها في القلب وليس النطق بها.\n\nكيفية الصلاة الصحيحة:\n\n• بعد أداء شروط الصلاة الصحيحة يستقبل المسلم القبلة مراعيًا اتجاهها دون التفات أو انحراف، ومن بعدها يستحضر النية دون التلفظ بها. \n\n• تكبيرة الإحرام بقول الله أكبر، ورفع اليدين حذو المنكبين.\n\n•الاستفتاح، وذلك بوضع اليد اليمنى على اليد اليسرى فوق صدره، ويقول المصلي دعاء الاستفتاح: سبحانك اللهم وبحمدك وتبارك اسمك وتعالى جدك ولا إله غيرك. \n\n•قراءة سورة الفاتحة بعد الاستعاذة والبسملة. قراءة ما تيسّر من القران الكريم . \n\n•الركوع: انحناء الظهر باستقامة دون زيادة أو نقصان في الانحناء، إذ يجعل رأسه حيال ظهره ويضع يديه على ركبتيه مفرجتي الأصابع، ويكبّر عند ركوعه برفع يديه حذو منكبيه، ويقول عند الركوع (سبحان ربي العظيم) ثلاث مرات. \n\n•الرفع من الركوع وقول:سمع الله لمن حمده، وبعد الاعتدال في الرفع قول: ربنا ولك الحمد والشكر ملء السموات والأرض وملء ما شئت من شيء بعد. \n\n•السجود: ينزل على أعضائه السبعة: الجبهة والأنف والكفين والركبتين وأطراف القدمين، ويضع يديه بمحاذاة منكبيه على الأرض ويرفع عضديه، ولا يبسط ذراعيه على الأرض، ويستقبل برؤوس أصابعه القبلة، ويقول: (سبحان ربي الأعلى) ثلاث مرات، ثم الرفع من السجود وقول الله أكبر. \n\n•الجلوس بين السجدتين، وقول: رب اغفر لي وارحمني واهدني وارزقني واجبرني وعافني، ثم السجود للسجدة الثانية وقول كما في السجدة الأولى، والتكبير عند السجود، وتكون بذلك قد اكتملت الركعة الأولى، ثم الإتيان بالركعة الثانية بعد التكبير وقول كما في الركعة الأولى دون دعاء الاستفتاح. \n\n•التشهّد: بعد انتهاء الركعة الثانية يجلس متورّكًا فينصب قدمه اليمنى ويخرج قدمه اليسرى من تحت اليمنى ويجعل مقعدته متمكّنة من الأرض، ثم يضع المصلي يديه على فخذيه كما وضعها في التشهّد الأول، ويقول: (التّحيات لله والصلوات والطيبات السّلام عليك أيها النبي ورحمة الله وبركاته السلام علينا وعلى عباد الله الصالحين أشهد أن لا إله الا الله وأشهد أن محمدًا عبده ورسوله). إذا كان لم ينهي الصلاة يأت بالركعة الثالثة أو الرابعة ليستكمل الصلاة، \n\nأما إذا أراد أن ينهي الصلاة فيأت بالصلاة الإبراهيمية ويقول: (اللهم صلّ على محمد وعلى آل محمد كما صليت على إبراهيم وعلى آل إبراهيم إنك حميد مجيد، وبارك على محمد وعلى آل محمد كما باركت على إبراهيم وعلى آل إبراهيم إنك حميد مجيد). ثم يدعو الله بما يحب ويقول: أعوذ بالله من عذاب جهنم ومن عذاب القبر ومن فتنة المحيا والممات ومن فتنة المسيح الدجال. التسليم: يسلم عن يمينه ويساره، ويقول: السلام عليكم ورحمة الله.                      ",
    "number-en": "How to pray",
    "label-en": "Prayer is the second of the five pillars of Islam, and the first thing a servant will be asked about on the Day of Resurrection as it is the pillar of religion and a spiritual connection between the servant and his Lord. Since it was made obligatory, there were fifty prayers, so it became five prayers a day to ease the burden on the nation, which the Muslim performs in reassurance to gain the satisfaction of God Almighty. In prayer, there is comfort, tranquility, and elevation of the soul, and its elevation, because performing it comforts the Muslim, so whoever wants to pray must do so. To apply the correct conditions to be accepted.\n\nPrayer conditions:\nPurity of the body: ablution, bathing, or tayammum in the absence of water. Purity of clothing. Facing the Qiblah. Conjuring the intention: its place is in the heart, not uttering it.\n\nHow to pray correctly:\n\n• After performing the conditions of correct prayer, the Muslim faces the Qiblah, taking into account its direction without turning or deviating, and after that he conjures the intention without uttering it. \n\n• Takbirat al-Ihram by saying “Allahu Akbar” and raising the hands at the same time as the shoulders.\n\n•The opening prayer, by placing the right hand over the left hand above his chest, and the praying person says the opening supplication: Glory be to You, O God, and with Your praise, and blessed is Your name, and exalted is Your grandfather, and there is no god but You. \n\n•Reciting Surah Al-Fatihah after seeking refuge and basmalah. Read what is easy from the Holy Quran. \n\n• Bowing: bending the back straight without increasing or decreasing the bend. He places his head towards his back and places his hands on his knees with the fingers spread. He says “Allahu Akbar” when bowing by raising his hands to the level of his shoulders, and says when bowing (Glory be to my Lord the Great) three times. \n\n•Raising from bowing and saying: God hears whoever praises Him, and after moderating in raising, say: Our Lord, to You belongs all praise and thanksgiving, filling the heavens and the earth and filling whatever you wish after that. \n\n•Prostration: He descends on his seven limbs: the forehead, nose, palms, knees, and tips of the feet. He places his hands on the ground along his shoulders and raises his upper arms. He does not extend his arms on the ground. He faces the Qiblah with his fingertips, and says: (Glory be to my Lord, the Most High) three times, then rises from prostration and says God is Great. \n\n•Sitting between the two prostrations, and saying: My Lord, forgive me, have mercy on me, guide me, provide for me, guide me, and grant me health, then prostrate for the second prostration and say as in the first prostration, and say “Allahu Akbar” when prostrating, and thus the first rak’ah has been completed, then perform the second rak’ah after saying “Allahu Akbar” and say as in the first rak’ah without the opening supplication. \n\n• Tashahhud: After the end of the second rak’ah, he sits in prayer, setting up his right foot and taking his left foot out from under the right, making his seat flush with the ground. Then the praying person places his hands on his thighs as he placed them in the first tashahhud, and says: (Salutations to God, and prayers and good things. Peace be upon you, O Prophet, and God’s mercy and blessings. Peace be upon us and upon the righteous servants of God. I bear witness that there is no god but God, and I bear witness that Muhammad is His servant and His Messenger.) If he did not finish the prayer, he should perform the third or fourth rak’ah to complete the prayer. \n\nBut if he wants to end the prayer, he should say the Abrahamic prayer and say: (O God, bless Muhammad and the family of Muhammad as You blessed Abraham and the family of Abraham. You are Praiseworthy and Glorious, and bless Muhammad and the family of Muhammad as You blessed Abraham and the family of Abraham. You are Praiseworthy and Glorious.) Then he supplicates to God with what he loves and says: I seek refuge in God from the torment of Hell, from the torment of the grave, from the temptation of life and death, and from the temptation of the Antichrist. Salutation: He salutes to his right and left, and says: May the peace and mercy of God be upon you."
  },
  {
    "number": "نواقض ( مبطلات الصلاة )",
    "text": "",
    "label": "ما يبطل الصلاة\n\n1- ما يَنْقُضُ الوضوء: لأن الطهارة شرط في صحة الصلاة كما تقدم فإذا انتقضت الطهارة انتقضت الصلاة أي بطلت.\n\n2- كشف العورة: لأن ستر العورة شرط في صحة الصلاة كما علمت، فإذا انكشفت العورة عمداً، بطلت الصلاة.\n\n3- استِّدْبار الكعبة: لأنه شُرِطَ استقبالها لصحة الصلاة- إلا لجاهل- فإن كان عالماً عامداً بطلت صلاته.\n\n4- الزِّيادة في الأركان أو النقص منها عمداً: لأنها عبادة تَوقيفية لا تجوز الزيادة عليها ولا النقص منها فإن فعل عامدا بطلت صلاته.\n\n5- تقديم بعض الأركان على ما قبلها: ترتيب الأركان ركن من الصلاة كما علمت فإن قدم أو أخر عمدا أخلَّ بهذا الترتيب وبطلت صلاته.\n\n6- فَسْخُ النية أو نية الخروج من الصلاة: لأن النية واستدامتها شرط لصحة الصلاة، فإن فسخها أو نوى الخروج من الصلاة بطلت صلاته.\n\n7- الكلام الخارجُ عن الصلاة: من تكلم عامدا عالما بحرمة الكلام في الصلاة بطلت صلاته، لحديث زيد بن أرقم: \"كنا نتكلم في الصلاة، يكلم الرجل منا صاحبه وهو إلى جنبه في الصلاة فنزلت ( وَقُومُوا لله قَانتين ) (238 البقرة) فَأُمِرْنا بالسُّكوتِ ونُهِينا عن الكلام \" رواه الجماعة إلا ابن ماجه.                      ",
    "number-en": "Nullifiers (that invalidate prayer)",
    "label-en": "What invalidates prayer\n\n1- What invalidates ablution: Because purity is a condition for the validity of prayer, as mentioned above, so if purity is invalidated, the prayer is invalidated, i.e. invalidated.\n\n2- Exposing the private parts: Because covering the private parts is a condition for the validity of the prayer, as you have learned, so if the private parts are exposed intentionally, the prayer is invalid.\n\n3- Turning around the Kaaba: Because facing it is a condition for the prayer to be valid - except for an ignorant person - if he is knowledgeable and intentional, his prayer is invalid.\n\n4- Adding to or subtracting from the pillars intentionally: Because it is a suspended act of worship, it is not permissible to add to it or subtract from it. If he did it intentionally, his prayer is invalid.\n\n5- Putting some of the pillars ahead of what came before them: The arrangement of the pillars is an element of prayer, as you have learned. If he puts them forward or delays them intentionally, this arrangement is violated and his prayer is invalid.\n\n6- Canceling the intention or intending to leave the prayer: Because the intention and its continuity are a condition for the validity of the prayer, so if he breaks it or intends to leave the prayer, his prayer is invalid.\n\n7- Speech outside of prayer: Whoever speaks intentionally, knowing that speaking during prayer is forbidden, his prayer is invalidated, based on the hadith of Zaid bin Arqam: “We used to speak during prayer, and a man among us would talk to his friend while he was beside him during prayer, so (And stand up to God obedient) (238 Al-Baqarah) was revealed, so we were commanded to be silent and forbidden from speaking.” Narrated by the group, except for Ibn Majah."
  },
  {
    "number": "كيفية الوضوء الصحيح ",
    "text": "",
    "label": "حتى تكون الصّلاة صحيحة، لا بد أن يكون الوضوء صحيحًا، لأنّ الصّلاة لا يقربها إلاّ من كان طاهرًا بجسده، والوضوء يعتبر مقصد الطّهارة هنا، فهو يسبغ على البدن والرّوح طهارة حسّية ومعنويّة وجسديّة تهيئ المسلم لدخول الصّلاة بقلب سليم، وجسد طاهر، وفيما يلي توضيح لخطوات الوضوء والصّلاة بالتفصيل: \n\nخطوات الوضوء الصّحيح: يعتبر الوضوء مفتاح الصّلاة، والمقصود به طهارة البدن والملبس والمكان، ولا تصح الصّلاة ولا تُقبل إلاّ بالوضوء الصّحيح الكامل، الذي له آداب وشروط نبيّنها كما يلي: \n\n١•البدء بالبسملة واستحضار النيّة بالقلب. \n\n٢•غسل الكفّين ثلاثًا. \n\n٣•المضمضة ثلاثًا، وتعني إدخال الماء بالفم والمضمضة به ثم إخراجه.\n\n٤•الاستنشاق ثلاثًا، ويكون بتقريب الماء من الأنف، والبعض يستنشق الماء ويدخله للأنف ثم يطرده خارجًا، وكلاهما صحيح، والأفضل المبالغة بالاستنشاق ما لم يكن المسلم صائمًا. \n\n٥•غسل الوجه ثلاثًا، بحيث يغمر الماء جميع الوجه من الجبهة وحتى الذّقن، والصدغين وجميع حدود الوجه الخارجيّة. \n\n٦•غسل السّاعدين إلى المرفقين ثلاثًا لكل منهما، ويشترط البدء بالجانب الأيمن ثم الانتقال إلى الجانب الأيسر. \n\n٧•مسح الرأس بالقليل من الماء، ثم مسح الأذنين من الدّاخل والخارج. \n\n٨•غسل القدمين إلى الكعبين ثلاثًا لكل منهما، مع البدء بالجانب الأيمن ثم الأيسر، مع تخليل الماء بين الأصابع لتنظيف ما علق بباطنها من أوساخ وأتربة. \n\n٩•الخطوة الأخيرة من الوضوء يستحب فور الانتهاء من الوضوء قول: \"أشهد أنّ لا إله إلاّ الله وحده لا شريك له، وأنّ محمّدًا عبده ورسوله، اللهم اجعلني من التوّابين، واجعلني من المتطهّرين\".                      ",
    "number-en": "How to perform ablution correctly",
    "label-en": "In order for the prayer to be valid, the ablution must be correct, because prayer can only be approached by one whose body is pure, and ablution is considered the goal of purity here, as it bestows on the body and soul a sensory, moral, and physical purity that prepares the Muslim to enter prayer with a healthy heart and a pure body. The following is an explanation of the steps of ablution and prayer in detail: \n\nSteps for correct ablution: Ablution is considered the key to prayer, and what is meant by it is the purity of the body, clothing, and place. Prayer is not valid or accepted except with correct and complete ablution, which has etiquettes and conditions that we explain as follows: \n\n1• Begin with the basmalah and conjure the intention in the heart. \n\n2• Wash the palms three times. \n\n3• Rinsing the mouth three times, which means inserting water into the mouth, rinsing the mouth with it, then taking it out.\n\n4• Inhaling three times, and this is done by bringing the water close to the nose. Some people inhale the water and bring it into the nose and then expel it out. Both of them are correct, and it is better to exaggerate the inhalation unless the Muslim is fasting. \n\n5• Wash the face three times, so that the water covers the entire face from the forehead to the chin, the temples and all the outer limits of the face. \n\n6• Wash the forearms up to the elbows three times for each, and it is required to start with the right side and then move to the left side. \n\n7• Wipe the head with a little water, then wipe the ears inside and out. \n\n8• Wash the feet up to the ankles three times for each, starting with the right side, then the left, with water running between the toes to clean any dirt and dust stuck to their soles. \n\n9•The last step of ablution. Immediately upon completion of ablution, it is desirable to say: “I bear witness that there is no god but God alone, with no partner, and that Muhammad is His servant and Messenger. Oh God, make me one of those who repent, and make me one of those who purify themselves.”"
  },
  {
    "number": "كيفية التيمم",
    "text": "",
    "label": "إنّ الحكمة من مشروعية التيمم هي التسهيل على أمة محمد عليه الصلاة والسلام، ودفع الضرر الذي يمكن أن يقع بالمسلم في حالة استخدام الماء مثل تفاقم الأمراض وشدتها وتعذر شفاءها أو في حالات انقطاع الماء وعدم وجوده كالسفر والضياع، وذلك لدوام صلة العبد بربه وعدم انقطاع الصلاة عندَ انقطاع الماء. \n\nشروط صحة التيمم:\n\nأجمع العلماء أنّ التيمم يكون صحيحاً في حالة دخول وقت الصلاة والحاجة للتيمم، فلا يجوز التيمم للنوافل والتيمم قبل دخول وقت الصلاة، كما أنّ التيمم يجوز للصلاة الفائتة، وهذا حسب رأي جمهور العلماء. \n\nعدم توفر الماء: قال الله سبحانه وتعالى: (فَلَمْ تَجِدُوا مَاءً فَتَيَمَّمُوا) [النساء: 43]. طلب الماء والبحث عنه: يشترط للتيمم حسب مذهب أحمد بن حنبل والشافعي طلب الماء والبحث عنه، فإذا كان الشخص في سفر ومعه رفقة يحب عليه طلب الماء من رفقته، أما إذا رأى ما يدل على وجود الماء كالخضرة وغيرها فعليه أن يتوجه إليها. \n\nعدم القدرة على استخدام الماء: وذلك يكون بسبب إمكانية الاصابة بالأمراض، أو ازدياد المرض وتلف الأعضاء عند استخدام الماء أو الخوف من تأخر الشفاء لبعض الأمراض، وفي حالات البرد الشديدة جدا.\n\nكيفية التيمم:\n\nوضح الرسول محمد عليه الصلاة والسلام كيفية التيمم حيثُ إنّه قال لعمار بن ياسر في الصحيحين: (إنما كان يَكْفيك أن تقولَ بيديْك هكذا، ثم ضربَ بيديه الأرضَ ضربةً واحدةً، ثم مَسَحَ الشمالَ على اليمينِ، وظاهرَ كفَيْه، ووجهَه) [صحيح]، فإذا كان الشخص في حالة سفر أو تعذر عليه استخدام الماء يستطيع التيمم من خلال ضرب كفيه في التراب ضربة واحدة، ثمّ النفخ فيهما للتخلص مما علقَ بهما من التراب ومسح وجهه وكفيه. يسمي الشخص قبل التيمم كما يفعل قبل الوضوء، وبعد مسح وجهه وكفيه يقول: أشهد أنّ لا إله إلا الله وحده لا شريك له وأشهد أنّ محمداً عبده ورسوله، اللهم اجعلني من التوابين واجعلني من المتطهرين، كما يفعل بعد الانتهاء من الوضوء بالماء.       ",
    "number-en": "How to perform dry ablution",
    "label-en": "The wisdom behind the legality of tayammum is to make it easier for the nation of Muhammad, peace and blessings be upon him, and to prevent the harm that could occur to a Muslim in the case of using water, such as the exacerbation and severity of diseases and the inability to heal them, or in cases of interruption and non-existence of water, such as travel and loss, because of the continuity of the servant’s connection with his Lord, and the prayer is not interrupted when the water is interrupted. \n\nConditions for the validity of tayammum:\n\nThe scholars unanimously agreed that tayammum is valid if the time for prayer begins and there is a need for tayammum. It is not permissible to perform tayammum for voluntary prayers or to do tayammum before the time for prayer begins. It is also permissible to perform tayammum for missed prayers. This is according to the opinion of the majority of scholars. \n\nLack of water: God Almighty said: (And you do not find water, so perform tayammum) [An-Nisa: 43]. Asking for water and searching for it: According to the doctrine of Ahmad ibn Hanbal and Al-Shafi’i, it is required for tayammum to seek water and search for it. If a person is traveling and has a company with him, he should ask for water from his companion. However, if he sees something that indicates the presence of water, such as greenery and other things, then he must go to it. \n\nInability to use water: This is due to the possibility of contracting diseases, or the increase in disease and damage to organs when using water, or the fear of delayed recovery for some diseases, and in cases of very severe cold.\n\nHow to perform dry ablution:\n\nThe Messenger Muhammad, peace and blessings be upon him, explained how to perform tayammum, as he said to Ammar ibn Yasir in the two Sahihs: (It was enough for you to say with your hands like this, then he struck the ground with his hands once, then he wiped the left hand over the right, and the backs of his palms and his face) [Sahih]. If the person is traveling or unable to use water, he can do tayammum by striking his palms in the dirt once, then blowing on them to get rid of what He stuck them out of the dirt and wiped his face and hands. A person should say his name before tayammum as he does before ablution, and after wiping his face and hands, he says: I bear witness that there is no god but God alone, with no partner, and I bear witness that Muhammad is His servant and His Messenger, O God, make me one of those who repent and make me one of those who purify themselves, just as he does after completing ablution with water."
  },
  {
    "number": "نواقض الوضوء والتيمم",
    "text": "",
    "label": "وممّا حصل فيه خلاف بين أهل العلم، لكن نذكر ما يكون ناقضاً بمقتضى الدليل:\n\n(الأول): الخارج من السبيلين، أي الخارج من القُبُل أو من الدُّبُر، فكل ما خرج من القُبل أو الدبر فإنه ناقض الوضوء، سواءً كان بولاً أم غائطاً، أم مذياً، أم منياً، أم ريحاً، فكل شيء يخرج من القبل أو الدبر فإنه ناقض للوضوء ولا تسأل عنه، لكن إذا كان منيّاً وخرج بشهوة، فمن المعلوم أن يوجب الغسل، وإذا كان مذياً فإنه يوجب غسل الذكروالأنثيين مع الوضوء أيضاً.\n\n(الثاني): النوم إذا كان كثيراً بحيث لا يشعر النائم لو أحدث، فأما إذا كان النوم يسيراً يشعر النائم بنفسه لو أحدث فإنه لا ينقض الوضوء، ولا فرق في ذلك أن يكون نائماً مضطجعاً أو قاعداً معتمداً أو قاعداً غير معتمد، فالمهم حالة حضور القلب، فإذا كان بحيث لو أحْدث لأحسَّ بنفسه فإن وضوءه لا ينتقض، وإن كان في حال لو أحْدث لم يحسّ بنفسه، فإنه يجب عليه الوضوء، وذلك لأن النوم نفسه ليس بناقض وإنما مظنة الحدث، فإذا كان الحدثُ مُنتقياً لكون الإنسان يشعر به لو حصل منه، فإنه لا ينتقض الوضوء.\n\n(والدليل على أن النوم نفسه ليس بناقض أن يسيره لا ينقض الوضوء، ولو كان ناقضاً لنقض يسيرهُ وكثيرهُ كما ينقض البولُ يسيرهُ وكثيره.)\n\n(الثالث): أكل لحم الجزور، فإذا أكل الإنسان من لحم الجزور -الناقة أو الجمل-، فإنه ينتقض وضوؤه سواءً كان نيِّا أو مطبوخاً، لأنه ثبت عن رسول الله صلى الله عليه وسلم في حديث جابر بن سمرة، أنه سأل النبي صل الله عليه وسلم أنتوضأ من لحوم الغنم؟ قال: \"إنْ شئت\"، فقال: أنتوضأ من لحوم الإبل؟ قال: \"نعم\"، فكونه صلى الله عليه وسلم يجعل الوضوء من لحم الغنم راجعاً إلى مشيئة الإنسان، وأنه لابدَّ منه، وعلى هذا فيجب الوضوء من لحم الإبل إذا أكله الإنسان نيئاً أو مطبوخاً، ولا فرق بين اللحم الأحمر واللحم غير الأحمر، فينقض الوضوء أكلُ الكرش والأمعاء والكبد والقلب والشحم وغير ذلك، وجميع أجزاء البعير ناقضٌ للوضوء، لأن الرسول صلى الله عليه وسلم لم يُفصِّل وهو يعلم أن الناس يأكلون من هذا ومن هذا، ولو كان الحكم يختلف لكان النبي صلى الله عليه وسلم يبيِّنه للناس حتى يكونوا على بصيرة من أمرهم.\n\nثم إننا لا نعلم في الشريعة الإسلامية حيواناً يختلف حُكمه بالنسبة لأجزائه، فالحيوان إمّا حلال أو حرام، وإما موجب للوضوء أو غير موجب، وأما أن يكون بعضه له حكم وبعضه له حكم فهذا لا يُعرف في الشريعة الإسلامية، وإن كان معروفاً في شريعة اليهود، كما قال الله تعالى: {وعلى الذين هادوا حرَّمنا كلَّ ذي ظفر من البقر والغنم حرمنا عليهم شحومهما إلا ما حملت ظهورهما أو الحوايا أو ما اختلط بعظم}، ولهذا أجمع العلماء على أن شحم الخنزير مُحَّرم مع أن الله تعالى لم يذكر في القرآن إلا اللحم، فقال تعالى: {حُرِّمت عليكم الميتة والدم ولحم الخنزير وما أهلَّ لغير الله به}، ولا أعلم خلافاً بين أهل العلم في أن شحم الخنزير محرَّم. وعلى هذا فنقول: اللحم المذكور في الحديث بالنسبة للإبل يدخل فيه الشحم والأمعاء والكرش وغيرها.                      ",
    "number-en": "Nullifiers of ablution and tayammum",
    "label-en": "Among the matters that have occurred is disagreement among scholars, but we will mention what is contradictory according to the evidence:\n\n(The first): The one that comes out of the two tracts, that is, the one that comes out of the vagina or the anus. Everything that comes out of the vagina or anus invalidates ablution, whether it is urine, defecation, precum, semen, or wind. Everything that comes out of the vagina or anus invalidates ablution and you are not asked about it. But if it is semen and comes out with desire, then it is known that it requires washing, and if it is precipitous fluid, then it is obligatory. Washing the male and female parts with ablution as well.\n\n(Second): If the sleep is a lot such that the sleeper does not feel if he breaks, but if the sleep is short, the sleeper feels himself if he breaks, then it does not invalidate the ablution, and it makes no difference whether he is sleeping lying down, or sitting supported, or sitting unsupported. What is important is the state of the presence of the heart. If it is such that if it breaks, he would feel himself, then his ablution is not invalidated, and if he sleeps reclining, or sitting supported, or sitting unsupported, what is important is the state of the presence of the heart. If it is such that if it breaks, he would feel himself, then his ablution is not invalidated, and if if he breaks, he does not feel himself, then he must perform ablution. This is because sleep itself does not invalidate it, but rather the suspicion of the event. If the event is specific because the person would feel it if it occurred from it, then it does not invalidate ablution.\n\n(The evidence that sleep itself is not invalidating is that even a little of it does not invalidate ablution, and if it was invalid, it would invalidate a little of it or a lot of it, just as urination nullifies a little of it or a lot of it.)\n\n(Third): Eating the meat of a camel. If a person eats the meat of a camel - a camel or a camel - then his ablution is invalidated, whether it was raw or cooked, because it was proven from the Messenger of God, may God bless him and grant him peace, in the hadith of Jabir bin Samra, that he asked the Prophet, may God bless him and grant him peace, “Should I perform ablution from sheep meat?” He said: “If you wish.” He said: Should I perform ablution from camel meat? He said: “Yes,” because the fact that he, may God’s prayers and peace be upon him, makes ablution from sheep meat due to the human will, and that it is necessary. Accordingly, ablution must be performed from camel meat if a person eats it raw or cooked, and there is no difference between red meat and non-red meat. The ablution is invalidated by eating the tripe, intestines, liver, heart, fat, etc., and all parts of a camel invalidate ablution, because the Messenger, may God bless him and grant him peace, did not elaborate, knowing that people They eat from this and from that, and if the ruling were different, the Prophet, may God bless him and grant him peace, would have explained it to the people so that they would have insight into their situation.\n\nThen we do not know in the Islamic Sharia of an animal whose ruling differs in relation to its parts. An animal is either permissible or forbidden, and either requires ablution or does not. As for some of it having a ruling and some of it having a ruling, this is not known in the Islamic Sharia, even if it is known in the Sharia of the Jews, as God Almighty said: {And to those who are Jews We have forbidden to them every animal with nails of cows and sheep; We have forbidden to them their fat, except that which they bear. Their backs, or the insides, or what is mixed with bone}, and for this reason the scholars agreed that pork fat is forbidden even though God Almighty did not mention anything in the Qur’an except meat, so God Almighty said: {Forbidden to you is dead meat, and blood, and the flesh of pork, and what has been dedicated to other than God}, and I do not know of a disagreement among the people of knowledge that pork fat is forbidden. Based on this, we say: The meat mentioned in the hadith in relation to camels includes fat, intestines, belly, etc."
  },
  {
    "number": "كيفية صلاة الجماعة ",
    "text": "",
    "label": "كون صلاة الجماعة بين مجموعة من المصلين وتجوز ان تكون بين إثنين من المصلين، وحكمها سنة ليس على تاركها الإثم وإنما يأخذ فاعلها الأجر العظيم والثواب من الله عز وجل.\n\nصلاة الجماعه للمرأة:\n\nتتم بنفس طريقة صلاة الجماعة للرجل باستثناء: أن المرأة الإمام لا تتقدم على المأمومين وإنما تقف بينهم، لأن الواجب في المرأة هو السترة. كما أنه ليس للمرأة الإمام أن ترفع صوتها في الصلاة الجهرية وإنما تؤديها بنفس الطريقة لبقية الصلوات الأخرى. ولا تشرع الأذان وإقامة الصلاة للمرأة في صلاة الجماعة، وكذلك لا يشرع لها ذلك في الصلاة المنفردة.                      ",
    "number-en": "How to perform congregational prayer",
    "label-en": "The fact that congregational prayer is between a group of worshipers and it is permissible for it to be between two worshipers, and its ruling is a sunnah, and the one who abandons it is not sinful, but rather the one who does it receives the great reward and reward from God Almighty.\n\nCongregational prayer for women:\n\nIt is performed in the same way as the congregational prayer for men, except that the woman imam does not go ahead of the people praying behind them, but rather stands between them, because what is obligatory for a woman is a sutrah. It is also not permissible for the woman imam to raise her voice during the aloud prayer, but rather perform it in the same way for the rest of the other prayers. It is not permissible for a woman to call the call to prayer and establish prayer in congregational prayer, nor is it permissible for her to do so in solo prayer."
  },
  {
    "number": "كيفية صلاة الجمعة ",
    "text": "",
    "label": "صلاةُ الجُمُعة كسائر الصّلوات تُصلّى بتكبيرة إحرامٍ وقراءة قرآن وركوعٍ وسجود وقيام، وإنَّما تميّزت عن باقي الصّلوات ببعض الأمور منها ما يُشرع قبل البدء بالصّلاة ومنها ما هو داخلٌ في الصّلاة وبيانها على النّحو الآتي: \n\n(أفعال ما قبل الخُطبة والصَّلاة) \n\nتمتازُ صلاةُ الجُمُعة ببعض الأعمال والتَصرُّفات قبل الصَّلاة منها: \n\n(الغُسل) \n\nويُستَحَبُّ الاغتسال للجُمعة بعد الفَجر، وكلما اقترب الاغتسال مع وقت الذّهاب للجُمُعة كان أفضل وأحبّ، أمّا الاغتسال قبل الفجر فلا يُقبل بقصد الاغتسال للجُمعة، ويكون الاغتسال لمن نوى أداءها فقط. الإبكار في الذّهاب للمسجد: فعن أبي هريرة - رضى الله عنه - أنّ النّبي عليه الصّلاة والسّلام قال: (من اغتَسَل يومَ الجُمعةِ غُسلَ الجنابةِ ثمَّ راح فكأنَّما قرَّب بدنةً، ومن راح في السَّاعةِ الثَّانيةِ فكأنَّما قرَّب بقرةً، ومن راح في السَّاعةِ الثَّالثةِ فكأنَّما قرَّب كبشًا أقرنَ، ومن راح في السَّاعةِ الرَّابعةِ فكأنَّما قرَّب دجاجةً ومن راح في السَّاعةِ الخامسةِ فكأنَّما قرَّب بيضةً فإذا خرج الإمامُ حضرت الملائكةُ يستمعون الذِّكرَ) قال المفسرون: قوله غسل الجنابة أي كغُسل الجنابة، وقيل: أي جامع ثم اغتسل، وقيل في اعتبار ساعة الذّهاب للمسجد أنّها تُعتَبر بمُجرّد طلوع الشّمس، وقيل: من أول طلوع الفجر الثّاني، وقيل: إنّ الاعتبار يكون من وقت الزّوال؛ أي قُبيل الظّهر بما يُقارب النِّصف ساعة. \n\nالتَّزيُّن والتَطيُّب\n(يُسنُّ لِمُصلِّي الجُمُعة أن يلبس أجمل الثِّياب) \n\nويَتطيّب ويمشي إلى المسجد بتؤدة فلا يُسرع؛ لما رُوِي عنه - عليه الصّلاة والسّلام - قال: (منِ اغتسلَ يومَ الجُمعةِ فأحسنَ غسلَهُ، وتطَهَّرَ فأحسنَ طُهورَهُ، ولبسَ من أحسنِ ثيابِهِ، ومسَّ ما كتبَ اللَّهُ لَهُ من طيبِ أَهلِهِ، ثمَّ أتى الجمعةَ ولم يلغُ ولم يفرِّق بينَ اثنينِ، غفرَ لَهُ ما بينَهُ وبينَ الجمعةِ الأخرى)،ويُستحبّ التزيُّن للجمعة كذلك بتوضيب الشَّعر، وتقليم الأظافر، والاستياك !استعمال السِّواك.\n\n(كيفيّة الصَّلاة والخُطبة) \n\nتنقسم صلاة الجُمعة إلى ركعتين وخُطبتين قبلها، وهي في أصلها أربع ركعاتٍ كالظّهر؛ إلا أن الفُقهاء قالوا إنّ خُطبتَي الجمعة تُحسبان بركعتين ثم تُصلّى تتمّة الأربعة ركعتين وهي صلاة الجُمعة، قال عمر: (صلاةُ الأضحى ركعتانِ، وصلاةُ الفطرِ ركعتانِ، وصلاةُ الجمعةِ ركعتانِ، وصلاةُ المسافرِ ركعتانِ، تمامٌ غيرُ قصرٍ، على لسانِ نبيِّكُم صلَّى اللهُ عليْهِ وسلَّمَ، وقد خاب من افترى)، فلها رُكنان أساسيّان هما: الصَّلاة والخُطبَة، والصّلاة ركعتان بقراءةٍ جهرية إجماعاً: الخُطبة: وهي خطبتان قبل الصّلاة على عكس صلاة العيد حيث تكون فيها الخُطبة بعد الصّلاة، وأقَلَّ ما يُسَمى خُطبةً عند العرب، تشتمل على حمدٍ لله تعالى والصَّلاة على رسوله، ووعظٍ في أمور الدّين والدّنيا، وقراءة قرآنٍ، ويُسَنُّ قبلها أربع ركعاتٍ اتّفاقاً، وبعدها عند الجمهور كذلك أربع ركعتان، وخالف المالكيّة في ذلك.                      ",
    "number-en": "How to pray Friday",
    "label-en": "Friday prayer, like all other prayers, is prayed with the takbeerat al-Ihram, reading the Qur’an, bowing, prostrating, and standing. However, it is distinguished from the rest of the prayers by some things, including what is prescribed before starting the prayer, and including what is included in the prayer, and its explanation is as follows: \n\n(Actions before the sermon and prayer) \n\nFriday prayer is characterized by some actions and actions before the prayer, including: \n\n(washing) \n\nIt is desirable to perform ablution for Friday after dawn, and the closer the ablution comes to the time of going to Friday prayer, the better and more desirable it is. As for ablution before dawn, it is not acceptable with the intention of ablution for Friday, and ablution is for those who intend to perform it only. Going early to the mosque: On the authority of Abu Hurairah - may God be pleased with him - that the Prophet, may the peace and blessings of God be upon him, said: (Whoever takes a bath on Friday has done the ritual ritual bath of ritual impurity, and then goes, it is as if he had sacrificed a camel, and whoever goes in the second hour, it is as if he had sacrificed a cow, and whoever goes in the third hour, it is as if he had sacrificed a ram. Qaran, and whoever goes at the fourth hour, it is as if he sacrificed a chicken, and whoever goes at the fifth hour, it is as if he sacrificed an egg. When the imam comes out, the angels are present, listening to the dhikr.) The commentators said: His saying, “ghusl from impurity,” meaning like the ritual bath of ritual impurity, and it was said: that is, he had intercourse and then took a bath. It was said in considering the hour of going to the mosque that it is considered merely sunrise. The sun, and it was said: from the beginning of the rise of the second dawn, and it was said: that the consideration is from the time of noon; That is, approximately half an hour before noon. \n\nAdornment and perfuming\n(It is Sunnah for the Friday prayer to wear the most beautiful clothes) \n\nHe should perfume himself and walk to the mosque slowly, so he should not rush. As it was narrated from him - may the peace and blessings of God be upon him - he said: (Whoever bathes on Friday and does it well, and purifies himself well, and wears one of his best clothes, and touches what God has decreed for him of his family’s perfume, then comes to Friday and does not cancel it and does not differentiate between two people, will be forgiven. He has what comes between him and the next Friday). It is also recommended to adorn oneself for Friday by arranging one’s hair, trimming one’s nails, and using the siwak.\n\n(How to pray and sermon) \n\nFriday prayer is divided into two rak'ahs and two sermons before it. It is essentially four rak'ahs, like the noon prayer. However, the jurists said that the two Friday sermons are counted as two rak’ahs, and then the completion of the four rak’ahs is prayed, which is the Friday prayer. Omar said: (The Eid al-Adha prayer is two rak’ahs, the Fitr prayer is two rak’ahs, the Friday prayer is two rak’ahs, and the traveler’s prayer is two rak’ahs, complete and not shortened, on the tongue of your Prophet, may God’s prayers and peace be upon him. It has two basic pillars: prayer and the sermon, and the prayer is two rak’ahs recited aloud by consensus: The sermon: which is two sermons before the prayer, in contrast to the Eid prayer, in which the sermon is after the prayer, and the least of what is called a sermon among the Arabs, which includes praise to God Almighty, prayers upon His Messenger, and an exhortation in Religious and worldly matters, and reading the Qur’an, and it is Sunnah to perform four rak’ahs before it, according to consensus, and after it, according to the majority, also four two rak’ahs, and the Malikis differed in this regard."
  },
  {
    "number": "كيفية صلاة الاستخارة ",
    "text": "",
    "label": "صلاة الاستخارة مثل أي صلاة فريضة أو سنة تحتاج إلى وضوء. استحضار النية عند الوقوف بين يدي الله. صلاة الاستخارة عبارة عن ركعتين، يتم بالركعة الأولى قراءة الفاتحة وسورة الكافرون، أمّا الركعة الثانية الفاتحة والصمد، وبعد الانتهاء من الركعتين يسلم المصلي. يظل المصلى جالساً جلسة التسليم ويقوم بالتضرع إلى الله والخشوع بين يديه واستحضار عظمة الله، ثمّ يدعو دعاء الاستخار وهو على يقين بأن الله سيكون في عونه. بعدها يتمّ الصلاة على النبيّ، والتوكّل على الله سبحانه وتعالى. علامات الاستخارة الكثير من الناس تظن أن نتيجة الاستخارة تظهر في حلم واضح بعد صلاة الاستخارة، وهذا غير صحيح لأن الحلم واحد فقط من الكيفيات التي تظهر عليها نتيجة الاستخارة، ولكن الأساس ما يوقر في القلب من اطمئنان، وكذلك تيسير الله للموضوع المستخار فيه.                      ",
    "number-en": "How to pray Istikhara",
    "label-en": "Istikhara prayer, like any obligatory or Sunnah prayer, requires ablution. Conjure the intention when standing before God. The Istikhara prayer consists of two rak'ahs. In the first rak'ah, Al-Fatihah and Surat Al-Kafirun are recited, while the second rak'ah is Al-Fatihah and Al-Samad. After completing the two rak'ahs, the praying person says the salutation. The person praying remains seated during the salutation session and supplicates to God with humility before him and recalls the greatness of God. Then he says the supplication of istikhaar and is certain that God will help him. Then complete prayers upon the Prophet, and trust in God Almighty. Signs of Istikhara: Many people think that the result of Istikhara appears in a clear dream after praying Istikhara, and this is not true because the dream is only one of the ways in which the result of Istikhara appears, but the basis is the reassurance that resides in the heart, as well as God’s facilitation of the subject in which the Istikhara is performed."
  },
  {
    "number": "دعاء الاستخارة ",
    "text": "",
    "label": "(اللهم إني أَستخيرُك بعِلمِك، وأستقدِرُك بقُدرتِك، وأسألُك من فضلِك، فإنك تَقدِرُ ولا أقدِرُ، وتَعلَمُ ولا أَعلَمُ، وأنت علَّامُ الغُيوبِ، اللهم فإن كنتَُ تَعلَمُ هذا الأمرَ -ثم تُسمِّيه بعينِه- خيرًا لي في عاجلِ أمري وآجلِه -قال: أو في دِيني ومَعاشي وعاقبةِ أمري- فاقدُرْه لي ويسِّرْه لي، ثمّ بارِكْ لي فيه، اللهم وإن كنتَُ تَعلَمُ أنه شرٌّ لي في دِيني ومَعاشي وعاقبةِ أمري -أو قال: في عاجلِ أمري وآجلِه- فاصرِفْني عنه، واقدُرْ ليَ الخيرَ حيثُ كان ثمّ رَضِّني به) [صحيح البخاري].                       ",
    "number-en": "Istikhara prayer",
    "label-en": "(O God, I ask You for guidance with Your knowledge, and I seek guidance from You with Your power, and I ask You of Your grace. You have power and I cannot, and You know and I do not know, and You are the Knower of the unseen. Oh God, if You know this matter - then you name it specifically - it is better for me in my immediate and later affairs - he said: Or in My religion, my livelihood, and the outcome of my affairs - so ordain it for me and make it easy for me, then bless it for me. O God, if You know that it is bad for me in my religion, my livelihood, and the outcome of my affairs - or he said: in my present and future affairs - then turn me away from it, and ordain for me the good wherever it may be, and then be pleased with it) [Sahih Al-Bukhari]."
  },
  {
    "number": "كيفية الصلاة على الميت ",
    "text": "",
    "label": "يعقد النِّية القلبيّة على أداء الصَّلاة على الميت. يُكبر بقول: الله أكبر، ثُمّ يتعوذّ بقول: أعوذ بالله من الشَّيطان الرَّجيم، \nثُمّ يُبسَمل بقول: بسم الله الرَّحمن الرَّحيم. يبدأ الصَّلاة بقراءة سورة الفاتحة تليها سورةٌ من سُور القرآن الكريم القصيرة كسُورة الإخلاص أو سُورة العصر أو يقرأ بعضاً من الآيات ولا يُطلْ في القراءة. يُكبر بعد الفراغ من القراءة بقول: الله أكبر مع رفع اليدين بمحاذاة المنكبين. يُصلي على النَّبي صلى الله عليه وسلم بنفس الصَّلاة عليه في التَّشهد بقول: اللهم صلِّ على محمد وعلى آل محمدٍ كما صلَّيت على إبراهيم وعلى آل إبراهيم في العالمين إنَّك حميدٌ مجيدٌ، وبارك على محمدٍ وعلى آل محمدٍ كما باركت على إبراهيم وعلى آل إبراهيم في العالمين إنَّك حميدٌ مجيدٌ. يُكبر بقول: الله أكبر \n(بعد الانتهاء من الصَّلاة على النّبي الكريم مع رفع اليدين. يدعو للميت بالرَّحمة والمغفرة والثَّبات عند السؤال ودخول الجنة)\nبما ورد عن النَّبي صلى الله عليه وسلم من الأدعية المأثورة، قال صلى الله عليه وسلم:\" اللهم اغفرْ لَهُ وارحمهُ، وعافِهِ واعفُ عنهُ، وأكْرِم نُزَلَهُ، ووسِّع مُدَخلَهُ، واغسلْهُ بالماءِ والثَّلجِ والبَردِ، ونقِّهِ منَ الخطايا كما نقَّيتَ الثَّوبَ الأبيضَ منَ الدَّنسِ، وأبدِلهُ داراً خَيراً مِن دارِهِ، وأهلاً خَيراً مِن أهلِهِ، وزَوجاً خَيراً مِن زَوجِهِ، وأدخِلهُ الجنَّةَ ونجِّهِ منَ النَّارِ ـ أو قالَ ـ وأَعِذْهُ مِن عذابِ القبرِ\". بعد الدُّعاء للميت يُكبر الله أكبر رافعاً يديه. يُسّلم عن اليمين فقط تسليمةً واحدة ويقول: السَّلام عليكم ورحمة الله، وبذلك تنتهي الصَّلاة على الميت صلاة بلا ركوعٍ أو سجودٍ وبتسليمةٍ واحدةٍ فقط.                       ",
    "number-en": "How to pray for the dead",
    "label-en": "He makes the heartfelt intention to perform the prayer for the dead. He grows up by saying: God is great, then he seeks refuge by saying: I seek refuge in God from the accursed Satan. \nThen he says: In the name of God, the Most Gracious, the Most Merciful. He begins the prayer by reciting Surah Al-Fatihah, followed by a short surah of the Holy Qur’an, such as Surah Al-Ikhlas or Surah Al-Asr, or he recites some of the verses and does not prolong the reading. After completing the recitation, he says “Allahu Akbar” by saying: “Allahu Akbar” while raising the hands in line with the shoulders. He prays upon the Prophet, may God bless him and grant him peace, with the same blessing upon him in the Tashahhud by saying: O God, bless Muhammad and the family of Muhammad as You blessed Abraham and the family of Abraham in the worlds. You are Praiseworthy and Glorious, and bless Muhammad and the family of Muhammad as You blessed Abraham and the family of Abraham in the worlds. You are Praiseworthy and Glorious. He grows up by saying: God is great \n(After completing the blessing upon the Noble Prophet, with the hands raised, he prays for mercy and forgiveness for the dead, steadfastness when asked, and entry into Paradise)\nAccording to what was reported from the Prophet, may God’s prayers and peace be upon him, of the well-known supplications, he said, may God’s prayers and peace be upon him: “O God, forgive him and have mercy on him, pardon him, honor his abode, widen his entrance, wash him with water, ice, and hail, and purify him of sins just as you purified a white garment of filth, and replace him with a better house than his own, and a better family than his family, and a better wife than his wife, and admit him to Paradise and save him from Hell - or he said - and protect him from the torment of the grave.” After praying for the dead, God is great, raising his hands. He only says one salutation to the right and says: May the peace and mercy of God be upon you. Thus, the prayer for the dead ends with a prayer without bowing or prostration and with only one salutation."
  },
  {
    "number": "كيفية صلاة الشفع والوتر",
    "text": "",
    "label": "تُصلّى صلاة الشفع والوتر على شكل ثلاث ركعات، تُقرأ سورة الفاتحة وسورة الأعلى في الركعة الأولى، وتُقرأ سورة الفاتحة وسورة الكافرون في الركعة الثانية، ثم يسلم، وهذه الركعتان هي التي تسمى بالشفع، أما الوتر فهي ركعة واحدة تتبع الركعات السابقة، ويُقرأ فيها سورة الفاتحة والإخلاص ثم يركع. وقد وردت طريقة الصّلاة عن الرّسول عليه السّلام في الحديث الشريف: فعن أبي بن كعب رضي الله عنه قال: (أنَّ رسولَ اللَّهِ صلَّى اللَّهُ عليهِ وسلَّمَ كانَ يوتِرُ بسَبِّحِ اسْمَ رَبِّكَ الْأَعْلَى، وقُلْ يَا أيُّهَا الْكَافِرُونَ، وقُلْ هُوَ اللَّهُ أَحَدٌ، وَكانَ يقولُ: سبحانَ الملِكِ القدُّوسِ ثلاثًا، ويرفعُ صوتَه بالثَّالثةِ). ويجوز للمصلي أن يُصلي الركعاث الثلاث مُتصلة، ولكن لا يقعد فيها للتشهد الأوسط، وذلك حتى لا تتشابه بصلاة المغرب، وإنما يقعد فيها قعوداً واحداً وهو للتشهد الأخير، كما يمكن أن يوتر بخمس، أو سبع، أو تسع، أو إحدى عشرة ركعة، استناداً إلى حديث الرّسول عليه السّلام: (الوِترُ حقٌّ على كلِّ مسلمٍ، فمن أحبَّ أن يوترَ بخمسٍ فليفعَلْ، ومن أحبَّ أن يوترَ بثلاثٍ فليفعل، ومن أحبَّ أن يوترَ بواحدةٍ فليفعَلْ). من المهم أيضاً الإشارة أن الوتر لا يُصلّى أكثر من مرّة واحدة في الليلة، فلكل ليلة وترها، وهو أمر ورد عن الرّسول عليه السّلام في حديثه الشّريف: (زارنا أبا طلقُ بنُ عليٍّ في يومٍ من رمضانَ فأمسى بنا، وقامَ بنا تلْكَ اللَّيلةَ وأوترَ بنا، ثمَّ انحدرَ إلى مسجدٍ فصلَّى بأصحابِهِ حتَّى بقيَ الوترُ، ثمَّ قدَّمَ رجلاً، فقالَ لَهُ: أوتر بِهم، فإنِّي سمعتُ رسولَ اللَّهِ صلى الله عليه وسلم يقولُ: لاَ وترانِ في ليلةٍ).                       ",
    "number-en": "How to perform the Shaf’ and Witr prayers",
    "label-en": "The Shaf’ and Witr prayers are performed in the form of three rak’ahs. Surah Al-Fatiha and Surat Al-A’la are read in the first rak’ah, and Surat Al-Fatiha and Surat Al-Kafirun are read in the second rak’ah, then the salutation is said. These two rak’ahs are what are called the Shaf’. As for Witr, it is one rak’ah that follows the previous rak’ahs, in which Surat Al-Fatiha and Al-Ikhlas are recited and then bows. The method of prayer was mentioned on the authority of the Messenger, peace be upon him, in the noble hadith: On the authority of Ubayy bin Ka’b, may God be pleased with him, he said: (The Messenger of God, may God’s prayers and peace be upon him, used to pray Witr to glorify the name of your Lord Most High, and say, “O disbelievers,” and say, “It is.” God is One, and he used to say: Glory be to the Holy King three times, and raise his voice a third time.) It is permissible for the praying person to pray the three rak’ahs in a continuous manner, but not to sit in them for the middle tashahhud, so that it is not similar to the Maghrib prayer. Rather, he should sit in it in one sitting, which is for the final tashahhud. He may also perform the Witr prayer with five, seven, nine, or eleven rak’ahs, based on the hadith of the Messenger, peace be upon him: (Witr is a duty upon every Muslim, so whoever likes to pray Witr with five, let him do so, and whoever likes to pray Witr with five, let him do so. He may perform the Witr prayer with three things, let him do so, and whoever wishes to perform the Witr prayer with one prayer, let him do so.) It is also important to point out that the Witr prayer should not be prayed more than once a night, as every night has its own Witr prayer, and this is something that was reported from the Messenger, peace be upon him, in his noble hadith: (Abu Talq ibn Ali visited us one day in Ramadan and spent the evening with us, and he rose with us that night and performed the Witr prayer with us, then he went down to a mosque and prayed with his companions until the Witr prayer remained, then He brought a man and said to him: Perform the Witr prayer with them, for I heard the Messenger of God, may God bless him and grant him peace, say: No, perform the Witr prayer with them in the night."
  },
  {
    "number": "كيفية صلاة قيام الليل ",
    "text": "",
    "label": "يُستحبُ أن تُبدأَ صلاة قيام اللّيل بركعتين خفيفتين ثم تُكمَّل الصّلاة ركعتين ركعتين لما ورد عن رسول الله، فعَنْ زَيْدِ بْنِ خَالِدٍ الْجُهَنِيِّ - رضي الله عنه - قَالَ: (صَلَّى رَسُولُ اللهِ صلى الله عليه وسلم رَكْعَتَيْنِ خَفِيفَتَيْنِ، ثُمَّ صَلَّى رَكْعَتَيْنِ طَوِيلَتَيْنِ طَوِيلَتَيْنِ طَوِيلَتَيْنِ، ثُمَّ صَلَّى رَكْعَتَيْنِ وَهُمَا دُونَ اللَّتَيْنِ قَبْلَهُمَا، ثُمَّ صَلَّى رَكْعَتَيْنِ وَهُمَا دُونَ اللَّتَيْنِ قَبْلَهُمَا، ثُمَّ صَلَّى رَكْعَتَيْنِ وَهُمَا دُونَ اللَّتَيْنِ قَبْلَهُمَا، ثُمَّ صَلَّى رَكْعَتَيْنِ هُمَا دُونَ اللَّتَيْنِ قَبْلَهُمَا، ثُمَّ أَوْتَرَ، فَذَلِكَ ثَلَاثَ عَشْرَةَ رَكْعَةً)، وبذلك تُصلى صلاة القيام رَكعتين رَكعتين، وذلك قول الجمهور من العلماء الشافعية، والحنابلة، والمالكية، والعثيمين، وابن باز، وغيرهم من العلماء.                      ",
    "number-en": "How to pray the night prayer",
    "label-en": "It is desirable to begin the night prayer with two light rak’ahs and then complete the prayer with two light rak’ahs, according to what was reported from the Messenger of God. On the authority of Zayd bin Khaled al-Juhani - may God be pleased with him - he said: (The Messenger of God, may God’s prayers and peace be upon him, prayed two light rak’ahs, Then he prayed two long, long rak'ahs, then he prayed two rak'ahs, which were inferior to the ones before them, then he prayed two rak'ahs, which were inferior to the ones before them. The two before them, then he prayed two rak’ahs, which were less than the ones before them, then he prayed two rak’ahs, which were less than those before them, then he performed Witr, That is thirteen rak'ahs), and thus the standing prayer is prayed two rak'ahs by rak'ah, and that is the opinion of the majority of Shafi'i scholars, Hanbalis, Malikis, Al-Uthaymeen, Ibn Baz, and other scholars."
  },
  {
    "number": "وقت صلاة قيام الليل ",
    "text": "",
    "label": "تبدأُ صلاةُ قيام اللّيل بعدَ انتهاء صلاةِ العشاء إلى طلوع الفجر الثّاني،ويُفضّل أن تكونَ في الثّلث الأخير من اللّيل كما جاء في الحديث الصّحيح إذ يقول النّبي عليه الصّلاة والسّلام: (أحَبُّ الصّلاة إلى الله صلاة داود عليه السّلام، وأحَبُّ الصّيام إلى الله صيام داود، وكان ينام نصف اللّيل، ويقوم ثلثه، وينام سدسه، ويصوم يوماً ويُفطر يوماً)،يعني ذلك أنّه كان يصلّي السُدس الرّابع والسُدس الخامس، وإذا قام ففي الثّلث الأخير لما في ذلك فضل عظيم؛ لأنّ الله تعالى يَنزل إلى السّماء الدّنيا في هذا الجزء من اللّيل، إلا أنّها تجوز في أول الليل ووسطه وآخره أيضاً، كلّ ذلك كما فعل رسول الله عليه الصّلاة والسّلام، فعن أنس بن مالك قال: (ما كنا نشاء أن نرى رسول الله صلى الله عليه وسلم في الليل مصليًا إلا رأيناه، ولا نشاء أن نراه نائمًا إلا رأيناه).                      ",
    "number-en": "Night prayer time",
    "label-en": "The night prayer begins after the end of the Isha prayer until the rise of the second dawn, and it is preferable for it to be in the last third of the night, as stated in the authentic hadith, when the Prophet, peace and blessings be upon him, says: (The most beloved prayer to God is the prayer of David, peace be upon him, and the most beloved fast to God is the fasting of David. He used to sleep half the night, get up for a third of it, sleep a sixth of it, fast a day and break his fast. a day), meaning that he would pray the fourth sixth and the fifth sixth, and if he stood up, he would pray the last third, because of the great merit in that. Because God Almighty descends to the lowest heaven during this part of the night, but it is permissible at the beginning, middle, and end of the night as well, all of this as the Messenger of God, may God’s prayers and peace be upon him, did. On the authority of Anas bin Malik, he said: (We did not want to see the Messenger of God, may God’s prayers and peace be upon him, praying at night unless we saw him, and we did not want to see him sleeping unless we saw him)."
  },
  {
    "number": "صلاة التراويح ",
    "text": "",
    "label": "كيفية صلاة التراويح:\n\nتُصلى صلاة التراويح ركعتين ركعتين، وذلك لما رواه عبد الله بن عمر رضي الله عنه، أنّ رسول الله صلى الله عليه وسلم، قال: (صلاةُ الليلِ مَثْنى مَثْنى، فإذا رأيتَ أنَّ الصبحَ يُدركُك فأَوتِرْ بواحدةٍ. فقيل لابنِ عمرَ: ما مَثْنَى مَثْنَى؟ قال: أن تُسلِّمَ في كلِّ ركعتَينِ) أما كيفية تأدية صلاة التراويح بالتفصيل، فهي لا تخرج عن تأدية الصلاة المعتادة سواء كانت فرضاً أو نافلة وهي: أن ينوي المُصلّي أداء صلاة التراويح، ويجزئه في النية وجودها في القلب، وعقد العزم على أداء الصلاة. أن يستقبل المصلّي القبلة، ثم يرفع يدَيْه حذْوَ منكبَيْه أو أذنَيه، ثمّ يُكبّر قائلاً: (اللهُ أكبَرُ). أن يضع المصلّي يده اليُمنى فوق يده اليُسرى تحت سُرّته كما قال فقهاء الحنفيّة وفقهاء الحنابلة، أو يضع يديه تحت صدره كما قال فقهاء المذهب الشافعيّ، أو يرسل يديه كما قال فقهاء المالكية. أن ينظر المُصلّي إلى موضع سجوده، ثم يقرأ دعاء الاستفتاح مبتدِئاً صلاته به. أن يتعوّذ المصلّي بالله من الشيطان الرجيم سرّاً، ثم يقرأ سورة الفاتحة مُبتدئاً بها بالبسملة. أن يقرأ المصلّي ما تيسّر له من آيات القرآن الكريم. أن يركع المصلي، ويتوجّب عليه عند الانتقال أن يكبِّر للركوع، ويأخذ ركبتيه بيديه، مفرجاً أصابعه عن بعضها البعض، وباسطاً ظهره مستقيماً، وناصباً ساقيه، ويقول المصلّي في ركوعه: (سبحان ربي العظيم). أن يرفع المصلّي رأسه عند الانتهاء من الرّكوع وهو يقول: (سَمِعَ الله لِمَنْ حَمِدَه)، ثمّ يقف قليلاً من الوقت وهو مُعتدِل في قيامه. أن يهوي المصلّي إلى السّجود، ويضع ركبتيه قبل يديه، وأن ويقول في سجوده: (سُبحانَ ربّيَ الأعلى وَبِحَمْده) ثلاث مرّاتٍ، أو مرّتين، أو مرّةً، بشرط أن يتحقق الاطمئنان في السجود. أن يجلس المصلّي بين السجدتين قليلاً، ويقول خلال جلوسه: (رب اغفر لي). أن يسجد المصلّي مرّةً ثانيةً، ثمّ ينتقل إلى القيام. أن يأتي المصلّي بالرّكعة الثانية بالهيئة نفسها التي أتى بها في الركعة الأولى، إلاّ أنّه لا يقرأ دُعاء الاستفتاح في الركعة الثانية. أن يجلس المصلّي بعد انتهائه من السّجدة الثانية في الركعة الثانية؛ بحيث تكون أصابعه موجّهةً نحو القبلة، وتكون يداه على فخذيه، ثم يقرأ التشهد الأخير، فيقول: (التَّحِيّاتُ للهِ، والصَّلَواتُ والطَّيِّباتُ، السَّلامُ عليكَ أيُّها النبيُّ، ورحمةُ اللهِ وبَرَكاتُهُ، السَّلامُ عَلَينا وعلى عِبادِ الله الصّالِحين، أشْهدُ أن لا إله إلا الله، وأشْهدُ أنّ مُحمّداً عبدُهُ ورَسولُهُ)، ثمّ يقرأ الصّلاة الإبراهيميّة فيقول: (اللّهُمّ صلِّ على مُحمَّدٍ وعلى آلِ مُحمَّدٍ، كما صلَّيْتَ على إبراهيمَ وعلى آل إبراهيمَ، إنَّكَ حَميدٌ مَجيدٌ، اللَّهُمَّ بارِك على محمّدٍ وعلى آل محمَّدٍ، كما بارَكْتَ على إبراهيمَ وآلِ إبراهيمَ، إنَّكَ حَميدٌ مَجيدٌ). أن يُسلّم المصلّي عن اليمين، ثمّ عن الشّمال، ويقول في كلّ تسليمةٍ: (السَّلامُ عليْكُمْ وَرَحمَةُ اللهِ). ويُستحب أن يجلس المُصلّي بعد كل أربع ركعات جلسة للاستراحة.\n\nوقت صلاة التراويح:\n\nذهب جمهور الفقهاء من الحنفية، والشافعية، والمالكية، والحنابلة إلى أنّ وقت صلاة التراويح يكون من بعد صلاة العشاء، وقبل الوتر إلى طلوع الفجر؛ واستدلوا على ذلك بما نُقل عن السلَف، وبما فعله الصحابة رضوان الله عليهم، ولأنّها سُنة تابعة للعِشاء فكان وقتها قبل الوتر. أما إذا صلّى المصلّي صلاة التراويح بعد المغرب، وقبل العشاء فذهب جمهور الفقهاء من الشافعية والمالكية والحنابلة والأصح عند الحنفية أنها لا تُجزئ، وقال المالكية بأنها تكون نافلة. أما إذا صلّاها المصلّي بعد الوتر فذهب فقهاء الحنفية في الأصح عندهم إلى أنها تُجزئ، وذهب الشافعية والحنفية إلى أنّه يُستحب تأخير صلاة التراويح إلى ثُلث الليل أو إلى نصفه، وذهب فقهاء الحنابلة إلى أنّ صلاة التراويح في أول الليل أفضل.\n\nحكم صلاة التراويح:\n\nاتفق الفقهاء على أنّ صلاة التراويح سُنّة عن النبي صلى الله عليه وسلم، وقال فقهاء الحنفية والحنابلة وبعض المالكية إنّ صلاة التراويح سنة مؤكدة، وصلاة التراويح سنة للرجال والنساء على السواء.فعن أم المؤمنين عائشة رضي الله عنها، أنّ رسول الله صلى الله عليه وسلم: (صلَّى في المسجدِ ذاتَ ليلةٍ، فصلَّى بصلاتِه ناسٌ، ثم صلَّى من القابلةِ، فكثُر الناسُ، ثم اجتمعوا من الليلةِ الثالثةِ أو الرابعةِ، فلم يخرجْ إليهم رسولُ اللهِ صلَّى اللهُ عليه وسلَّمَ، فلما أصبح قال: (قد رأيتُ الذي صنعتُم، فلم يمنعْني من الخروجِ إليكم إلا أني خشيتُ أن تُفرضَ عليكم)، قال: وذلك في رمضانَ). وعن أبي هريرة رضي الله عنه، قال: (كان رسولُ اللهِ صلَّى اللهُ عليه وسلَّم يُرغِّبُ في قيامِ رمضانَ من غيرِ أنْ يأمَرَهم فيه بعزيمةٍ، فيقول: مَن قامَ رَمضانَ إيمانًا واحتسابًا غُفِرَ له ما تَقدَّمَ مِن ذَنبِه)                      ",
    "number-en": "Tarawih prayer",
    "label-en": "How to pray Tarawih prayer:\n\nThe Tarawih prayer is performed in two rak'ahs, based on what was narrated by Abdullah bin Omar, may God be pleased with him, that the Messenger of God, may God bless him and grant him peace, said: (The night prayer is two by two, so if you see that the dawn is reaching you, pray Witr with one. Then Ibn Omar was asked: What is two by two? He said: To say the salaam in each. Two rak'ahs) As for how to perform the Tarawih prayer in detail, it does not deviate from performing the usual prayer, whether it is obligatory or voluntary, which is: that the worshiper intends to perform the Tarawih prayer, and it is sufficient for the intention to be present in the heart, and to be determined to perform the prayer. The praying person should face the Qiblah, then raise his hands to the level of his shoulders or ears, then say “Allahu Akbar.” That the praying person places his right hand above his left hand under his navel, as the Hanafi and Hanbali jurists said, or places his hands under his chest, as the Shafi’i jurists said, or spreads his hands as the Maliki jurists said. The praying person should look at the place of his prostration, then recite the opening supplication, starting his prayer with it. The praying person should seek refuge in God from the accursed Satan secretly, then recite Surat Al-Fatihah, beginning with the basmalah. The praying person should read whatever verses of the Holy Qur’an are available to him. The worshiper should kneel, and when moving, he must say “Allahu Akbar” to kneel, take his knees with his hands, spread his fingers apart from each other, spread his back straight, and erect his legs, and the worshiper says in his bowing: (Glory be to my Lord the Great). That the worshiper raises his head when he finishes bowing and says: (God hears whoever praises Him), then stands for a short period of time and is moderate in his standing. That the praying person leans into prostration, places his knees before his hands, and says in his prostration: (Glory be to my Lord, the Most High, and praise be to Him) three times, or twice, or once, on the condition that reassurance is achieved in prostration. The worshiper should sit for a little while between the two prostrations, and say while sitting: (Lord, forgive me). The worshiper prostrates again, then proceeds to standing. The praying person should perform the second rak’ah in the same form as he did in the first rak’ah, except that he does not recite the opening supplication in the second rak’ah. The worshiper should sit after completing the second prostration in the second rak’ah. So that his fingers are directed towards the Qiblah, and his hands are on his thighs, then he recites the final tashahhud, saying: (Greetings to God, and prayers and good things. Peace be upon you, O Prophet, and God’s mercy and blessings. Peace be upon us and the righteous servants of God. I bear witness that there is no god but God, and I bear witness that Muhammad His servant and Messenger), then he recites the Abrahamic prayer and says: (O God, bless Muhammad and the family of Muhammad, Just as You blessed Abraham and the family of Abraham, You are Praiseworthy and Glorious. O God, bless Muhammad and the family of Muhammad, just as You blessed Abraham and the family of Abraham. You are Praiseworthy and Glorious.) The praying person should salute to the right, then to the left, and say in each salutation: (Peace and mercy of God be upon you). It is desirable for the worshiper to sit after every four rak'ahs for a rest session.\n\nTarawih prayer time:\n\nThe majority of jurists from the Hanafi, Shafi’i, Maliki, and Hanbali jurists are of the opinion that the time for Tarawih prayer is from after the Isha prayer and before the Witr prayer until dawn. They used as evidence for this what was reported from the predecessors, and what the Companions, may God be pleased with them, did, and because it was a Sunnah related to the evening meal, so its time was before Witr. However, if the worshiper prays the Tarawih prayer after sunset and before the evening prayer, then the majority of jurists from the Shafi’is, Malikis and Hanbalis are of the opinion that it is more correct according to the Hanafi school that it is not sufficient, and the Malikis said that it is voluntary. But if the worshiper prays it after Witr, then the Hanafi jurists are of the opinion that it is more correct in their view that it is sufficient, and the Shafi’is and Hanafi scholars are of the opinion that it is desirable to delay Tarawih prayer until a third of the night or until half of it, and the Hanbali jurists are of the opinion that performing Tarawih prayer at the beginning of the night is better. Ruling on Tarawih prayer:\n\nThe jurists agreed that Tarawih prayer is a Sunnah from the Prophet, may God bless him and grant him peace. Hanafi, Hanbali and some Maliki jurists said that Tarawih prayer is a confirmed Sunnah, and Tarawih prayer is a Sunnah for men and women alike. On the authority of the Mother of the Believers, Aisha, may God be pleased with her, that the Messenger of God, may God bless him and grant him peace: (He prayed in the mosque one night, and people led his prayer, then the midwife prayed, The people increased, then they gathered on the third or fourth night, but the Messenger of God, may God bless him and grant him peace, did not come out to them. When the morning came, he said: (I saw what you did, and nothing prevented me from going out to you except that I feared that it would be imposed on you), and he said: And that was in Ramadan. On the authority of Abu Hurairah, may God be pleased with him, he said: (The Messenger of God, may God’s prayers and peace be upon him, wanted to pray Ramadan without ordering them to do so with determination, so he would say: Whoever prays Ramadan out of faith and seeking reward, his previous sins will be forgiven.)"
  },
  {
    "number": "كيفية صلاة التهجد ",
    "text": "",
    "label": "كيفيّة تأدية صلاة التهجد يعقد المسلم النية، ثمّ يقوم من الفراش، ويتوضأ ويحسن وضوءه، ثمّ يشدّ المئزر ويصلي عدد ما شاء من الركعات؛ لأنّ التهجد من النوافل، والنافلة هي صلاة لا محدودة الركع إما فردي وإما زوجي، ورُوي أنّ النبي عليه الصلاة والسلام كان يقوم ليله بإحدى عشرة ركعة. يستطيع المرء أن يصلي مثنى مثنى، ولا بأس من يبدأ بركعتين يجهر فيهما بالقراءة حتى لا يغلبه النعاس والنوم، ولا أن يخطئ في القراءة، ويستحب أيضاً أن يوقظ أهل بيته لأداء هذه الصلاة لما لها فضل عظيم، وعند الركوع أثناء الصلاة عليه الإطالة ويكثر من الثناء والحمد لله تعالى، وكذلك عند السجود أن يطيل في سجوده؛ لأنّه أقرب إلى الله تعالى في خشوعه، ويكثر من التسبيح، ويطيل في الدعاء ويلح في ذلك ولا ييأس لأنّ الله سميع للدعاء. يقرأ المسلم القرآن الكريم ويطيل في القراءة بتلاوة جزء أو جزئين أو ما يقدر عليه، ثمّ ينهض إلى الصلاة مرة أخرى ويقرأ ما تيسر من سور القرآن، كما يجوز له أن يجهر بصلاته أو يُخافت بها وعليه الاعتدال في ذلك. يختتم المسلم صلاة التهجد عليه أن يوتّر، فالوتر هو آخر ما يختم به المرء صلاته كما قال الرسول عليه الصلاة والسلام: (اجعلوا آخرَ صلاتِكم بالليلِ وترًا) [صحيح]، أما في شهر رمضان فيستحب التهجد بعد صلاة التراويح التي يؤديها المسلم بعد صلاة العشاء، وفي رمضان الليالي مباركة فالأجر مضاعف، فبذلك من يقوم التهجد عليه ألا يوتر بعد صلاة العشاء بل يوتر بعد التهجد إذا عقد نية التهجد وقام ليله.                       ",
    "number-en": "How to pray Tahajjud",
    "label-en": "How to perform the Tahajjud prayer: The Muslim makes the intention, then gets out of bed, performs ablution and performs his ablution well, then tightens the apron and prays as many rak’ahs as he wishes. Because Tahajjud is one of the voluntary prayers, and the voluntary prayer is an unlimited prayer, bowing either odd or even, and it was narrated that the Prophet, peace and blessings be upon him, used to perform eleven rak’ahs every night. A person can pray two by two, and there is nothing wrong with someone who begins with two rak’ahs in which he recites aloud so that drowsiness and sleep do not overwhelm him, and he does not make a mistake in reading. It is also desirable for him to wake up his household to perform this prayer because of its great virtue. When bowing during prayer, he should prolong it and praise and praise God Almighty a lot, and likewise when prostrating, he should prolong his prostration; Because he is closer to God Almighty in his humility, glorifies him abundantly, prolongs his supplications and is persistent in doing so, and does not despair because God hears supplications. A Muslim reads the Holy Qur’an and prolongs the reading by reciting one or two parts, or whatever he is able to do, then he gets up to pray again and recites whatever surahs of the Qur’an he can. It is also permissible for him to pray aloud or quietly, and he must be moderate in that. When a Muslim concludes the Tahajjud prayer, he must perform Witr. Witr is the last thing a person concludes his prayer with, as the Messenger, peace and blessings be upon him, said: (Make your last prayer at night Witr) [Sahih]. As for the month of Ramadan, it is recommended to perform Tahajjud after the Tarawih prayer, which the Muslim performs after the Isha prayer, and in Ramadan the nights are blessed, the reward is double, so whoever performs Tahajjud must not perform the Witr after the Isha prayer, but rather perform the Witr prayer. After Tahajjud, if he makes the intention of performing Tahajjud and stays up all night."
  },
  {
    "number": "علامات الساعة الكبرى ",
    "text": "",
    "label": "• ظهور يأجوج ومأجوج.\n• ظهور أعور الدجال. \n• أن تشرق الشمس من جهة الغرب. \n• نزول سيدنا عيسى عليه السلام إلى الأرض.\n• خروج الدابة.  \n• ظهور دخان أسود من السماء يغطّي الأرض. \n• خروج نار من أرض الحجاز تؤدي إلى هروب الناس \nوحشرهم في بلاد الشام. \n• ظهور ثلاثة خسوف في الأرض. \n• فتح القسطنطينية.                      ",
    "number-en": "Great signs of the Hour",
    "label-en": "• The appearance of Gog and Magog.\n• The appearance of the one-eyed Antichrist. \n• That the sun rises in the west. \n• The descent of our Lord Jesus, peace be upon him, to earth.\n• The animal exits.  \n• Black smoke appears from the sky, covering the ground. \n• Fire emerges from the land of Hijaz, causing people to flee \nAnd he gathered them in the Levant. \n• Three eclipses appear on Earth. \n• Conquest of Constantinople."
  },
  {
    "number": "علامات الساعة الصغرى ",
    "text": "",
    "label": "علامات قد وقعت(حدثت):\n\n• موت النبي محمد صلى الله عليه وسلم. \n• موت الصحابة، وعدم وجودهم. \n• كثرة القتل في الأرض. \n• حدوث الموت المفاجئ. \n• كثرة النساء وقلة في عدد الرجال. \n• زينة البيوت ومظاهر العمارة. \n• الناس يرفعون أصواتهم في المساجد. \n• انتشار الفحش وقطع الأرحام. \n• انتشار شهادة الزور، وعدم قول الحق. \n• أن تلد الأمة ربتها، أي أن تصبح الأم كالخادمة لابنتها. \n• يؤمّن الخائن، ويخوّن الأمين. \n• كثرة الزلازل. \n• إنتشار الصواعق. \n• ظهور عدد كبير من الكتب عدا القرآن الكريم. \n• أن يتمنّى الناس الموت. \n• انتشار البخل. \n• طاعة الزوجة، وعقوق الوالدين. \n• تحقّق رؤية المؤمنين. \n• ظهور كنوز الأرض. \n• قلّة في العرب مع كثرة الروم. \n\nعلامات لم تقع بعد:\n\n• أن يتكلم الحجر والشجر دفاعاً عن المسلمين. \n• قتال المسلمين لليهود. \n• عمارة بيت المقدس. \n• هدم الكعبة المشرفة. \n• كلام الجمادات. \n• حدوث معركة كبيرة بين المسلمين والروم. \n• أن تزول الجبال من أماكنها. \n• عزوف الناس عن الحج إلى الكعبة المشرفة. \n• يظهر المهدي. \n• زوال قبيلة قريش. \n• نزول المطر مع عدم إنبات الأرض للنبات. \n• قيام آخر الأمة بلعن أول الأمة.                       ",
    "number-en": "Minor signs of the Hour",
    "label-en": "Signs that have occurred (happened):\n\n• The death of the Prophet Muhammad, may God bless him and grant him peace. \n• The death of the Companions and their non-existence. \n• Frequent killing in the land. \n• Sudden death occurs. \n• Many women and few men. \n• House decorations and architectural features. \n• People raise their voices in mosques. \n• The spread of obscenity and the cutting of wombs. \n• The spread of false testimony and failure to tell the truth. \n• That the female slave gives birth to her mistress, that is, that the mother becomes like a servant to her daughter. \n• He believes the traitor, and betrays the trustworthy. \n• Frequent earthquakes. \n• The spread of lightning. \n• The emergence of a large number of books other than the Holy Qur’an. \n• That people wish for death. \n• The spread of miserliness. \n• Obedience to one’s wife and disobedience to one’s parents. \n• The vision of believers is fulfilled. \n• The appearance of the treasures of the earth. \n• Few Arabs and many Romans. \n\nSigns that have not occurred yet:\n\n• That stones and trees speak in defense of Muslims. \n• Muslims fighting the Jews. \n• Architecture of Jerusalem. \n• Demolishing the Holy Kaaba. \n• Speech of inanimate objects. \n• A major battle occurred between Muslims and Romans. \n• That the mountains move from their places. \n• People’s reluctance to perform Hajj to the Holy Kaaba. \n• The Mahdi appears. \n• The disappearance of the Quraish tribe. \n• Rain falls while the ground does not produce plants. \n• The end of the nation cursing the beginning of the nation."
  }
]