[
  {
    "number": "قصة غراب إبني آدم عليه السلام ",
    "text": "",
    "label": "قال الله تعالى : فَبَعَثَ اللَّهُ غُرَابًا يَبْحَثُ فِي الْأَرْضِ لِيُرِيَهُ كَيْفَ يُوَارِي سَوْءَةَ أَخِيهِ ۚ قَالَ يَا وَيْلَتَا أَعَجَزْتُ أَنْ أَكُونَ مِثْلَ هَٰذَا الْغُرَابِ فَأُوَارِيَ سَوْءَةَ أَخِي ۖ فَأَصْبَحَ مِنَ النَّادِمِينَ .\n\nالحديث على لسان غراب ابني آدم كنت شاهد الإثبات الوحيد فى أول جريمة قتل ترتكب على الأرض شاهدت أول دم انسانى يسفك غدرا وكنت اعرف ان الله سبحانه وتعالى يسمع ويرى ويشهد اعرف ان الشيطان السبب ما اغرب تصرفات الشيطان وما أسهل انقياد أبناء ادم له يحب الله الناس ويعصونه ويكرهون الشيطان ويطيعونه ما اغرب هذا النوع المسمى بالإنسان وما أفدح تناقضاته وما أعظم حلم الله عليه ورحمته به .\n\nكانت الأرض سلاما عظيما قبل هبوط الإنسان فوقها كان بكاء ادم وحواء على الأرض مشهدا مؤثرا للغاية عرفت من صوت الدموع قدر الذنب ومعنى العصيان وصدق التوبة كانت دعوتهما معا لله \" ربنا ظلمنا أنفسنا وإن لم تغفر لنا وترحمنا لنكونن من الخاسرين \" ا وضعت حواء اول بطن لها وكانت تضع فى البطن الواحد ولدا وبنتا وفى البطن الثاني ولدا وبنتا وكان ولد البطن الأول يحل له بنت البطن الثانية ولدت حواء قابيل وأخته إقليما وولدت هابيل وأخته ليوثا كبر الإخوة معا كان احد الأخوين رقيقا كزنابق الحقل ويبدو الثاني قاسيا كشوك الجبال كان قابيل لا يشبه هابيل .\n\nوكانت إقليما شقيقة قابيل لا تشبه ليوثا شقيقة هابيل كان قابيل أقسى من هابيل وكانت ليوثا اقل جمالا من إقليما وكان المفروض أن يتزوج هابيل من إقليما ويتزوج قابيل من ليوثا صرخ قابيل (وقد كان الشيطان يقف وراء كلماته) أنا خيرا من هابيل لن أتزوج ليوثا سأتزوج إقليما كانت معي في بطن واحدة وأنا أولى بها افهمه آدم أن أخته لا تحل له ورفض قابيل أن يتزحزح عن موقفه قال آدم لابنيه : ليقرب كل منكما قربانا الى الله ومن يتقبل الله منه قربانه كان على الحق وتنحى آدم عن الفصل بينهما وترك ذلك للسماء جاء هابيل يحمل اسمن كباشه ووضعه على الجبل وصلى لله تعالى ان يتقبل وجاء قابيل بقمح لم يزل اخضر فى سنابله لم ينضج بعد وقدم قربانه ومضى لم أكن اعرف كيف يتقبل الله تعالى القربان وقف الشقيقان بعيدا هبطت من السماء نار أكلت قربان هابيل إشارة الي القبول وصرخ هابيل وحمد الله وصرخ قابيل وفكر في القتل ويصرخ قابيل لاقتلنك قال هابيل لقابيل ان الله يتقبل من المتقين .\n\nن بسطت الي يدك لتقتلني ما أنا بباسط يدي إليك لاقتلك ....انى اخاف الله رب العالمين ... انى اريد ان تبوء بإثمى وإثمك فتكون من اصحاب النار وذلك جزاء الظالمين \" ا انصرف هابيل مع زوجته إقليما .. تزوجا وعاشا أياما وقد ظهرت عليها إعراض الحمل في نفس الوقت كانت نفس قابيل طوعت له قتل أخيه استلقى هابيل على الأرض بعد عمل يوم شاق واستغرق فى النعاس انحدرت الشمس نحو الغرب وكان قد مات حمار فى الغابة فأكلت السباع لحمه وأكلت النسور ماتبقى منه وشربت الأرض دمه وبقى فكه العظمى ملقى على الأرض حمل قابيل أول سلاح في الأرض وراح يمضى باحثا عن شقيقه ووجده نائما استيقظ هابيل من نومه وفتح عينيه ارتفعت يد قابيل بالفك العظمى وهوت بسرعة انبثق الدم من وجه هابيل وملأ صدر قابيل عادت اليد الآثمة تهوى على الوجه الطيب وفى الضربة الخامسة ارتطمت يد قابيل بطين الحقل سكنت حركة هابيل وأيقن قابيل أن أخاه قد مات جلس واجما أمام ضحيته لا يعرف ماذا يفعل به ولا يعرف كيف يتصرف .\n\nوكان لنا معشر الغربان قوانيننا الخاصة بنا حين يغتصب احد الغربان عش الاخر أو يتعدى على طعامه أو يحاول اغتصاب أنثى غراب آخر فيتم الاقتصاص منه وقد كان بيننا غراب أدناه وحكم عليه بالقتل ونفذ فيه الحكم وقد وكلت بان احمله لدفنه فى مكان بعيد لم أكن أنوى وأنا احمل الغراب القتيل بمنقاري أن اتجه نحو قابيل لكن أمر جليل يعلو على ادراكى ويوجه اجنحتى امرنى به احد الملائكة الكرام ايها الغراب .. أن الله تبارك وتعالى يبعثك لترى ابن ادم كيف يوارى سوأة اخيه هبطت على الفور بحملى امام قابيل ووضعت الغراب الميت امامى ورحت احفر الارض حفرت الارض بمخالبى ومنقارى ساويت اجنحة الغراب الميت الى جواره رفعته بمنقارى فى لحده صرخت صرختين قصيرتين ثم هلت التراب عليه بعدها نظرت لابن ادم وبعدها طرت فى الهواء سمعت وانا اطير مبتعدا فى السماء قول قابيل :\" يا ويلتا اعجزت ان اكون مثل الغراب فأوارى سوأة اخى\" وكانت صرخة تحترق بالندم اكانت صرخى ندم لانه جهل كيف يدفن اخيه؟ اكان نادما لانه قتله بغير حق؟ لا اعرف كل ما اردت ان اعرفه هو حال زوجة هابيل ملانى السلام حين عرفت انها تنتظر الوضع اردت ان اطمئن على الجنس البشرى واتاكد انه ينحدر من صلب رجل كريم يخاف الله اعرف ان ابناء قابيل القاتل سيملاون الارض واعرف ان الصراع لن يتوقف بينهم وبين ابناء الشهيد الطيب وربما تكررت مأساة الاب مع الابناء .",
    "number-en": "The story of the crow of my son Adam, peace be upon him",
    "label-en": "God Almighty said: Then God sent a crow to search the earth to show him how to cover up his brother’s wickedness. He said, “Oh, woe! I am unable to be like this.” The crow concealed my brother’s evil, so he became one of those who regretted it.\n\nTalking on the tongue of Ghurab, my son Adam. I was the only proof witness in the first murder committed on earth. I witnessed the first human blood shed treacherously. I knew that God Almighty hears, sees, and bears witness. I know that Satan is the reason. How strange are Satan’s actions and how easy it is for the children of Adam to submit to him. God loves people and cares. Preserve him and hate Satan and obey him. How strange is this type called man, how gross are his contradictions, and how great is God’s forbearance and mercy toward him.\n\nThe earth was in great peace before man landed on it. Adam and Eve’s crying on the earth was a very touching scene. I knew from the sound of tears the extent of the sin, the meaning of disobedience, and the sincerity of repentance. Their prayer was together to God, “Our Lord, we have wronged ourselves, and if You do not forgive us and have mercy on us, we will certainly be among the losers.” Eve gave birth to her first womb, and in one womb she was giving birth to a boy and a girl, and in the second womb, a boy and a girl, and the boy of the first womb was permissible for him. The daughter of the second womb Eve gave birth to Q. Bel and his sister gave birth to Abel and his sister Leotha. The brothers grew up together. One of the brothers was gentle like the lilies of the field, and the other seemed cruel like the thorns of the mountains. Cain did not resemble Abel.\n\nIqlimah, Cain's sister, was not like Leotha, Abel's sister. Cain was crueler than Abel, and Leotha was less beautiful than Iqlimah. Abel was supposed to marry Iqlimah and Cain should marry Leotha. Cain shouted (and the devil was behind his words): I am better than Abel. I will not marry Leotha. I will marry Iqlimah. She was with me in one womb, and I am more worthy of her. Adam made him understand that his sister was not permissible for him, and Cain refused to do so. He budges from his position Adam said to his two sons: Let each of you offer an offering to God, and whoever God accepts his offering from is on the truth. Adam stepped aside from separating them and left that to heaven. Abel came carrying the fattest of his rams and placed him on the mountain and prayed to God Almighty to accept. Cain came with wheat that was still green on its ears and had not yet matured. He offered his offering and went away. I did not know how God Almighty would accept the offering. The two brothers stood apart. Fire descended from the sky and consumed Abel’s offering as a sign to me. Acceptance, and Abel shouted and thanked God, and Cain shouted and thought about killing, and Cain shouted, “I will kill you.” Abel said to Cain, “God accepts from the pious.” If you stretch out your hand to kill me, I will not extend my hand to you to kill you.... I fear God, Lord of the worlds... I want you to bear my sin and your sin, and you will be among the inmates of the Fire, and that is the recompense of the wrongdoers. Abel went away with his wife in peace... they were married and lived for days, and she showed symptoms of pregnancy at the same time. Cain’s soul volunteered for him to kill his brother. Abel lay down on the ground after a hard day’s work and took a deep breath. In drowsiness, the sun descended towards the west, and a donkey had died in the forest. The lions ate its flesh, the eagles ate what was left of it, the earth drank its blood, and its great jaw remained lying on the ground. Cain carried the first weapon in the world. He went to the ground and went looking for his brother and found him sleeping. Abel woke up from his sleep and opened his eyes. Cain's great hand rose to the jaw and fell quickly. Blood gushed out from Abel's face and filled Cain's chest. The sinful hand returned to fall on the good face. In the fifth blow, Cain's hand hit the mud of the field. Abel's movements were still, and Cain was certain that his brother was dead. He sat helpless in front of his victim, not knowing what to do with him and not knowing how to react. And we, as a group of crows, had our own laws. When one of the crows usurped another’s nest, encroached on his food, or tried to rape the female of another crow, he would be punished. There was a crow among us below that was sentenced to death and the sentence was carried out. I was appointed to carry it to bury it in a far away place. I did not intend, as I was carrying the slain crow in my beak, to head towards Cain, but a solemn matter rose above my understanding and directed my wings. Someone had commanded me to do it. Dear angels, crow.. God, Blessed and Most High, will send you to see the son of Adam how he hides his brother’s body. I immediately landed with my burden in front of Cain and placed the dead crow in front of me and began to dig the ground. I dug the ground with my claws and beak. I leveled the wings of the dead crow next to it. I raised it with my beak in its grave. I screamed two short screams and then dumped dust on it. Then I looked at the son of Adam and then I flew in the air. I heard while flying away in Heaven said Cain: “Oh woe, I was unable to be like a crow and hide my brother’s body.” And it was a cry burning with remorse. Was it my cry of remorse because he did not know how to bury his brother? Was he sorry for killing him unjustly? I do not know. All I wanted to know was the condition of Abel’s wife, Malani Salam. When I knew that she was waiting for the situation, I wanted to reassure the human race and make sure that it descended from the lineage of a generous, God-fearing man. I knew that the sons of Cain the murderer would fill the earth, and I knew that the conflict would not stop between them and the sons of the good martyr, and perhaps the father’s tragedy would be repeated with the sons."
  },
  {
    "number": "قصة ناقة صالح عليه السلام ",
    "text": "",
    "label": "قال الله تعالى : وَإِلَى ثَمُودَ أَخَاهُمْ صَالِحًا قَالَ يَا قَوْمِ اعْبُدُواْ اللّهَ مَا لَكُم مِّنْ إِلَـهٍ غَيْرُهُ قَدْ جَاءتْكُم بَيِّنَةٌ مِّن رَّبِّكُمْ هَـذِهِ نَاقَةُ اللّهِ لَكُمْ آيَةً فَذَرُوهَا تَأْكُلْ فِي أَرْضِ اللّهِ وَلاَ تَمَسُّوهَا بِسُوَءٍ فَيَأْخُذَكُمْ عَذَابٌ أَلِيمٌ.\n\nدعا صالح -عليه السّلام- قومه ثمود إلى عبادة الله، فكذّبوه واستهزؤوا به ودينِه الذي جاء به، وطلبوا منه كُبَراء قوم ثمود أن يُخرِج لهم ناقةً من إحدى الصّخور القريبة من مكان جلوسهم المُعتاد حيثُ كان يدعوهم، وقالوا له: سنؤمن بك إن أنت أخرجت لنا من هذه الصّخرة ناقةً صِفَتُها كذا وكذا.\n\nفلَزِم صالح -عليه السّلام- مُصَلّاه، وأخذ يدعو ربَّه أن يُجيب طلبَهم؛ كي يُثبِت لهم صدق ما جاءهم به، فاستجاب الله لنبيِّه، وأمر تلك الصّخرة التي أشاروا إليها أن تَنفَطِر وتُخرِج ناقةً عظيمةً عَشراءَ، وقد أتت النّاقة كما طلب قوم ثمود من صالح، فلمّا رأوها وتأكّدوا من أنّها وفق الصّفات التي طلبوها، آمنَ بصالح فريقٌ منهم، واستمرّ أكثرهم على الكفر، بل زادوا عُتُوّاً وضلالاً وعِناداً، كان على رأس الذين آمنوا جندع بن عَمرو بن محلاة، وكان من وُجَهاء القوم وساداتهم\n\nبعد ذلك قال صالح -عليه السّلام- لقومه: (إنّ هذه ناقة الله لكم آية على صدق ما جِئتكم به، فَذَروها تأكُل في أرض الله ولا تَمسُّوها بِسُوءٍ)، فاتّفَقَوا معه على أن تبقى النّاقة بينهم، ترعى حيث شاءت، وتأكل من أيّ مكانٍ شاءت، وتَرِدُ الماء يوماً بعد يومٍ، على ألّا يردوا الماء في تلك الأيّام، فلهم أيّامٌ أخرى غير أيّام النّاقة، وكانت تلك النّاقة تشرب ماء البئر جميعَه إذا وردت الماء.\n\nوممّا قيل: أنّ القوم كانوا يشربون من لبنها ما يكفيهم جميعهم، فلمّا طال عليهم هذا الحال استاؤوا منه ولم يُعجِبهم ذلك، فاجتمعوا فيما بينهم، واتّفقوا أن يذبحوها في اللّيل؛ ليستريحوا منها ويبقى لهم ماؤُهم، وكان الذي تولّى قتلها منهم رئيسُهم قدار بن سالف بن جندع، فعاقبهم الله على فعلتِهم.",
    "number-en": "The story of Saleh’s camel, peace be upon him",
    "label-en": "God Almighty said: And to Thamud, their brother Salih, he said, “O my people, worship God. You have no god other than Him. Clear proof has come to you from your Lord. This is a she-camel.” God is a sign for you, so leave it to eat in God’s land, and do not touch it with harm, lest a painful punishment overtake you.\n\nSalih, peace be upon him, called on his people, Thamud, to worship God, but they rejected him and mocked him and the religion that he brought. The leaders of the people of Thamud asked him to bring out for them a she-camel from one of the rocks near their usual sitting place where he used to call them, and they said to him: We will believe in you if you bring out for us from this rock a she-camel with the appearance of such-and-such.\n\nSo Salih - peace be upon him - remained in his place of prayer, and began to pray to his Lord to grant their request. In order to prove to them the truth of what he had brought to them, God responded to His Prophet and commanded that rock that they had pointed to to break open and bring out the great she-camel, Ash’ara. The she-camel came as the people of Thamud had requested from Salih. When they saw her and were sure that she was in accordance with the characteristics they had requested, a group of them believed in Salih, and most of them continued to disbelieve, and even increased in their arrogance. Misguided and stubborn, at the head of those who believed was Junda bin Amr bin Mahalla, and he was one of the notables and rulers of the people.\n\nAfter that, Salih - peace be upon him - said to his people: (This is God’s she-camel to you as a sign of the truth of what I have brought to you, so leave her to eat in God’s land and do not touch her with harm), so they agreed with him that the she-camel would remain among them, graze wherever she wanted, eat from wherever she wanted, and return water day after day, provided that they would not return water on those days. They have other days than the days of the she-camel, and that she-camel would drink all the water from the well when she received water.\n\nFrom what was said: The people were drinking enough of its milk for all of them, but when this situation lasted for a long time, they became upset with it and did not like it, so they gathered among themselves and agreed to slaughter it at night. So that they could rest from it and still have their water, and the one who killed it was their leader, Qadar bin Salif bin Janda, so God punished them for their action."
  },
  {
    "number": "قصة طير إبراهيم عليه السلام ",
    "text": "",
    "label": "قال الله تعالى : وَإِذْ قَالَ إِبْرَاهِيمُ رَبِّ أَرِنِي كَيْفَ تُحْيِي الْمَوْتَى قَالَ أَوَلَمْ تُؤْمِنْ قَالَ بَلَى وَلَكِنْ لِيَطْمَئِنَّ قَلْبِي قَالَ فَخُذْ أَرْبَعَةً مِنَ الطَّيْرِ فَصُرْهُنَّ إِلَيْكَ ثُمَّ اجْعَلْ عَلَى كُلِّ جَبَلٍ مِنْهُنَّ جُزْءًا ثُمَّ ادْعُهُنَّ يَأْتِينَكَ سَعْيًا وَاعْلَمْ أَنَّ اللَّهَ عَزِيزٌ حَكِيمٌ.\n\nقصة جميلة ولطيفة رقيقة في حياة إبراهيم عليه السلام حيث طلب عليه السلام من ربه أن يريه بعين اليقين كيف يمكنه سبحانه إحياء الموتى، لا من شكٍ في قدرة الله تعالى ولكن ليرى بأم عينه بعد أن تملَّك الحق قلبه واحدة من نعماء ربه ومعجزاته.. قال تعالى: {وَإِذْ قَالَ إِبْرَاهِيمُ رَبِّ أَرِنِي كَيْفَ تُحْيِي الْمَوْتَى قَالَ أَوَلَمْ تُؤْمِنْ قَالَ بَلَى وَلَكِنْ لِيَطْمَئِنَّ قَلْبِي قَالَ فَخُذْ أَرْبَعَةً مِنَ الطَّيْرِ فَصُرْهُنَّ إِلَيْكَ ثُمَّ اجْعَلْ عَلَى كُلِّ جَبَلٍ مِنْهُنَّ جُزْءًا ثُمَّ ادْعُهُنَّ يَأْتِينَكَ سَعْيًا وَاعْلَمْ أَنَّ اللَّهَ عَزِيزٌ حَكِيمٌ} [البقرة:260].\n\nفلا علاقة للسؤال بالكفر والإيمان، فقد تخطى إبراهيم عليه السلام هذه المرحلة ودعا الناس إلى عبادة الله تعالى الخالق المدبر، ولكن هذا الطلب من إبراهيم عليه السلام هو كما قال سيد قطب في (الظلال): \"إنه تشوف لا يتعلق بوجود الإيمان وثباته وكماله واستقراره؛ وليس طلباً للبرهان أو تقوية للإيمان.. إنما هو أمر آخر.. له مذاق آخر.. إنه أمر الشوق الروحي، إلى ملابسة السر الإلهي، في أثناء وقوعه العملي\".\n\nقال ابن القيم رحمه الله في (مدارج السالكين): \"إن إبراهيم طلب الانتقال من الإيمان بالعلم بإحياء الله الموتى إلى رؤية تحقيقه عيانًا فطلب بعد حصول العلم الذهني تحقيق الوجود الخارجي فإن ذلك أبلغ في طمأنينة القلب\". ا.هـ. فإبراهيم عليه السلام لم يشك يومًا في وجود ربه تعالى أو قدرته على إحياء الموتى وحاشاه أن يكون كذلك فهو الحليم الأواه المنيب؛ قال صلى الله عليه وسلم: «نحن أحق بالشك من إبراهيم إذ قال: {رب أرني كيف تحيي الموتى قال أولم تؤمن قال بلى ولكن ليطمئن قلبي}» (رواه البخاري ومسلم من حديث أبي هريرة رضي الله عنه).\n\nوالمعنى كما قال القرطبي رحمه الله في تفسيره: \"لو كان شاكًا لكنا نحن أحق به، ونحن لا نشك، فإبراهيم عليه السلام أحرى ألا يشك، فالحديث مبني على نفي الشك عن إبراهيم عليه السلام\". ا.هـ. ولو كان في هذا خطأ لعاتبه الله تعالى كما عاتب آدم عليه السلام حين أكل من الشجرة، ولكن الله سبحانه أراد أن يُطمئن قلب خليله فأمره أن يحضر أربعة أنواع من الطيور وقد اختلف المفسرون في أنواع هذه الطيور ولا فائدة من تعيينها.. وأمره سبحانه أن يقطع هذه الطيور إربًا إربًا ثم يخلطها مع بعضها ويقسمها ويجعل على كل جبل جزء منها. ثم بعد ذلك ينادي على كل طير باسمه يأتيه من فوره.. وتركب الخلق أمام إبراهيم عليه السلام ليرى بأم عينه هذه المعجزة الإلهية.. ويترقى من علم اليقين إلى عين اليقين.\n\nوللعلم فهناك ثلاث مراتب هي: علم اليقين، وعين اليقين، وحق اليقين. فعلم اليقين يكون بالسمع، وعين اليقين يكون بالبصر، وحق اليقين يكون بالحواس أو بالقلب. قال ابن القيم رحمه الله في كتابه (التبيان في أقسام القرآن): \"المرتبة الثانية: عين اليقين... هي التي سألها إبراهيم الخليل ربه أن يريه كيف يحيي الموت ليحصل له مع علم اليقين عين اليقين. فكان سؤاله زيادة لنفسه وطمأنينة لقلبه، فيسكن القلب عند المعاينة، ويطمئن لقطع المسافة التي بين الحبر والعيان. وعلى هذه المسافة أطلق النبي صلى الله عليه وسلم لفظ الشك حيث قال: «نحن أحق بالشك من إبراهيم» ومعاذ الله أن يكون هناك شك ولا من إبراهيم وإنما هو عين بعد علم، وشهود بعد خبر، ومعاينة بعد سماع\". ويستمر رحمه الله في تفسير هذه المرتبة ثم يقول: \"وقد ضرب بعض العلماء للمراتب الثلاثة مثلا فقال: إذ قال لك من تجزم بصدقه: عندي عسل أريد أن أطعمك منه فصدقته كان ذلك علم يقين، فإذا أحضره بين يديك صار ذلك عين اليقين، فإذا ذقته صار ذلك حق اليقين\".\n\nوبهذه المعجزة الإلهية ترقى إبراهيم عليه السلام من علم اليقين إلى عين اليقين كما ذكرنا واطمأن قلبه ورضي بالله ربه وكان أمة قانتًا لله حنيفًا، أبو الأنبياء وإمام المسلمين.وبهذا تنتهي قصة إبراهيم عليه السلام كما ذكرت في القرآن الكريم وسنة النبي صلى الله عليه وسلم.. وسيتبع إن شاء الله تعالى بجملة من فضائل إبراهيم عليه السلام وبعض الدروس المستفادة من حياته الكريمة عليه وعلى نبينا أفضل الصلاة والسلام.",
    "number-en": "The story of Abraham’s bird, peace be upon him",
    "label-en": "God Almighty said: And when Abraham said, “My Lord, show me how You give life to the dead.” He said, “Do you not believe?” He said, “Yes, but to reassure my heart.” He said, “Take four of the birds.” So distribute them to you, then place a portion of them on every mountain, then call upon them to come to you in haste, and know that God is Mighty, All-Wise. A beautiful, gentle, and tender story in the life of Abraham, peace be upon him, where he, peace be upon him, asked his Lord to show him with certainty how He, Glory be to Him, can revive the dead, not out of doubt in the power of God Almighty, but so that he could see with his own eyes after the truth took possession of his heart, one of the blessings and miracles of his Lord.. God Almighty said: {And when Abraham said, “My Lord, show me how You can bring the dead to life.” He said, “Do you not believe?” He said, “Yes, but to reassure my heart.” He said, “Take four of the birds and divide them to yourself, then place a portion of them on each mountain.” Then invite him We will come to you in strife, and know that God is Mighty, All-Wise} [Al-Baqarah: 260].\n\nThe question has nothing to do with disbelief and faith. Abraham, peace be upon him, passed this stage and called on people to worship God Almighty, the Creator and Ruler. However, this request from Abraham, peace be upon him, is as Sayyid Qutb said in (The Shadows): “It is an observation that is not related to the existence of faith, its steadfastness, its perfection, and its stability. It is a matter of spiritual longing, for the context of the divine mystery, during its practical occurrence.”\n\nIbn al-Qayyim, may God have mercy on him, said in “Madarij al-Salikeen”: “Ibrahim sought to move from believing in knowledge of God’s resurrection of the dead to seeing its fulfillment with the eyes. So, after obtaining mental knowledge, he sought the realization of external existence, for that is more effective in reassuring the heart.” A.H. Abraham, peace be upon him, never doubted the existence of his Lord Almighty or his ability to revive the dead, and far be it from him to be like that, for he is forbearing, compassionate, and repentant. He, may God’s prayers and peace be upon him, said: “We have more right to doubt than Abraham when he said: ‘My Lord, show me how you can give life to the dead.’ He said, ‘Have you not believed?’ He said, ‘Yes, but to reassure my heart.’” (Narrated by Al-Bukhari and Muslim from the hadith of Abu Hurairah, may God be pleased with him).\n\nThe meaning is as Al-Qurtubi, may God have mercy on him, said in his interpretation: “If he had doubted, we would have more right to him, and we do not doubt, so Abraham, peace be upon him, would rather not have doubted. The hadith is based on denying doubt about Abraham, peace be upon him.” A.H. If there had been a mistake in this, God Almighty would have blamed him just as He blamed Adam, peace be upon him, when he ate from the tree. But God Almighty wanted to reassure the heart of his friend, so he commanded him to bring four types of birds. Commentators have differed as to the types of these birds, and there is no benefit in specifying them. And God Almighty commanded him to cut these birds into pieces, then mix them together, divide them, and place a portion of them on each mountain. Then after that, he calls every bird by name that comes to it immediately... and creation mounts before Abraham, peace be upon him, so that he can see with his own eyes this divine miracle... It rises from the knowledge of certainty to the eye of certainty.\n\nFor your information, there are three levels: the knowledge of certainty, the eye of certainty, and the truth of certainty. The knowledge of certainty is through hearing, the eye of certainty is through sight, and the truth of certainty is through the senses or the heart. Ibn al-Qayyim, may God have mercy on him, said in his book (Al-Taybān fi Uqsām al-Qur’ān): “The second level: the eye of certainty... is the one that Ibrahim Al-Khalil asked his Lord to show him how to revive death so that with certain knowledge he would obtain the eye of certainty. His asking was an increase for himself and reassurance for his heart, so that the heart would calm down upon seeing it, and would be reassured that the distance between the ink and the eye had been crossed. At this distance, the Prophet, may God’s prayers and peace be upon him, used the term doubt, saying: “We are more deserving of doubt than Abraham.” And God forbid that there be doubt, not from Abraham. Rather, it is an eye after knowledge, witnesses after news, and inspection after hearing. He, may God have mercy on him, continues to explain this level and then says: “Some of the scholars gave the three levels an example and said: When someone whose truthfulness you are certain of says to you: I have honey that I want to feed you from, and you believe him, that is certain knowledge, and if he brings it to your hands, that becomes certain certainty. If you taste it, it becomes true certainty.” With this divine miracle, Abraham, peace be upon him, rose from certain knowledge to certainty, as we mentioned, and his heart was reassured and satisfied with God, his Lord. He was a God-fearing and upright nation, the father of the prophets and the imam of the Muslims. And with this, the story of Abraham, peace be upon him, ends, as mentioned in the Holy Qur’an and the Sunnah of the Prophet, may God’s prayers and peace be upon him. It will be followed, God Almighty willing, by a number of the virtues of Abraham, peace be upon him, and some lessons learned from his honorable life upon him and upon our Prophet, may the best prayers and peace be upon him."
  },
  {
    "number": "قصة ذئب يوسف عليه السلام ",
    "text": "",
    "label": "\nقال الله تعالى : قَالُوا يَا أَبَانَا مَا لَكَ لَا تَأْمَنَّا عَلَى يُوسُفَ وَإِنَّا لَهُ لَنَاصِحُونَ (١١) أَرْسِلْهُ مَعَنَا غَدًا يَرْتَعْ وَيَلْعَبْ وَإِنَّا لَهُ لَحَافِظُونَ (١٢) قَالَ إِنِّي لَيَحْزُنُنِي أَنْ تَذْهَبُوا بِهِ وَأَخَافُ أَنْ يَأْكُلَهُ الذِّئْبُ وَأَنْتُمْ عَنْهُ غَافِلُونَ (١٣) قَالُوا لَئِنْ أَكَلَهُ الذِّئْبُ وَنَحْنُ عُصْبَةٌ إِنَّا إِذًا لَخَاسِرُونَ (١٤) فَلَمَّا ذَهَبُوا بِهِ وَأَجْمَعُوا أَنْ يَجْعَلُوهُ فِي غَيَابَةِ الْجُبِّ وَأَوْحَيْنَا إِلَيْهِ لَتُنَبِّئَنَّهُمْ بِأَمْرِهِمْ هَذَا وَهُمْ لَا يَشْعُرُونَ (١٥) وَجَاءُوا أَبَاهُمْ عِشَاءً يَبْكُونَ (١٦) قَالُوا يَا أَبَانَا إِنَّا ذَهَبْنَا نَسْتَبِقُ وَتَرَكْنَا يُوسُفَ عِنْدَ مَتَاعِنَا فَأَكَلَهُ الذِّئْبُ وَمَا أَنْتَ بِمُؤْمِنٍ لَنَا وَلَوْ كُنَّا صَادِقِينَ (١٧) وَجَاءُوا عَلَى قَمِيصِهِ بِدَمٍ كَذِبٍ قَالَ بَلْ سَوَّلَتْ لَكُمْ أَنْفُسُكُمْ أَمْرًا فَصَبْرٌ جَمِيلٌ وَاللَّهُ الْمُسْتَعَانُ عَلَى مَا تَصِفُونَ (١٨)\n\nأنا ذئب يوسف بن يعقوب .... أو الذئب المتهم ظلماً بأكل نبى الله يوسف عليه السلام ... ولكن صدقونى ، فهذا الاتهام الباطل لا أساس له من الصحة ، ويكفينى شرفاً أن براءتى من أكل بن يعقوب قد نزلت فى قرآن كريم يتلى على الناس ليل نهار .. وهل هناك شرف أفضل من هذا ؟!...\n\nولكن ما هى قصتى ، ولماذا اتهمنى إخوة يوسف ظلماً بأنى أكلت أخاهم ... دعونى احك لكم القصة من البداية للنهاية .... كان نبى الله يعقوب عليه السلام متزوجاً من زوجة أولى أنجبت له عشرة من الأبناء .. ثم تزوج من زوجة ثانية أنجبت له اثنين من الأبناء ، هما يوسف وأخوه ... فكانا أصغر الأبناء...\n\nوكان أبناء يعقوب العشرة لا يحبون يوسف وأخاه ، بسبب قربهما من أبيهما ... وبسبب حب يعقوب ليوسف وأخيه ، قرر إخوة يوسف العشرة أن يتخلصوا من يوسف حتى يستحوذوا على حب أبيهم لهم وحدهم .. اجتمع إخوة يوسف العشرة ، وأخذوا يتناقشون ويخططون للتخلص من يوسف . قال أحدهم : اقتلوا يوسف ، حتى نستأثر بحب أبينا لنا ... وقال آخر : نلقه فى أرض بعيدة ونتركه للذئاب والوحوش تأكله ... واعترض ثالث قائلاً : لا تقتلوا يوسف ، ولكن ألقوه فى بئر او جب ، فقد يسمع صراخه بعض القوافل التجارية او المارة بجوار البئر، فيأخذونة ويبيعونه بعيداً ، وبذلك نتخلص منه إلى الأبد ...\n\nوسأل أحدهم : ولكن ماذا نقول لأبينا إذا سألنا عن يوسف ؟ فأجابه آخر : نقول له إن يوسف قد تاه منا . وقال آخر : نقول له إن الذئب قد أكله ... وهكذا دبر إخوة يوسف أمر التخلص منه . وفى اليوم التالى ، وهم فى طريقهم للخروج إلى المرعى لرعى إبلهم ومواشيهم توجهوا إلى أبيهم وكان يوسف يلعب قريباً منه ، وقالوا له : نريد منك أن تسمح لنا بأخذ يوسف معنا إلى المرعى ، ليلعب هناك ويمرح ...\n\nنظر يعقوب إلى أبنائه ، وقال لهم : إنى أخاف أن يأكله الذئب وأنتم غافلون عنه برعى المواشى .... فرد أحدهم بقوله : لا تخف عليه .... سنحرسه طوال الوقت ، ولن يغيب عن أعيننا لحظة واحدة . وقال آخر : كيف نغفل عنه ونتركه ليأكله الذئب ، ونحن كثيرون ؟ لن يحدث هذا يا أبى ... وهكذا ظلوا يقنعون أباهم ، حتى سمح لهم بإصطحاب يوسف معهم وهناك فى المرعى البعيد فى جوف الصحراء ، بدأ إخوة يوسف تنفيذ خطتهم ... عصبوا عينى يوسف ... ثم نزعوا عنه قميصه ... ثم ألقوا به فى البئر ... وهكذا تخلصوا منه ...ثم ذبحوا أحد الخراف ، ولطخوا قميص يوسف بدم الخروف ، ثم حملوه وعادوا إلى أبيهم فى المساء يتصنعون البكاء ...\n\nوعندما رآهم يعقوب سألهم : أين أخوكم يوسف...؟ فقال إخوة يوسف وهم يمثلون البكاء : لقد غافلنا الذئب وأكله ... وهكذا اطفال اتهمنى إخوة يوسف كذباً وظلماً ، وأنا لم آكل يوسف ، ولم أمسسه بسوء ... نظر يعقوب إلى قميص يوسف ، وعرف أن أبناءه يكذبون عليه ... إذ كيف يأكل الذئب يوسف ولا يمزق قميصه ؟!... هكذا لاحظ الأب بحكمته وبصيرته... وهكذا برأنى الأب من دم ابنه ... ونظر الأب إلى أبنائه بحزن قائلاً لهم : \" بَلْ سَوَّلَتْ لَكُمْ أَنْفُسُكُمْ أَمْرًا فَصَبْرٌ جَمِيلٌ وَاللَّهُ الْمُسْتَعَانُ عَلَى مَا تَصِفُونَ \" أما يوسف فقد عثرت عليه قافلة تجارية كانت فى طريقها إلى مصر ، فأخرجه أحدهم من قلب البئر بعد أن سمع صراخه ، ثم أخذه معه ، وباعه هناك لحاكم مصر .... فعاش وصار بعد ذلك نبياً ....",
    "number-en": "The story of the wolf of Joseph, peace be upon him",
    "label-en": "God Almighty said: They said, “O our father, what is the matter with you that you do not trust Joseph, and indeed, we are his sincere advisers.” (11) Send him with us tomorrow, so that he may graze and play, and indeed, we will be his guardians. (12) He said, “I am saddened that you should take him away, and I fear that the wolf will eat him while you are heedless of it.” (13) They said, “If the wolf eats him.” And we are a group. Indeed, then we are losers. (14) Then when they took him away and agreed to place him in the absence of the pit, and We revealed to him that you might prophesy. They are in this matter of theirs and they do not realize it. (15) And they came to their father at dinner, crying. (16) They said, “O our father, we went to race ahead, and he left us.” Joseph was with Our goods, and the wolf ate him. And you would not have believed us, even if we had been truthful. (17) And they brought false blood on his shirt. He said, “Rather, I have made it possible for you.” (18)\n\nI am the wolf of Yusuf bin Yaqoub.... Or the wolf who was unjustly accused of eating the Prophet of God, Joseph, peace be upon him... But believe me, this false accusation has no basis in truth, and it is enough of an honor for me that my innocence of eating the son of Yaqoub was revealed in the Noble Qur’an that is recited to people day and night... Is there an honor better than this?!...\n\nBut what is my story, and why did Joseph’s brothers unjustly accuse me of eating their brother... Let me tell you the story from beginning to end... The Prophet of God, Jacob, peace be upon him, was married to a first wife who bore him ten children... Then he married a second wife who bore him two sons, namely Joseph and his brother... They were the youngest children...\n\nJacob's ten sons did not love Joseph and his brother, because of their closeness to their father... And because of Jacob's love for Joseph and his brother, Joseph's ten brothers decided to get rid of Joseph so that they could take over their father's love for them alone... Joseph's ten brothers gathered, and they began discussing and planning to get rid of Joseph. One of them said: Kill Joseph, so that we can take advantage of our father’s love for us... And another said: We will throw him in a far away land and leave him to the wolves and the beasts to eat him... A third objected, saying: Do not kill Joseph, but throw him into a well or a pit, as some merchant caravans or those passing by the well might hear his screams, so they would take him and sell him away, and thus we would get rid of him forever...\n\nSomeone asked: But what do we say to our father if he asks us about Joseph? Another replied: We tell him that Joseph has wandered from us. Another said: We tell him that the wolf ate him... and this is how Joseph’s brothers arranged to get rid of him. The next day, on their way out to the pasture to graze their camels and livestock, they went to their father, and Joseph was playing close to him, and they said to him: We want you to allow us to take Joseph with us to the pasture, so that he can play there and have fun...\n\nJacob looked at his sons and said to them: I fear that the wolf will eat him while you are neglecting him by grazing livestock.... One of them responded by saying: Do not fear for him.... We will guard him all the time, and he will not leave our eyes for a single moment. Another said: How can we ignore it and leave it to be eaten by the wolf, when we are so many? This won't happen, Dad. And so they continued to convince their father, until he allowed them to take Joseph with them. There, in the distant pasture in the middle of the desert, Joseph’s brothers began implementing their plan... They blindfolded Joseph... then they took off his shirt... then they threw him into the well... and that was how they got rid of him... then they slaughtered one of the sheep, and stained Joseph’s shirt with the sheep’s blood, then they carried him and returned to their father in the evening, pretending to cry...\n\nWhen Jacob saw them, he asked them: Where is your brother Joseph...? Joseph's brothers said while pretending to cry: The wolf neglected us and ate him... Thus, the children of Joseph’s brothers accused me of lying and injustice, and I did not eat Joseph, nor did I touch him with any harm... Jacob looked at Joseph’s shirt, and knew that his sons were lying to him... How could the wolf eat Joseph and not tear his shirt?!... This is what the father observed with his wisdom and insight... And so the father acquitted me of his son’s blood... And the father looked at his sons with sadness, saying to them: “Rather, I made it easy for you. Yourselves are a matter of concern, so great patience, and God is the one who seeks help in what you describe.” As for Joseph, a commercial caravan that was on its way to Egypt found him. Someone took him out of the well after hearing his screams, then took him with him and sold him there to the ruler of Egypt... so he lived and became a prophet after that..."
  },
  {
    "number": "قصة حوت يونس عليه السلام ",
    "text": "",
    "label": "قال تعالى :((وإن يونس لمن المرسلين () إذ أبق إلى الفلك المشحون() فساهم فكان من المدحضين () فالتقمه الحوت وهو مليم () فلولا انه كان من المسبحين () للبث فى بطنه إلى يوم يبعثون () فنبذنه بالعراء وهو سقي () وانبتنا عليه شجرة من يقطين ()وأرسلنه إلى مائة ألف أو يزيدون() فامنوا فمتعنهم الى حين ))\n\nفتعالو بنا لنتعايش بقلوبنا وارواحنا مع قصة حوت نبى الله يونس علية السلام. ففى بلاد العراق القديمه كانت هناك قريه اسمها ((نينوى))... وهى قريه تكثر فيها النعم والخيرات من الزروع والثيمار والدواب والخضره والماء المتدفق من الانهار ... ولكن اهل القريه لم يشكروا الله طرفة عين .. بل كفروا بالله وعبدوا الاصنام والكواكب والنجوم من دون الحى القوم (جل وعلا ) ... وظلوا على ذلك الحال زمن طويلا . فارسل الله عز وجل نبيهم يونس علية السلام إلى الصراط المستقيم ,ويحذرهم من عذاب يوم عظيم , ليبتعدوا عما هم فيه من ضلالة وكفر , ويمتنعوا عن ارتكاب المحرمات . ولم يكن ((يونس)) علية السلام من أهل ((نينوى)) , فكان غريبا عن القوم , ليس له فيهم , وليس له بينهم قرابة .\n\nفأقام عندهم يدعوهم إلى الهدى, ويرشدهم الى الخير , ويبصرهم بالفضائل ومكارم الأخلاق . فلم يستجيبوا له , ولم يسمعوا نصائحه, وزادوا فى انحرافهم عن الطريق المستقيم , وأمنوا فى ابتعادهم عن النهج القويم , وأغرقوا فى لذائذهم وشهواتهم . وكان يونس علية السلام شابا طرى العود متوقد الحيوية والنشاط , فثارت ثائرتة لإعراض الناس من أهل (نينوى) عن دعوته . فأوحى الله إليهى أن أنذرتهم من نزول العذاب بهم إن لم يؤمنوا بالله (جل وعلا) ... فذهب إليهم يونس علية السلام وحذرهم من عذاب النار وعقابه ووعدهم أن العذاب سينزل بهم بسبب كفرهم وعنادهم . ومع ذلك لم يستجيبوا له .. بل سخروا منه ومن كلامه ...فحزن يونس حزنا شديدا ...وظل يدعوهم إلى الله إلى أن يئس منهم فخرج من تلك القرية ووعدهم بنزول العذاب بهم بعد ثلاثة أيام . توبة قوم يونس علية السلام لم ينتظر يونس علية السلام أن يأتيه الأمر من الله عز وجل بالخروج من هذة القرية الظالم أهلها .. بل تعجل الخروج وهو فى حالة شديدة من الحزن والغضب . ومر اليوم الأول على الموعد الذى حدد يونس لنزول العذاب بهم . ومر اليوم الثانى دون أن يحدث شىء . فلما جاء اليوم الثالث رأوا علامات نزول العذاب قد حاق بهم .\n\nفلما تحققوا من نزول العذاب بهم , قذف الله فى قلوبهم التوبة والإنابة , وندموا على ما كان بهم إلى نبيهم ,فلبسوا المسوح ,وفرقوا بين كل بهيمة وولدها , ثم عجوا غلى الله عز وجل , وصرخوا, وتضرعوا إليه , وتمسكنوا لديه , وبكى الرجال والنساء والبنون والبنات والامهات , وجارت الانعام والدواب والمواشى , ورغت الإبل وفصلانها, وخارت البقر وأولادها , وثغت الغنم وحملانها , وكانت ساعة عظيمة , فكشف الله بحوله وقوته ورأفته ورحمته عنهم العذاب الذى كان قد اتصل بهم بسبب توبتهم ولهذا قال تعالى : ((فلولا كانت قرية ءامنت فنفعها إيمنها إلا قوم يونس لما ءامنوا كشفنا عنهم عذاب الخزى فى الحيوة الدنيا ومتعنهم إلى حين)). فقد اخبرنا ربنا أن قوم يونس نفعهم إيمانهم بعد نزول العذاب بهم , ورفعة الله عنهم بعد احاطهم بهم . ومضت الايام الثلاثه التي وعد بها يونس ,فجاء ينظر موعود الله فيهم ,ولعله كان معتزلا لهم ,لم يدر بما فعلوه من التوبه والانابه .....فوجدهم لما اطل عليهم سالمين ,فأغضبه ذالك ,وكان جزاء القاتل عندهم ان يقتل ,فخرج هاربا من قومه ,خشيه القتل .\n\nوكان الواجب علي يونس ان يرضي بقضاء الله (تبارك وتعالي) ,ويسلم لامره فليس للعبد أن يغضبه فعل ربه ,وما كان ليونس ان يخرج من غير أذن منه ,ولذلك نهي الله رسولنا .ان يكون كصاحب الحوت ..وصاحب الحوت هوه يونس لالتقام الحوت له ...قال تعالي ((فاصبر لحكم ربك ولا تكن كصاحب الحوت)) فلما تاب قوم يونس ورفع الله عنهم العذاب اخذوا يبحثون عن يونس (عليه السلام )فلم يجدوه فدعوا الله أن يرد اليهم هذا النبي الكريم الذي ترك بلادهم ياسا من ايمانهم بعد ان عاندوه وسخروا منه . يونس (عليه السلام ) في بطن الحوت كان يونس في تلك الحظه قد ابتعد عن تلك القريه حتي وصل الي شاطئ البحر فوجد سفينه تستعد للرحيل فطلب منهم أن ياخذوه معه فوافقوا بل وكانوا في قمه السعاده ان يكون هذا النبي الكريم علي ظهر تلك السفينه . فلما اقلعت السفينه اخذ يونس عليه السلام يصلي ويذكر الله (عز وجل )فاحبه الناس حبا شديدا واستبشروا بوجود هذا النبي الصالح معهم ....فلم يطلبوا منه ان يعمل اي شيئ...بل كانوا يخدمونه ويحرصون علي راحته . وحين اظلم الليل ذهب يونس الي ركن من اركان السفينه .واغمض عينيه وراح في سبات عميق .وذلك بسبب ما لقيه في ذلك اليوم من تعب المشي وجهد المسير . وما هي الا ساعات قلائل حتي هب (عليه السلام ) من نومه مذعورا علي صوت صراخ الناس في السفينه ...فقد بدات الامواج تعلوا وتضرب بعضها بعضا وكادت السفينه ان تغرق ....فما كان من ربان السفينه الي ان اصدر اوامره بتخفيف احمال السفينه حتي لا تغرق .\n\nفاخذ الركاب يلقون بعض امتعتهم عسي ان يكون ذلك سبب في نجاتهم ...ولكن مع ذلك مازالت السفينه تضطرب وتكاد ان تغرق بهم جميعا . وهنا اصدر ربان السفينه اوامره بانه لابد من القاء احد الركاب في البحر والا فسوف تغرق السفينه . وهنا رفض كل راكب ان يلقي بنفسه في البحر في هذا الظلام الدامس .....لان من يلقي بنفسه في هذا الوقت في البحر ان لم تاكله الاسماك والحيتان فسوف يموت من الخوف والرعب . فاشار عليهم الربان بان يقترعوا فمن وقعت عليه القرعه القي بفسه في الماء بدلا من ان يغرقوا جميعا . فلما اقترعوا وقعت القرعه علي نبي الله يونس ليلقوه في البحر لكنهم رفضوا ان يلقوه واعادوا القرعه للمره الثانيه فوقعت علي نبي الله يونس فقالوا :مستحيل ان نلقي هذا النبي الكرين في البحر ...فاعدوا القرعه للمره الثالثه فوقعت علي نبي الله يونس ....فما كان منه الا ان القي بنفسه في البحر وقد تاكد الكل من موته وهلاكه . انطلقت السفينه في طريقها ...واما يونس (عليه السلام ) فقد بعث الله اليه حوتا عظيما من البحر الاخضر فالتقمه وابتلعه . فامر الله الحوت الا ياكل له لحما ولا يهشم له عظما فانه ليس رزقا له ...فطاف الحوت به البحار كلها . حقا انها معجزه فريده لما استقر يونس (عليه السلام)في بطن الحوت ,اجرى الله له معجزه اخري حيث امر الجهاز الهضمي للحوت الا يهضم يونس ,وان لايفرز العصارات الهاضمه عليه .. فهذا الوفاد الي المعده ليس وجبه غذائيه ,وهو لا يصلح للهضم .وما هو الا مقيم في المعده اقامه يسيره ليغادرها بعد ذلك ....وهذه المعده اشبه ماتكون بقارب انقاذ لانقاذه ,ولا يجوز لها ان تهضمه . وتلقت معده الحوت امر الله راضيه ,ونفذته ,فلم تفرز علي يونس عصارتها الهاضمه ,وبقي يونس حيا فيها . ولا يستغربن احد هذا الامر ,فلو كان الامر امرنا نحن البشر لكان مستحيلا ,فلا احد من البشر يسطتيع ان يتحكم في الحوت ,ولا ان يامره بعدم مضغ فريسته في فمه ,وعدم هضمها في معدته ,ولو امره احدنا بذلك ,فلن يستجيب له ,لانه لن يفهم عليه ,ولن يخضع له .\n\nثم إنه لا يمكن لاحد ان يبقي حيا في معده حيوان او حوت بالحساب البشري ,لانه لو لم يمضغه الحوت ولم يهضمه فلن يبقي في بطنه حيا ,لانه سيموت بانقطاع الاوكسجين عنه . هذا بالمنطق البشري والحساب البشري . اما بالنسبه لاراده الله وقدرته فالامر هين مفهوم .....ان الله فعال لما يريد ,وهو علي كل شئ قدير .....ان الله هوه الذي امر الحوت ان يتوجه نحو السفينه ففعل ,وامره ان يفتح فمه استقبالا ليونس ففعل ,وامر فمه ان لا يمضغ يونس ففعل ,وامر معدته الا تهضم يونس ففعلت . والله هو الذي قدر ليونس ان يعيش حيا في بطن الحوت . ان الامر كله معجزات وخوارق ,يعجز عنها البشر ,لكنها مفهومه لانها من فعل الله . -يونس عليه السلام يسجد لله عز وجل في بطن الحوت – ولما استقر في جوف الحوت حسب انه مات ,فحرك جوارحه فتحركت ,فاذا هو حي فخر لله ساجدا وقال :يارب .... اتخذت لك مسجدا في موضع لم يعبدك احد في مثله . لقد فوجئ يونس عليه السلام أنه في ظلمات ثلاث :ظلمه الليل وظلمه قاع البحر وظلمه بطن الحوت ...وهنا احس بذنبه وشعر انه اخطا عندما خرج من القريه بغير امر من الله (عز وجل) فاخذ يصلي ويسبح ويستغفر الله (جلا وعلا)في بطن الحوت . -يونس عليه السلام يلجا الي الله عز وجل لينجيه – وتفقد يونس عليه السلام نفسه ,فوجد نفسه في بطن الحوت والحوت يغوص تحت الماء ,وهوه حوت من الاف الحيتان التي تسبح في اعماق البحار .\n\nفماذا يفعل يونس عليه السلام ؟ هل يمكن ان يستنجد باحد من البشر وكيف يفعل ؟ ولو رفع صوته وصرخ مستغيثا فهل يسمع بشر صوته ؟.....ولو ان قوه من البشر تريد ان تغيثه وتنجده ,فهل تعرف الحوت الذي يحويه ؟ وهل يمكن تمييزه من بين الاف الحيتان المشابهة. المخلوقون جميعا يعجزون عن اغاثه ونجده يونس عليه السلام لو ارادوا .....واذا وصلوا اليه بعد حين ,فسيعجزون عن انقاذه حيا !! ان يونس عليه السلام نبي كريم ,يدرك هذه الحقيقه ,ويوقن انه لن ينقذه الا الله , ولن يفرج كربه الا الله ,ولذلك اقبل علي الله ,فذكره وسبحه وناداه واستغاث به وتضرع اليه . وقد سجلت ايات القران هذا اللجوء الايماني الي الله ,وجعلته معلما هاديا واسوه حسنه ,للمؤمنين بعد يونس عليه السلام , يقتدون به عندما يمرون بضيق او محنه او غم او كرب . قال تعالي : ((فلولا انه كان من المسبحين للبث في بطنه الي يوم يبعثون )). اي :لولا ان يونس كان مسبحا لله ,لبقي في بطن الحوت الي يوم القيامه .... اي :سيامر الله معده الحوت ان تفرز علي يونس عصارتها الهاضمه , وان تحوله الي وجبه غذائيه . ان تسبيحه لله سبب ,قدر ان ينجيه لاجله ,ولو لم يتحقق هذا السبب لما كتب ليونس النجاه . تسبيح يونس السابق سبب نجاته برحمه من لله متي كان يونس مسبحا لله ؟ هل في بطن الحوت فقط ؟ ام كان مسبحا قبل ذلك ؟ ان التسبيح كان صفه دائمه ,ملازمه ليونس عليه السلام .وهذا معناه انه كان مسبحا لله عندما كان وسط قومه ,يدعوهم الي الله , وكان مسبحا لله لما استقر في بطن الحوت . لقد كان له رصيد كبير من ذكر الله وتسبيحه ,وهذا الرصيد سبب نافع إيجابي ,قدر الله ان يرحم به يونس , وان ينقذه من هذه المحنه . عرف الله في الرخاء ,فعرفه الله في الشدة , وذكر الله في الرخاء ,فنفعه هذا عند الشدة ,وفرجها الله عنه بسبب ذلك . ويقتدي المؤمن الصالح بيونس عليه السلام في هذا الجانب ,فيحرص علي الاكثار من ذكر الله وعبادته في حاله الرخاء , ليكون له رصيد كبير عند الله ,وليرحمه الله عند الشده والمحنه . وبعدما سبح يونس عليه السلام ربه وهو في بطن الحوت , تضرع إليه ودعاه وإستغاث به وقال : لا إله إلا انت سبحانك إني كنت من الظالمين . كان من الممكن ان يظل في بطن الحوت الي يوم القيامه ولكن شيئا واحدا كان السبب في نجاته من هذا العذاب الاليم ...هذا الشيئ هوه التسبيح والذكر والدعاء نطق يونس عليه السلام في دعائه بالكلمه الطيبه ((لا اله الا انت )) واعل توحيد الالهيه واكد عليه . انه في غم وضيق , وانه بعيد عن جميع المؤيدين والناصرين من المخلوقين ,وانه يوقن ان ايه قوه بشريه عاجزه عن الوصول له , وانه لا يمكن ان يقدم له مخلوق مساعده او نفعا . انه يعيش حقيقه انه لا اله الا الله ,ويستشعر حاله انه لا اله الا الله , ويدرك فعلا انه لا نافع ولا ناصر ولا مؤيد الا الله . ولهذا نطق بها بلسانه , وهوه يستحضرها في قلبه ويعيشها بكيانه . ونستفيد نحن من هذا الدعاء النبوي الكريم ان نبدا دعاءنا وتضر عنا بالثنا على الله, وإعلان أنه لا إله إلا الله ,ثم نقوم بتقديم طلباتنا وحاجاتنا بعد ذلك . وبعدما أثنى يونس على الله , اعترف بتقصير قائلا :((إنى كنت من الظلمين )) .\n\nأدرك يونس وهو فى بطن الحوت الذاهب فى عرض البحر , أنه تسرع بالخروج من قومه , قبل توجيه الله له , وأن الله عتب عليه ولامه من أجل ذلك , وقدر أن يوقع به هذا البلاء , ويمتحنة . ولما أدرك ذلك انطلق لسانه بالاعتراف بأنة كان ظالما فى فعله وتصرفه وخروجه , وطلب من الله أن يتجاوز عن ظلمه , فيسامحه ويفرج كربه . ولا يراد بوصف يونس بالظلم هنا حقيقة الظلم , لأنه نبى كريم (علية الصلاة والسلام ) , والأنبياء معصومون , يعصمهم الله من الوقوع فى الظلم والفسق والذنب والعصيان . وصف يونس نفسه بالظلم لشعوره بالتقصير فى حق الله , وحيائه من الله , وطلبة تفريج الغم والكرب والضيق . الملائكة تشفع له عند ربه عزوجل إن يونس النبى (علية الصلاة والسلام ) , حين بدا له أن يدعوا بهذه الكلمات وهو فى بطن الحوت , فقال : لا إله إلا أنت سبحانك إنى كنت من الظالمين , فأقبلت الدعوة تحف بالعرش ... قالت الملائكة : يا رب هذا صوت ضعيف معروف من بلاد بعيدة غريبة ...فقال الله تعالى : أما تعرفون هذا ؟ قالوا : يارب أو لا ترحم ما كان يصنع فى الرخاء فتنجيه فى البلاد , قال : بلى فأمر الحوت فطرحه بالعراء . خرج يونس علية السلام من بطن الحوت وهو فى غايه المرض والتعب وقد ضعف بدنه وتاكل جلده .. قال تعالى : ((فنبذنه بالعراء وهو سقيم )). وقف الحوت على شاطىء البحر بأمر الله , وأخرج يونس من بطنه بأمر الله , والقاه على الشاطىء بأمر الله وعاد الى مياة البحر بأمر الله. وبهذا انتهت محنة يونس فى البحر وفى بطن الحوت , بأمر الله وخرج منها بأمان ... برعاية وتدبير الله . محنة جديدة لكنة وقع فى محنه جديدة , سيرعاه الله فيها ويدبر له تجاوزها والخروج منها بأمان . ألقاه الحوت على شاطىء البحر وهو مريض : ((فنبذنه بالعراء وهو سقيم )) . والسقيم هو المريض . وتخيل معنا منظر إنسان عاش فى بطن الحوت ساعات أو أياما –وجو بطن الحوت معروف بحرارته – كيف سيكون بدنه ووضعه عند خروجه .\n\nلا شك أنه سيكون سقيما مريضا فى جسمه , وسقيما فى جلده , الذى سيكون أشبه بالمسلوق المسلوخ . وإذا كان الله انقذة من اخطار البحر , عندما سخر له الحوت فإنه سينقذه من أخطار البر ! إن شاطىء البحر موبوء بالميكروبات والجراثيم , وإن يونس سقيم مريض ضعيف البدن , مسلوخ الجلد , فهو عرضة للاصابة بالامراض والافات ... الشمس الحارة على شاطىء ستؤذى جسمه المسلوخ , والذباب والبعوض سيتكاثر على لحمه المقروح ! والله حكيم لطيف رحيم , سيرحم عبده يونس على الشاطىء وييسر له وسيلة خارقة معجزة , يتجاوز بها تللك الأخطار . معجزة إنبات شجرة اليقطين على يونس كانت الوسيلة المعجزة فى إنبات شجرة اليقطين عليه : ((وأنبتنا عليه شجرة من يقطين )) . واليقطن هو القرع المعروف . فهو يسمى يقطيتا , ويسمى قزعا , ويسمى دباء . كان إنبات شجرة اليقطين على يونس علية السلام معجزة من المعجزات الله ليحميه من حر الشمس وميكروبات البعوض والذباب , وليمنحه الظل الوارف . لم يكن إنبات اليقطين عليه بطريقة عادية , ولم تمر بمراحل (دورتها الزراعية) المعروفة , فلو كان الأمر كذلك لضاعت الفائدة منها . فبذرة (اليقطين) تحتاج الى ايام تحت الارض لتنبت , ثم تحتاج إلى اسابيع لتمتد , إلى أسابيع أخرى لتكبر , وستفتك الأمراض بيونس الملقى على شاطىء مسلوخ الجلد سقيم البدن ! كان انبات شجرة اليقطين على يونس فى لحظات أو ساعات , معجزة من المعجزات الله الباهرات ! أمر الله بذرة اليقطين فى باطن الأرض فنبتت ، وأمرها فظهرت على وجه الأرض ، وأمرها أن تمد ساقها على وجه الأرض ففعلت ، وأمرها ان تخرج أوراقها الكبيرة العريضه ففعلت ، وأمرها أن ترتفع على ساقها عن وجه الأرض وكأنها معروشه ففعلت ، وأمرها أن تتوجه الى يونس السقيم ، أن تظلل عليه بأوراقها الكبيرة ، وان تحيط به بحنان ورعاية ففعلت وسبحان الله القادر على كل شىء ، الفعال لما يريد وكما كان الحوت فى البحر جنديا من جنود الله ، ساقه الله لحماية يونس فى بطنه ، كذلك شجرة اليقطين جندى من جنود الله ، سخرها الله لحماية يونس على شاطىء البحر وما يعلم جنود ربك إلا هو لماذا شجرة اليقطين بالذات؟ لكن لماذا اليقطين بالذات ؟ قال الإمام ابن كثير عن ذلك (( وذكر بعضهم فى القرع فوائد ، منها :ىسرعة نباته ، وتظليل ورقه لكبره ، ونعومته ، وأنه لا يقربها الذباب ، وجودة تغذية ثمره ، وأنه يؤكل نيئا ومطبوخا ، وقشره أيضا وقد ثبت أن رسول الله كان يحب الدباء ، ويتتبعه من من نواحى الصفحة )) أراد الله الحكيم شجرة اليقطين دون غيره لحكم ثلاث: الأولى : اوراق اليقطين عريضة متشابكة ، تظلل بدن يونس علية السلام بشكل كامل ، وتقيه حر أشعة الشمس ، وبذلك تحفظ قروح بدنه من ا لتضرر بأشعة الشمس المؤذية الثانيه : أوراق يقطين ناعمه الملمس ، وبدن يونس المقروح بحاجة إلى غطاء ناعم لئلا يؤذى الثالثه : لا يقرب أوراق اليقطين الحشرات ناقلة الأمراض ، وبالذات الذباب والبعوض وهذه ملاحظة يدركها المزارعون الفلاحون ، فيرون الذباب لا يقترب من نبات اليقطين ، وكأن بينهما عداوة متأصلة من ألاف السنين !! وكأن أوراق اليقطين جعلها الله تعقيما لبدن يونس المقروح ، لئلا تقربه الحشرات ، وتنشر فيه الجراثيم والميكروبات ! وسبحان الله الحكيم !! رح يونس علية السلام بايمان قومه لما عافى الله يونس علية السلام تحت شجرة اليقطين أعاده إلى قومه ، الذين غادرهم ، لأنهم أمنوا به أثناء غيابه عنهم ، فأعاده إليهم ليبلغهم الشريعة والأحكام قال تعالى : (( وأرسلنه إلى مائة ألف أو يزيدون فئامنوا فمتعنهم إلى حين )) وكون أهل نينوى فى ذلك الزمن الماضى أكثر من مائة ألف شخص ، له دلالة حضارية ، حيث يشير إلى أن منطقة نينوى كانت مأهوبالسكان ... وكونهم امنوا بالله واتبعوا يونس علية السلام دليل على كثرة عدد المؤمنين السابقين ... فاجتماع أكثر من مائة ألف مؤمن فى زمان ومكان واحد فى الماضى شىء جيد طيب , يسر المؤمنين . لما امن قوم يونس رفع الله عنهم العذاب , الذى كان عاى وشك الوقوع بهم , ومتعهم بحياة طيبة سعيدة , إلى حين مجىء اجالهما وانتهاء أعمارهم . قال تعالى :((فلولا كانت قرية ءامنت فنفعها إيمنها إلا قوم يونس لما ءامنوا كشفنا عنهم عذاب الخزى فى الحيوة الدنيا ومتعنهم إلى حين )) . ويقرر الله حقيقة تاريخية : لم يؤمن أهل قرية بكاملهم من قرى الكافرين السابقين , ولو امنوا بكاملهم لنفعهم , ورفع العذاب عنهم . ولا يستثنى من هؤلاء إلاقوم يونس , فقد كانوا كفارا , وهددهم الله بالعذاب , ولكنهم امنوا بكاملهم جميعا قبل انتهاء المهلة , وقبل وقوع العذاب , وبذلك نفعهم إيمانهم , فرفع الله العذاب عنهم فى الدنيا والاخرة , وجعلهم يعيشون حياتهم فى سعادة , إلى حين انتهاء أعمارهم ومجىء اجالهم . وكذلك ننجى المؤمنين كان يونس علية السلام فى بطن الحوت مغموما يغشاه الغم والحزن , وكان , وكان مكظوما مملوءا كربا وهما وغما , فاستجاب الله له , وتداركه برحمته,وأوقع عليه نعمته , فزال عنه الغم والكرب , ونجاه من المحنة . ثم ذكر الحق (جل وعلا) بعد إنجاء يونس علية السلام أن من لجأ إلى الله فى وقت الشدة ودعا وتضرع إلى الله وقال تلك الدعوة التى بها يونس علية السلام فإن الله عزوجل سينجه ... قال تعالى : ((فاستجبنا له ونجدينه من الغم وكذلك نجى المؤمنين )) . أى: كما أنجيتا يونس من الغم, وأنقذناة من الخطر وأخرجناه سالما معافى , كذلك نفعل بكل مؤمن صالح ... فإذا وقع مؤمن فى غم وكرب , ثم دعانا وتصرع إلينا , فإننا نستجيب له كما استجبنا ليونس , وننجيه كما أنجينا يونس . لقد جعل الله الحديث عن إنجائه ليونس فرصة مناسبة لتقرير حقيقة إنجائه للمؤمنين المكروبيين . وهذا فنح باب الأمل والرجاء لهؤلاء , ليستشرفوا الفرج وينتظشد حالات الغم والكرب , وما عليهم إلا أن يفعلوا كما فعل يونس علية السلام فيقبلوا على الله بتضرع وإنابة واستغاثة , وليوقنوا أن الله سينجيهم ويفرج عنهم , كما فعل مع يونس علية السلام هذا وعده لهم : ((المؤمنين وكذالك نجى))والله لا يخلف الميعاد !! قال صلى الله عليه وسلم (دعوة ذى النون إذ دعا بها وهو فى بطن الحوت , لا إله إلا أنت سبحانك إنى كنت من الظالمين, لم يدع بها رجل مسلم فى شىء قط إلا استجاب الله له) . ما بين يونس علية السلام ومحمد صلى الله عليه وسلم ونحن حين نقرأ قصة نبى الله يونس علية السلام تذهب بنا الذاكرة إلى ذللك اليوم الذى عاد فيه النبى صلى الله عليه وسلم من الطائف لما ذهب ليدعوهم فاذوه . فإنه لما تعرض رسول الله صلى الله عليه وسلم للأذى من أهل الطائف , وخرج من عندهم , وألجؤوه إلى حائط لعتبة بن ربيعة وشبية بن ربيعة وهما فية . فلما راه ابنا ربيعة – عتبة وشيبة- وما لقى , تحركت له رحمهما فدعوا غلاما لهما نصر انيا يقال له : ثم اذهب به إلى ذلك الرجل , فقل له يأكل منه ... ففعل عداس , ثم أقبل به حتى وضعه بين يدى رسول الله صلى الله عليه وسلم ثم قال له : كل . فلما وضع له رسول الله صلى الله عليه وسلم فيه يده , قال: ((باسم الله)) ثم أكل,فنظر عداس فى وجهه , ثم قال : والله إن هذا الكلام ما يفوله أهل هذه البلاد , فقال له رسول الله صلى الله عليه وسلم :(ومن أهل أى البلادأنت يا عداس ؟ وما دينك ؟ قال : نصرانى , وأنا رجل من أهل نينوى . فقال رسول الله صلى الله عليه وسلم :(من قرية الرجل الصالح يونس بن متى),فقال له عداس : وما يدرك ما يونس بن متى ؟ فقال رسول الله صلى الله عليه وسلم : (ذاك أخى , كان نبيا وأنا نبى ) , فأكب عداس على رسول الله صلى الله عليه وسلم يقبل رأسه ويديه وقدميه . قال : يقول ابنا ربيعة أحدهما لصاحبه : أما غلامك فقد أفسده عليك ..فلما جاءهما عداس قالا له : ويلك يا عداس !مالك تقبل رأس هذا الرجل ويديه وقدميه؟ قال : يا سيدى ما فى الأرض شىء خير من هذا , لقد أخبرنى بأمر ما يعلمه إلا نبى ... قالا له : ويحك يا عداس , لا يصرفنك عن دينك , فإن دينك خير من دينه ؟ النبى يدافع عن يونس عليه السلام عن أبى هريرة رضى الله عنهم قال : (لا ينبغى لعبد أن يقول : أنا خير من يونس بن متى ) . وعن عبد الله بن مسعود قال رسول الله صلى الله عليه وسلم :( لا يقولن أحد إنى خير من يونس بن متى ) . ففى هذه الاحاديث يدافع رسول الله صلى الله عليه وسلم عن يونس بن متى عليه السلام , فى مغادرته لقومه باجتهاده ,وينهي أي شخص أن يعتبر نفسه افضل من يونس عليه السلام ,وانه افضل عند الله من اي نبي . وهذا معناه ان نبي الله يونس عليه السلام لو يكن مخطئا في فعله ,وان ما قام منه باجتهاده كان جائزا ,لكنه كان خلاف الاولي .",
    "number-en": "The story of the whale of Yunus, peace be upon him",
    "label-en": "God Almighty said: ((And Yunus was of the messengers () when he was left for the loaded ark () so he participated and was one of the rebutters () Then the fish caught him while he was remorseful) () And had he not been of those who glorified () he would have remained in its belly until the day they were resurrected) () So we put him out in the open while he was watering) () and We caused a pumpkin tree to grow over him () and We sent him to a hundred thousand or more () so they believed, so He gave them assistance for a while. ))\n\nSo come with us so that we can coexist in our hearts and souls with the story of the whale of the Prophet of God, Yunus, peace be upon him. In ancient Iraq, there was a village called (Nineveh)... It is a village in which blessings and good things abound, such as crops, fruits, animals, vegetables, and water flowing from rivers... But the people of the village did not thank God for the blink of an eye... Rather, they disbelieved in God and worshiped idols, planets, and stars other than the living people (Glory be to Him)... and they remained in that state for a long time. So God Almighty sent their Prophet Yunus, peace be upon him, to the straight path, and warned them of the torment of a great day, so that they would turn away from the misguidance and disbelief they were in, and refrain from committing forbidden things. Yunus, peace be upon him, was not from the people of Nineveh. He was a stranger to the people. He did not belong to them and was not related to them.\n\nSo he stayed with them, calling them to guidance, guiding them to goodness, and showing them virtues and good morals. They did not respond to him, did not listen to his advice, and increased their deviation from the straight path. They became secure in their distance from the right approach, and they drowned in their pleasures and desires. Yunus, peace be upon him, was a young man with a fresh lute and full of vitality and activity. He became angry because the people of Nineveh turned away from his call. So God revealed to her that she warned them that torment would descend upon them if they did not believe in God (the Majestic and Most High)... So Yunus, peace be upon him, went to them and warned them of the torment of the Fire and its punishment, and promised them that torment would befall them because of their disbelief and stubbornness. However, they did not respond to him... Rather, they mocked him and his words... so Yunus became very sad... and continued to call them to God until he despaired of them, so he left that village and promised them that torment would descend upon them after three days. Repentance of the people of Yunus, peace be upon him. Yunus, peace be upon him, did not wait for the command to come to him from God Almighty to leave this village whose people were oppressive.. Rather, he hastened to leave while he was in an intense state of sadness and anger. The first day passed since the date that Yunus had set for the torment to befall them. The second day passed without anything happening. When the third day came, they saw signs of torment descending upon them.\n\nWhen they realized that torment had descended upon them, God cast repentance and repentance into their hearts, and they regretted what they had done to their Prophet, so they put on sackcloth, and separated every animal from its offspring, then they howled to God Almighty, and cried out, and pleaded with Him, and held fast to Him. Men and women, sons and daughters, and mothers wept, and the cattle, animals, and livestock ran wild. The camels and their herds bleated, the cows and their calves bleated, the sheep and their lambs bleated, and it was a great hour, so God, with His might, strength, compassion, and mercy, removed from them the torment that had befallen them because of their repentance, and for this reason the Almighty said: ((And had there not been a city that had believed and its faith had benefited it, except the people of Yunus. When they believed, We removed from them the torment of disgrace in this world’s life and their hardship until While)). Our Lord has told us that the people of Yunus benefited from their faith after torment befell them, and God’s elevation over them after they were surrounded by them. The three days that Yunus promised had passed, and he came to see what God had promised about them, and perhaps he was withdrawing from them, not knowing what they had done in terms of repentance and repentance... When he looked at them, he found them safe, and that angered him. The punishment for a murderer in their view was to be killed, so he ran away from his people, for fear of being killed.\n\nIt was obligatory for Yunus to be satisfied with the decree of God (Blessed and Most High) and to submit to His command. It is not for the servant to be angered by the actions of his Lord, and Yunus would not have left without His permission. For this reason, Allah forbade our Messenger to be like the companion of the fish. And the companion of the fish is Yunus because the fish acceded to him... God Almighty said ((So be patient for the judgment of your Lord and do not be like the companion of the fish.) Lahut)) When the people of Yunus repented and God lifted the torment from them, they began searching for Yunus (peace be upon him), but they did not find him, so they prayed to God to return to them this noble prophet who left their country despairing of their faith after they had opposed him and ridiculed him. Yunus (peace be upon him) in the belly of the whale. Yunus was at that moment far away from that village until he reached the seashore and found a ship preparing to depart, so he asked them to take him with him, and they agreed and were extremely happy to have this noble Prophet on board that ship. When the ship took off, Yunus, peace be upon him, began praying and remembering God (Glory be to Him). The people loved him very much and rejoiced in the presence of this righteous prophet with them. They did not ask him to do anything. Rather, they served him and took care of his comfort. When the night got dark, Yunus went to a corner of the ship, closed his eyes, and fell into a deep sleep. This was because of the fatigue he encountered that day from walking and the effort of walking. It was only a few hours before he (peace be upon him) woke up from his sleep in panic at the sound of people screaming on the ship...the waves began to rise and hit each other and the ship almost sank...so the captain of the ship had no choice but to issue his orders to lighten the ship’s load so that it would not sink.\n\nThe passengers began to throw away some of their luggage, hoping that this would save them...but despite this, the ship was still in turmoil and was about to sink with all of them. Here the ship's captain issued orders that one of the passengers must be thrown into the sea, otherwise the ship will sink. Here, every passenger refused to throw himself into the sea in this complete darkness...because whoever throws himself into the sea at this time, if the fish and whales do not eat him, will die of fear and terror. So the captain advised them to cast lots, and whoever got the lots should throw himself into the water instead of all of them drowning. When they cast lots, the lot fell on the Prophet of God, Jonah, to throw him into the sea, but they refused to throw him into the sea. They repeated the lot for the second time, so it fell on the Prophet of God, Jonah. They said: It is impossible for us to throw this noble Prophet into the sea... So they prepared the lot for the third time, so it fell on the Prophet of God, Jonah... So he did nothing but throw himself into the sea, and everyone was sure of his death and ruin. The ship set off on its way... As for Yunus (peace be upon him), God sent him a great whale from the Green Sea, which caught it and swallowed it. So God commanded the whale not to eat his meat and not to break his bones, for it was not his sustenance...so the whale floated across all the seas with him. Indeed, it is a unique miracle. When Yunus (peace be upon him) settled in the belly of the whale, God performed another miracle for him, as He commanded the whale’s digestive system not to digest Yunus, and not to secrete digestive juices on it. This entry into the stomach is not a meal, and it is not suitable for digestion. It only resides in the stomach for a short period of time, only to leave it after that. This stomach is more like a lifeboat. To save him, she is not allowed to digest him. The whale's stomach received God's command willingly and carried it out, but it did not secrete its digestive juices onto Yunus, and Yunus remained alive in it. Let no one be surprised by this matter. If the matter were commanded by us humans, it would be impossible. No human being can control the whale, nor command it not to chew its prey in its mouth, or to digest it in its stomach. And if one of us commanded it to do so, it will not respond to it, because it will not understand it, nor will it submit to it.\n\nMoreover, it is not possible for anyone to remain alive in the stomach of an animal or a whale, according to human calculations, because if the whale does not chew it or digest it, it will not remain alive in its stomach, because it will die by cutting off its oxygen. This is based on human logic and human calculation. As for God’s will and power, the matter is easy to understand... God does what He wants, and He is capable of all things... God is the one who commanded the whale to head towards the ship, so it did, and commanded it to open its mouth to receive Jonah, so it did, and commanded its mouth not to chew Jonah, so it did, and commanded its stomach not to digest Jonah, so it did. God is the one who destined Yunus to live alive in the belly of the whale. The whole matter is miracles and supernatural things that humans are unable to do, but they are understandable because they are the work of God. - Yunus, peace be upon him, prostrated to God Almighty in the belly of the whale - and when he settled in the belly of the whale, he thought that it was dead, so he moved his limbs and they moved, and behold, he was alive, and he fell down, prostrating to God, and said: O Lord... I have made a place of worship for you in a place where no one has ever worshiped you. Yunus, peace be upon him, was surprised that he was in three darknesses: the darkness of the night, the darkness of the bottom of the sea, and the darkness of the belly of the whale... And here he felt his sin and felt that he had sinned when he left the village without an order from God (Almighty and Majestic), so he began to pray and praise God and ask forgiveness of God (Glory be to Him) in the belly of the whale. Yunus, peace be upon him, resorted to God Almighty to save him. Yunus, peace be upon him, inspected himself and found himself in the belly of the whale, and the whale was diving under the water. It was one of the thousands of whales that swim in the depths of the sea.\n\nSo what did Yunus, peace be upon him, do? Is it possible for him to seek help from a human being and how should he do so? If he raised his voice and shouted for help, would a human being hear his voice?.....And if a force of human beings wanted to help and rescue him, would they know the whale that contained him? Is it possible to distinguish it from thousands of similar whales? All created beings are unable to help him and find him, Yunus, peace be upon him, if they wanted to...and if they reach him after a while, they will be unable to save him alive!! Yunus, peace be upon him, is a noble prophet. He realizes this truth, and is certain that no one will save him except God, and no one will relieve his distress except God. Therefore, he turned to God, remembered Him, glorified Him, called upon Him, sought His help, and pleaded with Him. The verses of the Qur’an recorded this turning of faith to God, and made it a guiding teacher and a good example for believers after Yunus, peace be upon him, to imitate him when they go through distress, tribulation, grief, or distress. God Almighty said: ((And had he not been of those who glorify God, he would have remained in his stomach until the Day they are resurrected)). That is: If Yunus had not been praising God, he would have remained in the belly of the whale until the Day of Resurrection.... That is: God will command the whale’s stomach to secrete its digestive juices onto Yunus, and to turn him into a meal. His praise of God is a reason for which he was destined to save him. If this reason had not been achieved, Yunus would not have been saved. The previous praise of Yunus was the reason for his salvation through the mercy of Allah. When was Yunus praising Allah? Is it only in the belly of the whale? Or was he a swimming pool before that? Praise was a permanent characteristic, inherent to Yunus, peace be upon him. This means that he was praising God when he was among his people, calling them to God, and he was praising God when he settled in the belly of the whale. He had a large reserve of remembrance and praise of God, and this reserve was a beneficial and positive cause. God was able to have mercy on Yunus and save him from this ordeal. He knew God during prosperity, so God recognized him during hardship, and he remembered God during prosperity, and this benefited him during hardship, and God relieved him because of that. The righteous believer imitates Yunus, peace be upon him, in this aspect. He is keen to remember and worship God a lot in times of prosperity, so that he may have a great asset with God, and that God may have mercy on him in times of adversity and adversity. After Yunus, peace be upon him, praised his Lord while he was in the belly of the whale, he pleaded with Him, called upon Him, sought His help, and said: There is no god but You, Glory be to You. Indeed, I have been of the wrongdoers. It was possible for him to remain in the belly of the whale until the Day of Resurrection, but one thing was the reason for his escape from this painful torment... This thing is praise, remembrance, and supplication. Yunus, peace be upon him, uttered the good word in his supplication ((There is no god but You)) and declared the monotheism of divinity and emphasized it. He is in distress and distress, and he is far from all of his created supporters and helpers, and he is certain that any human power is unable to reach him, and that no created being can provide him with help or benefit. He lives in the truth that there is no god but God, and senses his condition that there is no god but God, and actually realizes that there is no benefactor, no helper, and no supporter except God. That is why he spoke it with his tongue, while he conjured it in his heart and lived it with his being. We benefit from this noble prophetic supplication by beginning our supplications and prayers by praising God and declaring that there is no god but God, and then we present our requests and needs after that. After Yunus praised God, he admitted his shortcomings, saying: ((Indeed, I was one of the wrongdoers)).\n\nYunus realized, while he was in the belly of the whale going into the open sea, that he had rushed to leave his people, before God directed him, and that God blamed him and blamed him for that, and was destined to inflict this calamity on him and put him to the test. When he realized this, he began to admit that he had been unjust in his actions, behavior, and outbursts, and asked God to forgive his injustice, forgive him, and relieve his distress. Describing Yunus as unjust does not mean the reality of injustice here, because he is a noble prophet (peace and blessings be upon him), and prophets are infallible, and God protects them from falling into injustice, immorality, sin, and disobedience. Yunus described himself as an oppressor because of his feeling of negligence in his duty to God, his shyness from God, and his request for relief from grief, anguish, and distress. The angels intercede for him with his Lord, the Almighty, that the Prophet Yunus (peace and blessings be upon him), when it seemed to him to supplicate with these words while he was in the belly of the whale, said: There is no god but You, Glory be to You. Indeed, I have been of the wrongdoers, so the invitation was accepted, encircling the throne... The angels said: O Lord, this is a weak, well-known voice from a far, strange land... Then God Almighty said: Do you not know this? They said: O Lord, do you not have mercy on what he did during times of prosperity, so save him in the country? He said: Yes, so he commanded the whale and threw it out into the open. Yunus, peace be upon him, came out of the belly of the whale while he was very sick and tired, and his body was weak and his skin was corroded.. God Almighty said: ((Then we cast him out into the open air while he was sick)). The whale stopped on the seashore by God’s command, took Yunus out of its stomach by God’s command, threw him on the shore by God’s command, and returned to the sea waters by God’s command. Thus, Yunus’ ordeal in the sea and in the belly of the whale ended, by God’s command, and he emerged from it safely... under God’s care and management. A new ordeal, but he fell into a new ordeal, and God will take care of him and arrange for him to overcome it and emerge from it safely. The whale threw him on the shore of the sea while he was sick: ((So we threw him out in the open while he was sick)). The sick is the patient. Imagine with us the view of a person who lived in the belly of a whale for hours or days - and the atmosphere of the belly of the whale is known for its heat - what his body and condition will be like when he emerges.\n\nThere is no doubt that he will be sick and sick in his body, and sick in his skin, which will be like a boiled, flayed animal. If God saved him from the dangers of the sea, when he subjected the whale to him, then He will save him from the dangers of land! The seashore is infested with microbes and germs, and Yunus is sick, sick, weak in body, with flayed skin. He is vulnerable to diseases and pests... The hot sun on the beach will harm his flayed body, and flies and mosquitoes will multiply on his ulcerated flesh! God is Wise, Kind and Merciful. He will have mercy on His servant Yunus on the shore and facilitate for him a miraculous means by which he will overcome these dangers. The miracle of sprouting a pumpkin tree on Yunus. The miraculous means of sprouting a pumpkin tree on him was: “And We caused a pumpkin tree to grow on him.” Pumpkin is the well-known squash. It is called yaqtita, it is called Qaza, and it is called Dabaa. The growth of a pumpkin tree on Yunus, peace be upon him, was one of God’s miracles, to protect him from the heat of the sun and the microbes of mosquitoes and flies, and to give him abundant shade. The pumpkin did not grow in a normal way, and it did not go through the known stages of its agricultural cycle. If that were the case, the benefit from it would be lost. The pumpkin seed needs days underground to germinate, then it needs weeks to expand, and more weeks to grow, and diseases will destroy Yunus, who is lying on a beach with flayed skin and a weak body! The sprouting of a pumpkin tree on Yunus in a matter of moments or hours was one of God’s dazzling miracles! God commanded the pumpkin seed in the interior of the earth and it grew, and commanded it to appear on the surface of the earth, and commanded it to extend its stem over the surface of the earth, and it did, and commanded it to put out its large, broad leaves, and it did, and commanded it to raise its stem above the surface of the earth, as if it were trellised, so it did. He ordered her to go to the sick Yunus, to shade him with her large leaves, and to surround him with tenderness and care. So she did, and Glory be to Allah, the All-Powerful, the One who does what He wants. Just as the whale in the sea was a soldier of God, and God led it to protect Yunus in his stomach, so the pumpkin tree is a soldier of Yunus in his stomach, so the pumpkin tree is a soldier of Allah, God subjected it to protect Yunus on the shore of the sea, and no one knows the soldiers of your Lord except Him, why the pumpkin tree in particular? But why pumpkin in particular? Imam Ibn Katheer said about this: ((Some of them mentioned benefits of pumpkin, including: the speed of its growth, the shading of its leaves due to its largeness and softness, the fact that it is not approached by flies, the good nutrition of its fruit, and that it is eaten raw and cooked, and its peel as well. It has been proven that the Messenger of God loved insects, and tracked them from all sides of the page)) God the Wise wanted the pumpkin tree and no other for the rule of three: The first: the pumpkin leaves are broad. Intertwined, they completely shade the body of Yunus, peace be upon him, and protect him from the heat of the sun’s rays, thus protecting the sores on his body from being damaged by the harmful rays of the sun. Second: Pumpkin leaves that are soft to the touch. Yunus's wounded body needs a soft cover so that he does not get hurt. Third: Do not approach pumpkin leaves with insects that carry diseases, especially flies and mosquitoes. This is an observation that peasant farmers realize, as they see that flies do not approach pumpkin plants, as if there was an enmity between them that has been rooted for thousands of years!! It is as if the pumpkin leaves were made by God to sterilize Yunus’s bruised body, so that insects would not approach him and spread germs and microbes in him! Glory be to God, the Wise!! Yunus, peace be upon him, departed with the faith of his people. When God healed Yunus, peace be upon him, under the pumpkin tree, he returned him to his people, whom he had left, because they believed in him during his absence from them. So he returned him to them to inform them of the law and the rulings. God Almighty said: ((And We sent him to a hundred thousand or more, and they believed, so he helped them for a while)) and the fact that the people of Nineveh in that past era were more than a hundred thousand people, has a cultural significance. Where he indicates that the Nineveh region was populated... and the fact that they believed in God and followed Yunus, peace be upon him, is evidence of the large number of former believers... The gathering of more than one hundred thousand believers in one time and place in the past was a good and good thing that pleased the believers. When the people of Yunus became secure, God lifted from them the torment that Ai was about to inflict on them, and granted them a good and happy life, until their time came and their lives ended. God Almighty said: ((And had there not been a town that believed, and its faith benefited it, except for the people of Yunus, when they believed, We removed from them the torment of disgrace in the life of this world, and their hardship for a while)). God establishes a historical fact: Not all of the people of a village from the villages of the former disbelievers believed, and if they had believed completely, it would have benefited them and lifted the torment from them. The people of Yunus are not excluded from these, for they were infidels, and God threatened them with torment, but they believed in their entirety before the end of the deadline, and before the torment occurred, and thus their faith benefited them, so God lifted the torment from them in this world and the hereafter, and made them live their lives in happiness, until the end of their lives and the coming of their time. And thus We save the believers. Yunus, peace be upon him, was in the belly of the whale, distressed and covered with grief and sadness, and he was, and he was, distressed and full of anguish, anxiety, and grief, so God responded to him, and corrected him with His mercy, and bestowed upon him His grace, so the grief and distress were removed from him, and he was saved from the ordeal. Then the Truth (Glory be to Him) mentioned after the rescue of Yunus, peace be upon him, that whoever turns to God in a time of distress and supplicates and supplicates to God and says that call that Yunus, peace be upon him, made, then God Almighty will save him... God Almighty said: ((So We responded to him and rescued him from distress, and thus He saved the believers)). That is: Just as You saved Yunus from grief, saved him from danger, and brought him out safe and sound, so we do to every righteous believer... If a believer falls into distress and distress, then calls upon us and pleads with us, then we respond to him as we responded to Yunus, and we save him as We saved Yunus. God made the talk about His rescue of Jonah an appropriate opportunity to declare the truth of His rescue of the distressed believers. This opens the door of hope and hope for these people, so that they can look forward to relief and avoid situations of grief and anguish. All they have to do is do what Yunus, peace be upon him, did, and they turn to God with supplication, repentance, and seeking help, and to be certain that God will save them and release them, as He did with Yunus, peace be upon him, and this is His promise to them: ((And thus He saved the believers)) and God does not break His promise!! He, peace and blessings of God be upon him, said (The supplication of Dhul-Nun when he supplicated it while he was in the belly of the whale: There is no god but You, Glory be to You. Indeed, I have been of the wrongdoers. No Muslim man ever supplicated for anything except that God answered him.) Between Yunus, peace be upon him, and Muhammad, may God’s prayers and peace be upon him. When we read the story of the Prophet of God, Yunus, peace be upon him, our memory takes us to that day when the Prophet, may God’s prayers and peace be upon him, returned from Taif when he went to call on them, so they harmed him. When the Messenger of God, may God bless him and grant him peace, was exposed to harm from the people of Taif, and he left them, they took refuge with him at the wall of Utbah bin Rabi’ah and Shabiyah bin Rabi’ah while they were there. When the two sons of Rabi’ah - Utbah and Shaybah - saw him and what he had met, their compassion for him was moved, so they called for a boy of theirs, Nasr Anya, who was told: Then take him to that man, and tell him to eat from it... So Adas did so, then he approached him until he placed it in the hands of the Messenger of God, may God bless him and grant him peace, then he said to him: Eat. When the Messenger of God, may God bless him and grant him peace, placed his hand in it, he said: ((In the name of God)) and then he ate. Then Addas looked at his face, then said: By God, these words are not what the people of this country say. So the Messenger of God, may God bless him and grant him peace, said to him: (And from the people of which country are you, O Addas? And what is your religion? He said: I am Christian, and I am a man from the people of Nineveh. The Messenger of God, may God bless him and grant him peace, said: (From the village of the righteous man, Yunus ibn Matta). Then Adas said to him: What is the meaning of Yunus ibn Matta? The Messenger of God, may God bless him and grant him peace, said: (That is my brother. He was a prophet and I am a prophet), so Adas leaned on the Messenger of God, may God bless him and grant him peace, kissing his head, hands, and feet. He said: Rabi’ah’s two sons, one of them says to his friend: As for your boy, he has spoiled him for you.. When Addas came to them, they said to him: Woe to you, Addas! Why do you accept this man’s head, hands, and feet? He said: O my master, there is nothing better on earth than this. He told me something that only a prophet knows... They said to him: Woe to you, Adas. He will not turn you away from your religion, for your religion is better than his religion? The Prophet defends Yunus, peace be upon him, on the authority of Abu Hurairah, may God be pleased with them, who said: (No servant should say: I am better than Yunus ibn Matta). On the authority of Abdullah bin Masoud, the Messenger of God, may God bless him and grant him peace, said: (Let no one say that I am better than Yunus bin Matta). In these hadiths, the Messenger of God, may God bless him and grant him peace, defends Yunus ibn Matta, peace be upon him, in his departure from his people through his own ijtihad, and forbids anyone from considering himself better than Yunus, peace be upon him, and that he is better in the sight of God than any prophet. This means that if the Prophet of God, Yunus, peace be upon him, was wrong in his action, and that what he did based on his own ijtihad was permissible, but it was contrary to what was first."
  },
  {
    "number": "قصة ثعبان موسى عليه السلام ",
    "text": "",
    "label": "\nقال الله تعالى : فَأَلْقَى عَصَاهُ فَإِذَا هِيَ ثُعْبَانٌ مُّبِينٌ .\n\nكان موسى عليه السلام في الصحراء متوجهاً إلى مصر، وكانت الصحراء باردة جداً، رأى موسى من بعيد ناراً، فقال لزوجته: ابقَيْ هنا، سأذهب لأُحضر بعض النار نتدفأ بها، وأسأل عن الطريق. عندما وصل حيث رأى النار، سمع صوتاً يناديه: يا موسى. ارتعش موسى خوفاً ورهبة وقال: نعم. قال الله عز وجل: ﴿ إِنِّي أَنَا رَبُّكَ ﴾. ازداد ارتعاش موسى وقال: نعم يا رب.. قال الله عز وجل: ﴿ فَاخْلَعْ نَعْلَيْكَ إِنَّكَ بِالْوَادِ الْمُقَدَّسِ طُوًى ﴾ [طه: 12]. فخلع موسى نعليه، وأخبره الله العظيم جل وعلا أنه اختاره ليخبر فرعون وقومه أن المستحق للعبادة وحده هو الله، وأن مَن يعبد إلهاً غيره فلن يُقبل منه ولسوف يعاقَب في الآخرة. وأيّده بمعجزتين تدلاّن على أنه نبيٌّ صادق، كما كلّفه سبحانه بإخراج بني إسرائيل من سجون فرعون.\n\nتابع موسى عليه السلام طريقه إلى مصر، ودعا الله أن يشرحَ صدره ويُيسِّر أمره. دخل موسى عليه السلام إلى القصر، وتحدث مع فرعون عن عبادة الله. قال له فرعون: أنت رجل كاذب، فأنا الرب الأعلى. فألقى موسى عصاه كما علمه الله، فتحولت العصا إلى ثعبان ضخم مخيف، ومدّ يده إليها فعادت كما كانت عصا. ثم أخرج يده من جيبه فإذا لونها أبيض كالبدر، وعندما أدخلها ثانية إلى جيبه، عاد لونها الطبيعي. اغتاظ فرعون وغضب غضباً شديداً، وقال له: إنك ساحر كبير، وسأثبت لك ذلك. أمر فرعون السحرة، فتجمعوا في ساحة كبيرة، وألقَوْا حبالهم وعِصيهم التي كانوا يحركونها بخفة ومهارة فتبدو لمن يراها وكأنها ثعابين تمشي على الأرض. خاف موسى، لكنه تذكر أن الله معه وسوف ينصره، فألقى عصاه، فتحولت إلى ثعبان ضخم ابتلعٍ كل ما صنعوا!! وعرض عليهم معجزة اليد أيضاً!!\n\nوهنا فوجئ السحرة، وقالوا: نحن سحرة ونعرف السحر جيداً، وما فعله موسى ليس سحراً أبداً. وعندها آمن به السحرة كلهم، وقالوا له: إنك صادق، وإنك نبيّ، وإن ربنا هو ربك الذي تعبده. اشتد غضب فرعون، وصار يصرخ ويقول: أنا ربكم الأعلى، كيف تعبدون إلهاً غيري؟ سأنتقم منكم! سأقطع أيديكم وأرجلكم! سأصلبكم على جذوع الأشجار وأقتلكم! لكنهم أحبوا الإيمان ودخل قلوبهم فلم يتراجعوا، ولم يخافوا منه.",
    "number-en": "The story of the snake of Moses, peace be upon him",
    "label-en": "God Almighty said: Then he threw his staff, and behold, it was a visible snake.\n\nMoses, peace be upon him, was in the desert, heading to Egypt. The desert was very cold. Moses saw a fire from afar, so he said to his wife: Stay here. I will go get some fire to warm ourselves with, and ask about the way. When he arrived where he saw the fire, he heard a voice calling him: O Moses. Moses trembled in fear and dread and said: Yes. God Almighty said: “Indeed, I am your Lord.” Moses' trembling increased and he said: Yes, Lord.. God Almighty said: “Then take off your sandals. Indeed, you are in the sacred valley of Tuwa” [Taha: 12]. So Moses took off his sandals, and God Almighty told him that he had chosen him to tell Pharaoh and his people that the only one worthy of worship is God, and that whoever worships a god other than Him will not be accepted from him and will be punished in the afterlife. He supported him with two miracles indicating that he was a true prophet, and God Almighty also commissioned him to release the Children of Israel from the prisons of Pharaoh.\n\nMoses, peace be upon him, continued on his way to Egypt, and prayed to God to open his heart and facilitate his affairs. Moses, peace be upon him, entered the palace and spoke to Pharaoh about worshiping God. Pharaoh said to him: You are a lying man, for I am the Most High Lord. So Moses threw his staff as God had taught him, and the staff turned into a huge, frightening snake. He extended his hand to it and it returned to being a staff. Then he took his hand out of his pocket and saw that it was white like the full moon. When he put it back into his pocket, its normal color returned. Pharaoh became angry and very angry, and said to him: You are a great magician, and I will prove it to you. Pharaoh ordered the magicians to gather in a large square and drop their ropes and sticks, which they moved lightly and skillfully, making them appear to those who saw them as if they were snakes walking on the ground. Moses was afraid, but he remembered that God was with him and would help him, so he threw his staff, and it turned into a huge snake that swallowed everything they had made!! He also showed them the miracle of the hand!!\n\nHere the magicians were surprised and said: We are magicians and we know magic well, and what Moses did is not magic at all. Then all the magicians believed in him and said to him: You are telling the truth, you are a prophet, and our Lord is your Lord whom you worship. Pharaoh's anger increased, and he started screaming and saying: I am your Lord, the Most High. How can you worship a god other than me? I will take revenge on you! I will cut off your hands and feet! I will crucify you on a log and kill you! But they loved faith and it entered their hearts, so they did not back down, nor were they afraid of it."
  },
  {
    "number": "قصة بقرة بنى إسرائيل ",
    "text": "",
    "label": "\nقال الله تعالى : ( وإذا قال موسى لقومه إن الله يأمركم أن تذبحوا بقرة قالوا أتتخذنا هزوا قال أعوذ بالله أن أكون من الجهلين ( 67 ) قالوا ادع لنا ربك يبن لنا ما هى قال أنه يقول إنها بقرة لا فارض ولا بكر عوان بين ذلك فافعلوا ما تؤمرون ( 68 ) قالوا ادع لنا ربك يبن لنا ما لونها قال إنه يقول إنها بقرة صفراء فاقع لونها تسر النظرين ( 69 ) قالوا ادع لنا ربك يبين لنا ما هى إن البقر تشبه علينا وإنا إن شاء الله لمهتدون ( 70 ) قال إنه يقول إنها بقرة لا ذلول تثير الأرض ولا تسقى الحرث مسلمة لا تشبه فيها قالوا الئن جئت بالحق فذبحوها وما كادوا يفعلون ( 71 ) وإذ قتلتم نفسا فادرءتم فيها والله مخرج ما كنتم تكتمون ( 72 ) فقلنا اضربوه ببعضها كذلك يحى الله الموتى ويريكم ايته لعلكم تعقلون ) .\n\nكان فى بنى إسرائيل شاب فقير فى كل شئ ... فى المال وفقير فى الأخلاق ليس عنده دين ولا أمانة . وكان له عم غنى كثير المال وكانت له ابنة جميلة جدا . فكان هذا الشاب يتمنى موت عمه فى أقرب وقت من أجل أن يرث المال الكثير ويتزوج ابنة عمه الجميلة . ولكن عنه عاش طويلا وكان فى غاية الصحة والعافية . فتجعل هذا الشاب موت عمه من أجل أن يستمتع بالمال . وأخذ هذا الشاب يدبر تلك المؤامرة الحقيرة لقتل عمه ... إلى أن استطاع فى ليلة من الليالى أن يقتل عمه ... وحتى لا يعرف الناس أنه هو الذى قتل عمه ، أخذ جثة عمه وألقاها أمام بيت أحد أقاربه وجلس يبكى على باب البيت وكأنه حزين على موته . فلما مر الناس عليه وجدوه يبكى ويتهم أهل هذا البيت بقتل عمه . فخرج أصحاب البيت وأقسموا أنهم لم يقتلوه . وضاع الحق بين الناس ولم يعرفوا من القاتل !!! وذهبوا إلى نبى الله موسى عليه السلام وأخبروه بخبر هذا الرجل المقتول . فقام وقال لهم : أسألكم بالله من الذى يعلم قاتل هذا الرجل ؟ ... فلم يرد أحد فقال له رجل منهم : يا بنى الله لماذا لا تسأل ربك حتى يخبرك بخبر القاتل . فسأل موسى ربه ( جل وعلا ) فأوحى إليه بأن يأمرهم أن يذبحوا بقرة . فتعجب الناس من ذلك وظنوا أن موسى عليه السلام يستهزئ بهم . فقال لهم موسى عليه السلام : ( قال أعوذ بالله أن أكون من الجهلين ) : أى أعوذ بالله أن أخبركم بشئ من أوامر الله فلقد أخبرتكم بما أمر الله .\n\nولقد كان يكفيهم أن يذبحوا أى بقرة ؛ لأن الله ( جل وعلا ) لم يحدد لهم أى مواصفات لتلك البقرة ولكن شددوا فشدد الله عليهم . فسألوا عن سنها فأخبرهم بأنها متوسطة العمر لا كبيرة ولا صغيرة وأمرهم أن ينفذوا أمر الله ( جل وعلا ) دون أى تأخير لكن بنى إسرائيل كانوا لا يطيعون الأوامر بل كانوا يتهربون ويتحايلون على تلك الأوام بأدنى الحيل حتى لا ينفذوها ... وكانوا يكثرون من الأسئلة بقصد التهرب من الأوامر وتضييع الوقت . فسألوا نبى الله موسى عليه السلام : ما لونها ؟ فأجابهم بأنها بقرة صفراء فاقع لونها – أى شديدة الصفرة – جميلة المنظر .. تسر من النظر إليها من شدة حسنها وبهائها . ثم شددوا أيضا : (قَالُوا ادْعُ لَنَا رَبَّكَ يُبَيِّنْ لَنَا مَا هِيَ إِنَّ الْبَقَرَ تَشَابَهَ عَلَيْنَا وَإِنَّا إِنْ شَاءَ اللَّهُ لَمُهْتَدُونَ (70) قَالَ إِنَّهُ يَقُولُ إِنَّهَا بَقَرَةٌ لَا ذَلُولٌ تُثِيرُ الْأَرْضَ وَلَا تَسْقِي الْحَرْثَ مُسَلَّمَةٌ لَا شِيَةَ فِيهَا) . فأخبرهم بأنها بقرة ليست مذللة أو معدة للحرث ولا لسقى الأرض بالساقية ... سالمة من العيوب ليس فيها أى لون يخالف لونها فهى صفراء خالصة الصفراء . فلما حددها بهذه الصفات : (قَالُوا الْآَنَ جِئْتَ بِالْحَقِّ فَذَبَحُوهَا وَمَا كَادُوا يَفْعَلُونَ 71) .\n\nأخذوا تلك المواصفات من موسى عليه السلام ، وراحوا يبحثون عن بقرة تتصف بها . بحثوا عن بنى إسرائيل ، فلم يجدوا إلا بقرة واحدة فقط تتصف بهذه الصفات ... كانت تلك البقرة لشاب يتيم فقير كان بارا بأبيه الذى مات ، وبارا بأمه التى ما زالت تعيش. فساومهم وبقى يساومهم ، ويرفع سعرها تدريجيا ، وهم يراجعونه ويساومونه ... رفع سعرها من مائة دينار ، إلى مائتين . ثم إلى أربعمائة . ثم ثمانمائة . ثم طلب منهم أن يضعوها فى الميزان ، وأن يدفعوا له ثمنها بما يساوى وزنها ذهبا ! فأضطروا إلى الموافقة لعدم وجود بقرة غيرها . ودفعوا للشاب ما طلبه ، فصار من كبار الأغنياء لبره بوالديه . أخذوا البقرة وذبحوها ، ثم أخذوا جزءا منها ، وضربوا بها جسد القتيل . فأحيا الله القتيل فنظر حوله فوجد أناسا كثيرين فسأله أحدهم : من الذى قتلك ؟ فقال : قتلنى ابن أخى طمعا فى ثروتى .. ثم مات القتيل مرة أخرى . فألقى القبض على القاتل وحرم من الميراث عقوبة له على جريمته ... ومنذ ذلك اليوم لم يورث قاتل من الميراث المقتول . قال الله تعالى : ( كذلك يحى الله الموتى ويريكم ايته لعلكم تعقلون73) . أى : كما شاهدتهم إحياء هذا القتيل عن أمر الله له ... كذلك أمره فى سائر الموتى ، إذا شاء إحياهم أحياهم فى ساعة واحدة .\n\nوعلى الرغم من إعجاب ودهشة بنى إسرائيل لما حصل من موسى عليه السلام فإنهم ظلوا على عنادهم وبقيت قلوبهم على قساوتها كأنها الحجارة أو أشد قسوة منها . ولقد لقى موسى عليه السلام من (( بنى إسرائيل )) – كما لقى غيره من أنبيائهم – كل عنت وعناد وصدود ، وما يزالون إلى اليوم يتصفون بالنفاق والغدر والمكر ، ويخالفون شريعة الله وأوامره التى أنزلها فى (( التوراة )) ؛ ولقد تجرؤوا على كتاب الله فغيروا وأخفوا كل دعوة فيه إلى الفضيلة والأخلاق !",
    "number-en": "The story of the cow of the children of Israel",
    "label-en": "God Almighty said: (And when Moses said to his people, “Indeed, God commands you to slaughter a cow.” They said, “Do you take us as a mockery?” He said, “I seek refuge in God lest I be among the ignorant.” (67) They said, “Call upon your Lord to explain for us what she is.” He said, “He says that she is a cow, neither mature nor young, indifferent.” So do as you are commanded. (68) They said, “Call upon your Lord to explain to us what color she is.” He said, “He says that she is a yellow cow, with a bright color.” (69) They said, “Call upon your Lord for us to make clear to us what she is. Indeed, cows resemble us, and we, God willing, will be guided.” (70) He said, “He says that she is a cow, neither tamed to plow the earth nor to irrigate the field, submissive, with no resemblance to her.” They said: If you bring the truth, they slaughtered it, but they were not nearly able to do it. (71) And when you killed a soul and then rebuked therein, and God will bring forth what you were concealing. (72) Then We said, “Strike him with some of it.” Thus God revives the dead and shows you His signs that you may understand.\n\nThere was a young man among the children of Israel who was poor in everything...in money and poor in morals. He had no religion or trustworthiness. He had a rich uncle who had a lot of money and had a very beautiful daughter. This young man wished for his uncle to die as soon as possible so that he could inherit a lot of money and marry his cousin’s beautiful daughter. But he lived a long time and was in very good health. So this young man makes his uncle's death in order for him to enjoy the money. This young man began to plot this despicable plot to kill his uncle... until one night he was able to kill his uncle... and so that people would not know that he was the one who killed his uncle, he took his uncle’s body and threw it in front of one of his relatives’ house and sat crying at the door of the house as if he was sad about his death. When people passed by him, they found him crying and accusing the people of this house of killing his uncle. The owners of the house came out and swore that they had not killed him. The truth was lost among the people and they did not know who the killer was!!! They went to the Prophet of God, Moses, peace be upon him, and told him the news of this murdered man. So he stood up and said to them: I ask you by God, who knows who killed this man? ...No one responded, and one of them said to him: O children of God, why do you not ask your Lord until he tells you the news of the killer? So Moses asked his Lord (Glory be to Him) and He inspired him to command them to slaughter a cow. The people were amazed at this and thought that Moses, peace be upon him, was mocking them. Moses, peace be upon him, said to them: (He said, “I seek refuge in God lest I be among the ignorant”): That is, I seek refuge in God to tell you something of God’s commands, for I have told you what God has commanded.\n\nIt was enough for them to slaughter any cow. Because God (Glory be to Him) did not specify for them any specifications for that cow, but they were strict, so God made them strict. So they asked about her age, so he told them that she was middle-aged, neither old nor young, and he ordered them to carry out the command of God (Almighty and Majestic) without any delay, but the children of Israel were not obeying the orders, but rather they were evading and circumventing those orders with the slightest tricks so as not to carry them out... They asked a lot of questions with the intention of evading orders and wasting time. So they asked the Prophet of God, Moses, peace be upon him: What color is it? He replied to them that it was a bright yellow cow - that is, very yellow - beautiful in appearance. It was pleasing to look at due to the intensity of its beauty and splendor. Then they also stressed: (They said, “Call upon your Lord for us to explain to us what they are. Indeed, cows have become equal to us, and indeed, if God wills, we will be guided.” (70) He said that he says that they are A cow neither tamed to plow the earth nor to irrigate the field, free from blemish, without blemish on her.) . So he told them that she is a cow that is not humiliated or prepared for plowing or for irrigating the earth with a waterwheel... It is free of defects and does not have any color that is different from its color, so it is pure yellow. When he specified it with these characteristics: (They said, “Now you have brought the truth.” So they slaughtered it, but they were hardly able to do so. 71)\n\nThey took these characteristics from Moses, peace be upon him, and began searching for a cow that would be characterized by them. They searched for the children of Israel, but they found only one cow that had these qualities... That cow belonged to a poor orphan young man who was kind to his father, who had died, and he was kind to his mother, who was still living. So he bargained with them and continued to bargain with them, gradually raising its price, while they reviewed it and bargained with him... He raised its price from one hundred dinars, to two hundred. Then to four hundred. Then eight hundred. Then he asked them to put it on the scale and pay him its price equal to its weight in gold! They were forced to agree because there was no other cow. They paid the young man what he asked for, and he became one of the richest people out of respect for his parents. They took the cow and slaughtered it, then took part of it and hit the dead man's body with it. So God revived the dead man, and he looked around and found many people. One of them asked him: Who killed you? He said: My nephew killed me out of greed for my wealth... Then the dead man died again. So the murderer was arrested and deprived of the inheritance as a punishment for his crime... Since that day, no murderer has inherited from the murdered person’s inheritance. God Almighty said: (Thus does God give life to the dead and show you His signs that you may understand.73) That is: as I witnessed them resurrecting this dead man according to God’s command for him... This is His command regarding all the dead: if He wishes to revive them, He revives them in one hour.\n\nDespite the children of Israel’s admiration and astonishment at what happened to Moses, peace be upon him, they remained stubborn and their hearts remained as hard as stones, or even harder than stones. Moses, peace be upon him, faced the children of Israel - as did other of their prophets - with all stubbornness, obstinacy, and stubbornness, and to this day they are still characterized by hypocrisy, treachery, and deception, and they violate the law of God and His commands that He revealed in the Torah. They dared to criticize the Book of God, changing and concealing every call to virtue and morals in it!"
  },
  {
    "number": "قصة كلب أصحاب الكهف ",
    "text": "",
    "label": "\nقال الله تعالى : سَيَقُولُونَ ثَلَاثَةٌ رَّابِعُهُمْ كَلْبُهُمْ وَيَقُولُونَ خَمْسَةٌ سَادِسُهُمْ كَلْبُهُمْ رَجْمًا بِالْغَيْبِ ۖ وَيَقُولُونَ سَبْعَةٌ وَثَامِنُهُمْ كَلْبُهُمْ ۚ قُل رَّبِّي أَعْلَمُ بِعِدَّتِهِم مَّا يَعْلَمُهُمْ إِلَّا قَلِيلٌ ۗ فَلَا تُمَارِ فِيهِمْ إِلَّا مِرَاءً ظَاهِرًا وَلَا تَسْتَفْتِ فِيهِم مِّنْهُمْ أَحَدًا (22)\n\nبعد ليل طويل أشرقت الشمس من جديد ليبدأ يوم جديد في حياة أهل الكهف تلك المدينه التي تسمي (أفسوس) وبدأت الكائنات تستيقظ من نومها وسباتها وأخذ ت الطيور تنتقل بين الاغصان بأصواتها البديعة وبدأت أنفاس الحياة تدب علي الأرض وراح الكون كله يسبح بحمد الله (عز وجل) إلا أهل هذه المدينة ال ين كانو يكفرون بالله عز وجل فقد كان أهل هذه المدينة يكفرون بالله ويعبدون الأصنام ولأوثان ويسجدون لها من دون الله (جل وعلا) على الرغم من تلك النعم العظيمة التى أسبغها الله عليهم وتلك الحضارة التي وصلوا إليها ومع لك فقد تركو عبادة الله عزوجل وذهبوا يسجدون لأحجار لا تنفع ولاتضر\n\nوكان حاكم هذه المدينة رجلآ ظالمآ وكافرآ اسمه (دقيانوس) فقد كان يأمر الناس بعبادة الأصنام وبأن يذبحوا ويقدمو القرابين لتلك الأصنام وكان إذ رأى أحدآ يعبد الله (جل وعلا) ولا يعبد الأصنام يعذبه عزاباً شديداً لدرجة أنة كان إزا رأى رجلاً مؤمناً كات يضعه في السجن ويطلق عليه أسداً جائعا ليأكله وفى يوم من الأيام خرج أهل هذه المدينة إلي عيد من أعيادهم فخرجو هؤلاء الفتية معهم ونظروا إلى قومهم وهم يسجدون ويذبحون للأصنام فألقى الله نور الإيمان في قلوب هؤلاء الشباب وكانوا سادة القوم فتركو قومهم في هذا العيد واعتزلوهم فذهب أول واحد منهم وجلس بعيداً تحت ظل شجرة ثم أتي إليه الثاني فالثالث إلي أن اجتمع السبعة وكان كل واحد منهم يكتم إيمانه خوفآ من أصحابه حتى لا يخبر احدهم الملك الظالم فيجعله طعامآ للأسد وفجأة قام واحدً منهم وقال تعلمون والله ما أخرجكم من قومكم على هذا المكان إلا شئ في صدوركم فتعالو نتصارح فيما بيننا\n\nثم قال اما أنا فإننى أري ان قومنا على الباطل فهم يصنعون تلك التماثيل بأيديهم ثم يسجدون لها من دون الله وهى التى لا تسمع ولا تبصر ولا تنفع ولا تضرفكيف يسجدون لتلك الأصنام ولا يسجدون لله الذي خلق السماوات والأرض ورفع السماء بغير عمد فجعل فيها الشمس والقمر وزينها بالنجوم فقال الثانى صدقت ياأخي فلقد خطر ببالي كل ذلك وقلت في نفس أليس الله (جل وعلا) الذي خلق البحار والأنهار والجبال والأشجار وأنعم علينا بكل هذه النعم هو الذي يستحق أن نعبده وحده وقال الثالث صدقتما كيف نعبد أصناماً من دون الله الذي خلق الكائنات كلها وأبدع خلقها وسخر الكون كله لنا ثم نعبد غيره لايكون أبدآ وتكلم الباقون مثل كلامهم ثم قالوا جميعاً ( رَبُّنَا رَبُّ السَّمَوَاتِ وَالْأَرْضِ لَنْ نَدْعُوَاْ مِنْ دُونِهِ إِلَهًا لَقَدْ قُلْنَا إِذًا شَطَطًا)\n\nفتصارحوا وأعلنوا إيمانهم فيما بينهم وصاروا يداً واحدة وأصبحوا إخواناً متحابين في الله (جل وعلا) واتخذوا لأنفسهم معبداً يعبدون الله فيه بعيداً عن قومهم وظل كل واحد يخوض فيما يخوض فيه القوم ويضطرب فيما يضطرب فيه الناس حتى إذا ما خلا بنفسه واجتمع مع قلبه اتجه إلى الله عابداً مصلياً ومنزهاً ومقدساً ولكن بعد فترة يسيرة عرف قومهم أنهم آمنوا بالله (جل وعلا) فأخبروا هذا الملك الظالم. فلما علم الملك بإيمان هؤلاء الشباب أرسل إليهم فجاءوا إليه وهم يخشون أن يفعل بهم كما فعل بمن سبقهم للإيمان بأن جعلهم طعاماً للأسود ولكن الله ثبتهم وربط على قلوبهم فقالوا كلمه الحق أمام هذا الحاكم الظالم ودعوه إلى الله (جل وعلا)\n\nفتعالو بنا لنري ماذا صنع معهم هذا الملك الظالم الذي يعبد الأصنام من دون الله (جلا وعلا) قال لهم الملك لقد علمت أنكم صبأتم وتركتم دين الأباء ولأجداد ودخلتم في دين أخر ولو كنتم من عامة الشعب لتركتكم وشأنكم ولكنكم من أشرف القوم ولو علم الناس بدينكم لتبعوكم ودخلوا في دينكم وفي ذلك إفساد لتلك المملكة وضياع لملكي واعلموا أني لن أتعجل في عذابكم بل سأترككم لتفكروا في شأنكم وتراجعوا أنفسكم فإما أن ترجعوا إلى ديننا وإما أن أمزق أجسادكم إلي أشلاء لتكونوا عبره للناس من حولكم فربط الله علي قلوبهم وثبتهم فقالوا أيها الملك إن هذا الدين لم ندخل فية مقلدين ولامكرهين بل دعتنا إليه الفطرة السليمة التى جعلها الله فى قلوبنا ولن نعد إلا الله الذى خلق السموات ةالأرض وأسبغ علينا نعمه ظاهرة وباطنة وأما قومنا فقد عبدوا تلك الأصنام تقليداً للأباء من غير حجة ولا برهان وإناندعوك أيها الملك إلي عبادة الله الواحد القهار ليجمع الله لك الله سعاده الدنيا ولآخرة فإن كنت لا تريد فإن عذاب الدنيا أهون من عذاب الاخرة فغضب عليهم الملك وأمر بنزع لباس الزينة عنهم الذي كان عليهم من زينة قومهم وهددهم إن لم يعودوا إلى دين قومهم ثم أجلهم لينظروا في امرهم لعلهم يرجعون وكان هذا من لطف الله بهم لأنهم توصلوا بهذا التأجيل إلى الهرب والفرار بدينهم من الفتنة .\n\nفكر أولئك الفتية المؤمنون في الخطوة التالية فوجدوها فى العزلة فقرروا اعتزال قومهم إنهم مؤمنون وقومهم كافرون ولامجال لآن يعيشوا معهم خرجوا من المدينة غلي الجبال وقرروا أن يأوا إلى كهف فى جبل وكان معهم نقود قد نقش عليها اسم هذا الملك الظالم الذى هدهم بالقتل إن لم يرجعوا عن دينهم ودخلوا الكهف ولم يدخل معم الكلب لأنه نجس وقد يلمس ثيابهم أو أبدنهم فينجسها فقرورا أن يجعلوه حارساً على باب الكهف فيحرسهم من اللصوص ومن اتباع الملك وجنوده إذا جاؤوا بحثاً عنهم وليدافع عنهم إذا جائتهم حية أو ثعبان أو اسد او غير ذلك وهم يعلمون أن الكلب يضرب بة المثل فى الوفاء فهو لا يتخلى أبداً عن خدمة صاحبه وحراسته والدفاع عنه حتى لو كانت حياته فداء لصاحبه أما هؤ لاء الشباب المؤمنون فقد دخلوا الكهف وقالو( رَبَّنَا آَتِنَا مِنْ لَدُنْكَ رَحْمَةً وَهَيِّئْ لَنَا مِنْ أَمْرِنَا رَشَدًا )\n\nوكانت الرحلة من (أفسوس)إلى الكهف طويلة فشعروا بالتعب الشديد وناموا على الأرض لينلوا قسطاً من الراحة بعد رحلة الفرار إلى الله (جل وعلا) وطلبوا من الله ان ينشر عليهم فى الكهف من رحمته واستجاب الله لهم فكانت رحمة الله عليهم فى الكهف حيث يسرالله لهم الأمر وسخرلهم الأيات فأمر الشمس أن لاتمس أجسادهم حتى لا تؤذيها كانت عند الصباح تميل عن أجسادهم فلاتقع عليهم وكانت عند الغروب تميل عنها كذالك فلا تأتيها وكانوا فى فجوة وسط الكهف ومعنى هذا أن الشمس كانت تدخل الكهف فتقضى على الجراثيم والميكروبات وتغير ذلك الهواء حتى لا يفسد ولاتتسلط أشعتها عليهم مباشرة حتى لا تحترق أجسادهم ولا ملابسهم وإنما ينتفعون بحرارتها وأشعتها ودفئهادون اى ضرر ومن أيات الله عليهم فى الكهف أن عيونهم كانت مفتوحة فكان من ينظر إليهم يحسبهم أيقاظاً ينظرون إليه مع أنهم نيام راقدون\n\nوحتى لا تأكل الأرض أجسادهم كان الله يقلبهم مرة على اليمين ومر على اليسار وكان معهم كلبهم الذى صحبهم حيث جلس على عتبة باب الكهف وبسط ذراعيه ونام مثل نومتهم وحتى لا يعتدى عليهم أحد وهم رقود قذف الله فى قلب كل من ينظر إليهم الرعب بحيث لو اطلع عليهم لولى منهم فرارا ولملئ منهم رعبآ قال تعالى (وَتَحْسَبُهُمْ أَيْقَاظًا وَهُمْ رُقُودٌ وَنُقَلِّبُهُمْ ذَاتَ الْيَمِينِ وَذَاتَ الشِّمَالِ وَكَلْبُهُمْ بَاسِطٌ ذِرَاعَيْهِ بِالْوَصِيدِ لَوِ اطَّلَعْتَ عَلَيْهِمْ لَوَلَّيْتَ مِنْهُمْ فِرَارًا وَلَمُلِئْتَ مِنْهُمْ رُعْبًا ) وكان الفتيه قد ناموا تلك السنوات الطويلة دون طعام ولا شراب ومع ذلك لم يموتوا ولم يشعر أحد منهم بجوع أو عطش وكل ذلك بقدره الله (جل وعلا.\n\nوتعاقبت الأيام ومضت الأعوام وبعد هذا الزمان الطويل بعثهم الله عزوجل من نومهم وقد تغيركل شئ فى هذا الكون لقد بعثهم الله من نومهم فقاموا من نومهم وهم يشعرون بتعب شديد فى أجسادهم وأخذوا يتسألون فيما بينهم عن المدة التى أقاموها فى الكهف قال تعالى (قَالَ قَائِلٌ مِنْهُمْ كَمْ لَبِثْتُمْ قَالُوا لَبِثْنَا يَوْمًا أَوْ بَعْضَ يَوْمٍ قَالُوا رَبُّكُمْ أَعْلَمُ بِمَا لَبِثْتُمْ) ظانين أن الزمن لم يمض بهم وأن عجلة التاريخ واقفة عند كهفهم قال واحد :منهم يسأل يخيل إلى أن ساعات طويلة رقدنها فما تظنون يا رفاق قال الثاني:ربما نكون قد لبثنا يوماً فإن هذا الجوع الذى نحسه والتعب الذى نشعر به ليؤذن بما أذن وقال الثالث: نحن قد رقدنا فى الصباح وهذه الشمس لم تغرب فما أظن إلا أننا قد لبثنا بعضاّ من من يوم وقال الرابع: دعونا من تساؤلكم فالله أعلم بما لبثتم ولكننى أحس جوعاً شديداً وكأنى لم أطعم منذ ليال فليذهب واحد منكم إلى المدينة يلتنس لنا طعاماّ ولكن عليه أن يكون حذراً حتى لا يعرفه أحد فإنهم لو عرفوه وعرفوا مكننا فسوف يقتلوننا أو يفتنونا عن ديننا\n\n(فَابْعَثُوا أَحَدَكُمْ بِوَرِقِكُمْ هَذِهِ إِلَى الْمَدِينَةِ فَلْيَنْظُرْ أَيُّهَا أَزْكَى طَعَامًا فَلْيَأْتِكُمْ بِرِزْقٍ مِنْهُ وَلْيَتَلَطَّفْ وَلَا يُشْعِرَنَّ بِكُمْ أَحَدًا (19) إِنَّهُمْ إِنْ يَظْهَرُوا عَلَيْكُمْ يَرْجُمُوكُمْ أَوْ يُعِيدُوكُمْ فِي مِلَّتِهِمْ وَلَنْ تُفْلِحُوا إِذًا أَبَدًا ) فخرج واحد منهم باحثاً عن الطعام وفى يديه تلك العملات الفضية التى نقش عليها صورة ذلك الملك الظالم الذى كان يعيش فى تلك المدينة ويحكمها منذ أكثر من ثلاثمائة عام فلما مشى فى طرقات المدينة وجد أن المدينة قد تغيرت معالمها كلها فالناس ليسوا هم الناس والطرقات ليست هى الطرقات التى يعرفها والبيوت غير البيوت هذه خرائب أصبحت قصوراً وتلك قصور أمست خرائب وأطلالاً وتلك وجوه لم يعرفها وصور لم يألفها أما الديار فإنها كديارهم ورأى رجال الحى غير رجاله أخذ يفكر فى نفسه هل ذهبنا إلى بلاد أخرى ونحن نأئمون أم دارت الأرض من تحتنا ونحن لا نشعر تحيرت نظراته وكثرت لفتاته وظهر عليه الاضطراب والحيرة حتى بدأ الناس ينظرون إليه فى دهشة واستغراب.\n\nقال له أحدهم : أغريب أنت عن هذه البلد ؟ وفيم تتأمل ؟ وعلام تبحث؟ قال: لست غريباً ولكننى أبحث عن طعام أشتريه فلا أرى مكان بيعه وأخذ الرجل بيده حتى انتهى به إلى مطعم وطلب من البائع طعاماً فنظر إليه البائع متعجباً لمنظره فلما جهز له الطعام وطلب منه ثمن الطعام أعطاه الشاب تلك النقود التى كان عليها صورة دقيانوس :فتعجب البائع وقال له من أين لك هذا المال؟ فقال الشاب: إنه المال الذى نتعامل به وهذة صورة دقيانوس فقال البائع: هل أنت مجنون إن دقيانوس –عليه لعنة الله- مات منذ أكثر من ثلاثمائة سنة فتعجب الشاب وهو يسمع هذا الكلام وأحس بأن الدماء الدماء قد تجمدت فى عرقه فتجمع الناس حول هذا الشاب وبدأ الناس يسألونه: هل عثرت على كنز أيها الفتى؟ إنها عملة قديمة قد مر عليها أكثر من ثلاثمائة سنة أحس الشاب بأن الدماء قد توقفت فى عروقه وقال لهم:يا قوم ليس الأمر كما تظنون وليست هذه النقود كنزاّ حصلت عليه وإنما هى نقود أخذتها من والدى أمس اريد أن أشترى بها طعاماً اليوم فما الذى يدعوكم إلى الدهشة؟\n\nثم هم بالعودة خشية أن يفضح أمره أو تظهر حقيقة حاله ولكنهم عادوا فرافقو به وتلطفو ا معه ف القول وحاوروه فى الحديث وما كان أشد ذهولهم حينما علموا أنه أحد الفتية الأشراف الذين هرابو من ثلاثمائة وتسع سنة من ملكهم الجائر الكافر وأنهم هم الذين طلبهم الملك فلم يظفر بهم ونشدهم فلم يهتد إليهم وما كان أشد خوف الشاب حينما علم أنهم فطنوا لأمره وعرفوا قصته فخاف على نفسه وإخوته وهم بالهروب قال لهم أحدهم:لا تخف يا هذا إن الملك الذى تخافه قد مات من نحو ثلاثمائة عام وإن الملك الذي يجلس الأن مؤمن بالله كما تؤمنون وأخذوه غلى ملكهم فساله عن شأنه فأخبره بأمره وهو متحير فى حاله وما هو فيه فقام ملك البلد وأهلها حتى أنتهى بهم إلى الكهف فقال لهم: دعونى أتقدمكم فى الدخول لأعلم أصحابى فدخل فيقال: إنهم لا يدرون كيف ذهب فيه وأخفى الله خبرهم ويقال:بل دخلوا عليهم ورأوهم وسلم عليهم الملك واعتنقهم وكان مسلماً فيما قيل ففرحوا به أنسوه بالكلام ثم ودعوه وسلموا عليه وعادوا إلى مضاجعهم وتوفاهم الله عز وجل فاختلفوا فيهم وتنازعوا بينهم أمرهم ماذا يفعلون بهم؟فمنهم من قال:ابنوا عليهم بنياناً ربهم أعلم بهم ولكن الحاكمين فيهم قرروا أن يبنوا عليهم مسجداً وهكذا كان حيث تم بناء المسجد عليهم وهذا خطً كبير لأن النبى صلى الله عليه وسلم نهى عن اتخاذ القبور مساجد يصلى فيها إلا أن أعظم الدروس فيى هذة القصة الجميلة أن ذلك الكلب الذى أحب هؤلاء الشباب المؤمن وصحبهم قد سعد بصحبتهم حتى ذكره الله عز وجل فى كتابه . فإن كان ذلك الكلب قد سعد بصحة أهل الإيمان ألا يحرص أحدنا على صحبة أهل الإيمان والتوحيد ليسعد فى الدنيا والأخرة",
    "number-en": "The story of the dog of the cave owners",
    "label-en": "God Almighty said: They will say: There are three, the fourth of them is their dog, and they will say: There are five, the sixth of them is their dog, stoning unseen. And they will say: Seven and the eighth of them. (22) After a long night, the sun rose again to begin a new day in the life of the people of the cave, that city called (Ephesus). The creatures began to wake up from their sleep and slumber, and the birds began to move between the branches with their wonderful voices, and the breath of life began to spread on the earth, and the entire universe began to praise God (Almighty and Majestic), except for the people of this city who disbelieved in God Almighty. The people of this city disbelieved in God and worshiped idols and idols. And they prostrate to it instead of God (Glory be to Him) despite the great blessings that God bestowed on them and the civilization they have reached, and with you, He has abandoned And worshiping God Almighty, they went and prostrated to stones that were neither beneficial nor harmful\n\nThe ruler of this city was an unjust and infidel man named (Deqianus). He used to order people to worship idols and to sacrifice and offer sacrifices to those idols. When he saw someone worshiping God (Glory be to Him) and not worshiping idols, he would torture him celibately so severely that if he saw a believing man, he would put him in prison and release him into a hungry lion to eat him. One day, the people of this city went out to one of their holidays, so they went out. The young men were with them and they looked at their people as they prostrated and sacrificed to idols, so God cast the light of faith into his hearts. These young men were the masters of the people, so they left their people on this holiday and separated from them. The first one of them went and sat far away under the shade of a tree, then the second came to him, then the third, until the seven gathered, and each one of them concealed his faith for fear of his companions so that none of them would tell the unjust king and make him food for the lion. Suddenly one of them got up and said, “You know, by God, nothing brought you out of your people to this place except something in your chests, so come and let us be frank among ourselves.” Then he said, “As for me, I see that our people are upon falsehood. They make those statues with their own hands and then prostrate to them instead of God, and they are the ones that do not hear, see, do not benefit, or do anything. How can they prostrate to those idols and not prostrate to God, who created the heavens and the earth and raised the sky without pillars and placed in it the sun and the moon and decorated it with stars. The second said, “You have spoken the truth, my brother.” All of that came to my mind and I said to myself, “Is it not God (Glory be to Him) who created?” The seas, rivers, mountains, and trees, and He bestowed upon us all these blessings. He is the One who deserves that we worship Him alone. The third said, “You are right. How can we worship idols other than God, who created God?” To all beings, and He created their creation, and He subjected the entire universe to us, then we worship someone other than Him that will never exist, and the rest of them spoke like their words, then they all said (Our Lord is the Lord of the heavens and the earth. We will never call upon a god besides Him. Indeed, we said it in error.)\n\nSo they became frank and declared their faith among themselves, and they became one hand and became brothers loving each other for the sake of God (may He be glorified and exalted) and they took for themselves a temple in which they worshiped God far away from their people, and each one continued to engage in what the people were delving into and was troubled by what the people were troubled by, until when he was alone with himself and united with his heart, he turned to God as a worshiper and prayer. It was pure and holy, but after a short period their people knew that they believed in God (Glory be to Him), so they informed this unjust king. When the king learned of the faith of these young men, he sent for them, and they came to him, fearing that he would do to them what he had done to those who had come before them in the faith by making them food for the lions, but God strengthened them and tied their hearts, so they spoke to him of the truth before this unjust ruler and called him to God (Glory be to Him). So come with us and let us see what this unjust king who worships idols instead of God (Glory be to Him) has done to them. The king said to them, “I know that you have grown up and abandoned the religion of your fathers and grandfathers and entered into another religion. If you were among the common people, I would have left you alone, but you are among the most honorable people. If the people knew of your religion, they would follow you and enter into your religion, and that would be corruption of that kingdom and loss of my kingdom. And know that I will not hasten your punishment, but rather I will leave you to think about it.” Your business and withdraw from yourselves. Either you return to our religion, or I will tear your bodies into pieces so that you may be an example for the people around you. So God strengthened their hearts and strengthened them, so he said. Oh, O King, we did not enter into this religion as imitators or under compulsion, but rather the common sense that God placed in our hearts called us to it. We will no longer be considered anyone but God, who created the heavens and the earth and bestowed upon us His blessings, apparent and hidden. As for our people, they worshiped those idols in imitation of the forefathers without proof or proof. And we call upon you, O King, to worship the One and Subdued God, so that God may gather for you the happiness of this world and the hereafter. If you do not want, then the torment of this world is easier. From the torment of the afterlife, the king became angry with them and ordered the removal of the ornamental clothing that was on them from the adornment of their people, and threatened them if they did not return to the religion of their people. He gave them a deadline to look into their matter, perhaps they might return, and this was God’s kindness to them, because by this postponement they achieved escape and escape with their religion from temptation.\n\nThose young believers thought about the next step and found it in isolation, so they decided to isolate themselves from their people. They are believers and their people are unbelievers, and there is no room for them to live with them. They left the city and climbed the mountains and decided to go to a cave in a mountain. They had with them money on which was engraved the name of this unjust king, who threatened to kill them if they did not return from their religion and entered the cave. The dog’s jaw did not enter because it was unclean, and it might touch their clothes or their body and make it unclean. To make it hot He walked to the door of the cave, guarding them from thieves and from the king’s followers and soldiers if they came looking for them, and to defend them if a snake, snake, lion, or anything else came upon them. They knew that the dog was a proverb for loyalty, as it never gave up serving its owner, guarding him, and defending him, even if his life was a sacrifice for his owner. As for these young believers, they entered the cave and said, “Our Lord, give us You have mercy, and prepare for us guidance in our affairs.) The journey from (Ephesus) to the cave was long, so they felt very tired and slept on the ground to get some rest after the journey of fleeing to God (Almighty and Majestic). They asked God to spread His mercy upon them in the cave, and God responded to them, so God’s mercy was upon them in the cave, where God made the matter easy for them and subjected them to signs. He commanded the sun not to touch their bodies so as not to harm them. In the morning, it tilted away from their bodies so it did not fall on them, and at sunset it tilted away from them so it did not reach them. They were in a gap in the middle of the cave, and this means that the sun was entering the cave and eliminating germs and microbes and changing that Air so that it does not spoil, and its rays do not shine directly on them so that their bodies and clothes do not burn, but rather they benefit from its heat, rays, and warmth without any harm. Among the signs of God upon them in the cave is that their eyes were open, so whoever looked at them thought they were awake, looking at Him even though they were asleep.\n\nAnd so that the earth would not devour their bodies, God used to turn them once to the right and then to the left. They had with them their dog who accompanied them, as he sat on the doorstep of the cave, spread out his arms, and slept like theirs, and so that no one would attack them while they were lying. God cast terror into the hearts of everyone who looked at them, so much so that if he saw them, he would turn away from him. They fled and were filled with terror. God Almighty said, “And you would think that they had awakened while they were asleep, and We would turn them over to the right and to the left, while their dog was spread out and spread out its arms in the battle. If you had seen them, you would have fled from them and would have been filled with terror from them.) And the young men had slept for those long years without food or drink, and yet they did not die, and none of them felt hungry or thirsty, and all of that was by God’s power (Almighty and Majestic). Days passed and years passed, and after this long period of time, God Almighty resurrected them from their sleep, and everything in this universe had changed. God resurrected them from their sleep, and they arose from their sleep feeling extremely tired in their bodies, and they began to ask among themselves how long they had stayed in the cave. God Almighty said, “Someone among them said, ‘How long did you tarry?’ They said, ‘We tarried a day.’” Or part of a day. They said, “Your Lord knows best how long you have remained,” thinking that time had not passed by for them and that the wheel of history was standing at their cave. One of them said: “One of them asks. It seems that they spent many hours asleep. So what do you think, O Rafa?” The second said: We may have stayed for a day, for this hunger that we feel and the fatigue that we feel announces what was announced. The third said: We have fallen asleep in the morning and the sun has not set, so I only think that we have stayed for part of a day. The fourth said: Leave your questioning, for God knows how long you have stayed, but I feel extreme hunger as if I have not eaten for several nights. So one of you should go to the city and prepare food for us, but it must be. Be careful so that no one knows him, because if they knew him and our position, they would kill us or tempt us from our religion. (So send one of you with this paper of yours to Medina, and let him see which of it has the purest food, and let him bring you provision from it, and let him be kind, and not (19) Indeed, if they defeat you, they will stone you or return you to their religion, and you will never prosper then.) So one of them went out looking for food, and in his hands were those silver coins that were engraved. On it is a picture of that unjust king who lived in that city and ruled it for more than three hundred years. When he walked in the streets of the city, he found that the A city whose features have all changed. The people are not the people, the roads are not the roads he knows, and the houses are not the houses. These are ruins that have become palaces, and those palaces have become ruins and ruins. These are faces he did not know and images he was not familiar with. As for the homes, they are like their homes. He saw men in the neighborhood other than his own. He began to think to himself: Have we gone to another country while we were sleeping, or has the earth rotated beneath us while we were not aware? His looks were puzzled and his gestures increased, and he appeared disturbed and bewildered until the people began to look. To him in astonishment and astonishment. One of them said to him: Are you a stranger to this country? What do you meditate on? What are you looking for? He said: I am not a stranger, but I am looking for food to buy, but I do not see where it is sold. The man took his hand until he ended up at a restaurant and asked the seller for food. The seller looked at him in amazement at his appearance. When he prepared the food for him and asked him for the price of the food, the young man gave him that money that had a picture of Daqianus on it. The seller was amazed and said to him, “Where did you get this money from?” The young man said: It is the money we deal with, and this is a picture of Daqianus. The seller said: Are you crazy? Daqianus - may God’s curse be upon him - died more than three hundred years ago. The young man was amazed as he heard these words and felt that the blood had frozen in his sweat. People gathered around this young man and people began to ask him: Did you find a treasure, boy? It is an old coin that has been around for more than three hundred years. The young man felt that the blood had stopped in his veins and said to them: O people, the matter is not as you think, and this money is not a treasure that I obtained. Rather, it is money that I took from my father yesterday with which I want to buy food today. So what makes you surprised?\n\nThen they decided to return for fear that his matter would be exposed or the truth about his situation would become apparent, but they returned, so they accompanied him and spoke kindly to him and talked to him in conversation. And what was their greatest astonishment was when they learned that he was one of the noble young men who had fled for three hundred and nine years from their unjust and infidel king, and that they were the ones the king had wanted. He did not prevail over them and appealed to them, but he was not guided to them. And what was the greatest fear of the young man when he learned that they had become aware of his matter and knew his story. He feared for himself and his brothers while they were escaping. One of them said to them: Do not be afraid, this king whom you fear has been dead for about three hundred years, and the king who is sitting now believes in God as you believe. They took him to their king and asked him about his condition, so he informed him of his situation while he was confused about his condition and what he is in. So the king of the country and its people stood up until He led them to the cave and said to them: Let me enter before you so that I may inform my companions. So he entered, and it is said: They do not know how he went into it, and God concealed their news. It is said: Rather, they entered upon them and saw them. The king greeted them and embraced them, and he was a Muslim in what was said, so they were happy with him and they made him forget the words, then they said goodbye to him and greeted him and returned to their beds, and God Almighty took them away. They disagreed about them and disputed among themselves. What should they do with them? Among them were those who said: Build a building over them, their Lord knows best about them, but the rulers among them decided to build a mosque over them, and so it was as the mosque was built over them. This is a big mistake because the Prophet, may God bless him and grant him peace, forbade Taking graves as mosques in which one prays. However, the greatest lesson in this beautiful story is that the dog who loved these young believers and kept them company was happy with their company until... God Almighty mentioned him in his book. If that dog was happy with the health of the people of faith, wouldn’t any of us be keen on the company of the people of faith and monotheism to be happy in this world and the hereafter?"
  },
  {
    "number": "قصة النملة مع سليمان عليه السلام ",
    "text": "",
    "label": "\nقال الله تعالى : حَتَّىٰ إِذَا أَتَوْا عَلَىٰ وَادِ النَّمْلِ قَالَتْ نَمْلَةٌ يَا أَيُّهَا النَّمْلُ ادْخُلُوا مَسَاكِنَكُمْ لَا يَحْطِمَنَّكُمْ سُلَيْمَانُ وَجُنُودُهُ وَهُمْ لَا يَشْعُرُونَ.\n\nكان فى سالف الزمان نبى كريم أسمه سليمان بن داود عليه السلام وقف هذا النبى الكريم يوما ودعاه دعوه لم يدع بها نبى من قبله ولا بعده . وقف وقال : ( رب آغفر لى وهب لى ملكا لاينبغى لأحد من بعدى إنك أنت الوهاب ( 35 ) ) . فأعطاه الله ملكا لم يعطه لأحد من البشر وسخر له أشياء لم يسخرها لأحد من البشر . لقد علمه الله لغة الطيور والحيوانات وأعطاه من كل شئ .. وهو الذى اعترف بذلك فقال عليه السلام : ( يايها الناس علمنا منطق الطير وأوتينا من كل شئ ( 16 ) ) . أى من كل ما يحتاج الملك إليه من العدد والآلات والوجنود والجيوش والجماعات من الجن والأنس والطيور والوحوش والشاطين . وقد كان نبى الله سليمان عليه السلام عظيم الحكمة ، ولذلك يسميه أهل الكتاب (( سليملن الحكيم )) ولا يقلبونه بالنبى أصلا . قال مجاهد : ملك الدنيا أربعة : مؤمنان وكافران ، فأما المؤمنان : فسليمان بن داود وذو القرنين ، وأما الكافران : فالنمرود بن كنعان ، وبختصر .\n\nبل إن الله عز وجل سخر له الريح تحمله من بلد إلى بلد آخر فى لمح البصر .. بل وتطيعه إذا أمرها . قال تعالى : ( ولسليمان الريح عاصفة تجرى بأمره إلى الأرض التى بركنا فيها ( 81 ) ) . وقال تعالى : ( ولسليمان الريح غدوها شهر ورواحها شهر ( 12 ) ) . لما ترك الخيل بتغاء وجه الله عوضه الله منها الريح التى هى أسرع سيرا وأقوى وأعظم ولا كلفة عليه لها قال تعالى : ( تجرى بأمره رخاء حيث أصاب ) ( 36 )) . أى : حيث أراد من أى البلاد ... كان له بساط مركب من أخشاب بحيث أنه سميع جميع ما يحتاج إليه من الدور المبينه والقصور والخيام والأمتعة والخيول والجمال والأثقال والرجال من الإنس والجن ، وغير ذلك من الحيوانات والطيور فإذا أراد سفرا أو مستنزها أو قتال ملك أوأعداء من أى بلاد الله شاء ، فإذا حمل هذه الأمور المذكورة على الباسط أمر الريح فدخلت تحته فرفعته فإذا استقل بين السماء والأرض أمر الخاء فسارت به ، فإذا أراد أسرع من ذلك أمر العاصفة فحملته أسرع فوضعته فى أى مكان شاء ، بحيث إنه كان يرتحل فى أول النهار من بيت المقدس فتغدو به الريح فتضعه بإصطخر مسيرة شهر فيقيم هناك إلى أخر النهار ، ثم يروح من آخره فترده إلى بيت المقدس .\n\nبل وسخر الله عز وجل له الجن والشياطين لخدمته . قال تعالى : ( ومن الشيطين من يغوصون له ويعلمون عملا دون ذلك وكنا لهم حفظين ( 82 ) ) . وقال تعالى : والشيطين كل بناء وغواص ( 37 ) ) . أى : منهم ما هو مستعمل فى الأبنية الهائلة من محاريب وتماثيل وجفان كالجواب ، وقدروه راسيات إلى غير ذلك من الأعمال الشاقة ، التى لا يقدر عليها البشر ... وطائفة غواصون فى البحار ، يستخرجون ما فيها من اللألئ والجواهر والأشياء النفسية ، التى لا توجد إلا فيها قال تعالى : ( واءخرين مقرنين فى الأصفاد ( 38 ) ) . أى : موثوقون فى الأغلال والأكبال ، ممن قد تمرد وعصى وامتنع من العمل وأبى ، أو قد أساء فى صنيعة واعتدى . بل وأعطاه جيشا من الجن والإنس والطير . قال تعالى : ( وحشر لسليمن جنوده من الجن والإنس والطير ( 17 ) ) . وأتاه العلم والحكمة . فكان هذا كله ملك سليمان عليه السلام .\n\nن بسطت الي يدك لتقتلني ما أنا بباسط يدي إليك لاقتلك ....انى اخاف الله رب العالمين ... انى اريد ان تبوء بإثمى وإثمك فتكون من اصحاب النار وذلك جزاء الظالمين \" ا انصرف هابيل مع زوجته إقليما .. تزوجا وعاشا أياما وقد ظهرت عليها إعراض الحمل في نفس الوقت كانت نفس قابيل طوعت له قتل أخيه استلقى هابيل على الأرض بعد عمل يوم شاق واستغرق فى النعاس انحدرت الشمس نحو الغرب وكان قد مات حمار فى الغابة فأكلت السباع لحمه وأكلت النسور ماتبقى منه وشربت الأرض دمه وبقى فكه العظمى ملقى على الأرض حمل قابيل أول سلاح في الأرض وراح يمضى باحثا عن شقيقه ووجده نائما استيقظ هابيل من نومه وفتح عينيه ارتفعت يد قابيل بالفك العظمى وهوت بسرعة انبثق الدم من وجه هابيل وملأ صدر قابيل عادت اليد الآثمة تهوى على الوجه الطيب وفى الضربة الخامسة ارتطمت يد قابيل بطين الحقل سكنت حركة هابيل وأيقن قابيل أن أخاه قد مات جلس واجما أمام ضحيته لا يعرف ماذا يفعل به ولا يعرف كيف يتصرف .\n\nوفى يوم من الأيام خرجت تلك الجيوش والجماعات من الجن والإنس والطيور والوالحوش . خرجت كلها فى صفوف متنافسة ووقفوا جميعا ينتظرون خروج نبى الله سليمان عليه السلام . وبعد وقت قصير خرج سليمان عليه السلام ورأى هذه المملكه العظيمة فتذكر هذا الدعاء الجميل . ( رب آغفر لى وهب لى ملكا لا ينبغى لأحد من بعدى إنك أنت الوهاب ( 35 ) ) ... وكيف أن الله استجاب دعاءه وأعطاه ذلك الملك . نعم .. إنه يفهم لغة الطير ويحدثها ويأمرها فتطيع أمره ويأمر الريح أن تنقله فى أى وقت وإلى أى مكان فتطيع وتذهب من الشام إلى العراق فى الصباح وتعود به قبل الظهر . ويأمر الجن قيبنون له القصور ويصنعون له المحاريب والقدور الكبيرة . ومنهم من يغوص فى الأعماق ليأتوا إليه باللؤلؤ والكنوز والجواهر والأشياء النفسية . إنه ملك كبير وعظيم . أخذ سليمان عليه السلام ينظر إلى هذه الملك ويحمد الله حمدا كبيرا .\n\nيا له من ملك عظيم لهذا النبى الكريم . نعم ... لقد سار سليمان عليه السلام مع هذا الجيش العسكرى الكبير الذى كان يتكون من ثلاث فرق : فرقة الإنس ، وفرقة الجن ، وفرقة الطير . وقال تعالى : ( وحشرر لسليمن جنوده من الجن والإنس والطير ( 17 ) ) . ولا يعنى هذا أن سليمان عليه السلام حكم كل الإنس ، وكل الجن ، وكل الطير ، وإنما حكم طوائف من الإنس تمثل عالم الإنس ، وطوائف من الجن تمثل عالم الجن ، وأصنافا من الطير تمثل عالم الطير . وكانت هذه الطوائف جنودا فى جيش سليمان عليه السلام . ورغم اختلاف أجناد الجيش ، وتنوع أصول الجنود ، إلا أنه كان جيشا منظما مرتبا متنافسا ، وكان الجنود من هذه الفرق يسيرون بنظام دقيق محكم ... وأشار إلى هذه التنظيم قوله تعالى : ( فهم ويزعون ( 17 ) ) .\n\nنبى الله سليمان عليه السلام فى قرية النمل وفى هذا اليوم خرج سليمان عليه السلام وسط هذه الحشود العظيمة من الطير والإنس والجن فمروا على وادى النمل . فإذا به يسمع صوت نملة تقول للنمل من حولها قال تعالى : ( يأيها النمل آدخلوا مسكنكم لا يحطمنكم سليمن وجنوده وهم لا يشعرون ( 18 ) ) . لقد سار المركب موكب سلمان من الجن والإنس والطير فى ترتيب ونظام ، يجمع آخره على أوله ، تضم صفوفه ، وتتلاءم خطاه . حتى إذا أتوا على واد كثير النمل ، قالت نمله لها صفة الإشراف والتنظيم على النمل السارح فى الوادى – ومملكة النمل كمملكة النحل دقيقة التنظيم ، تتنوع فيها الوظائف ، وتؤدى كلها بنظام عجيب ، يعجب البشر غالبا عن اتباع مثله ، على ما أوتوا من عقل راق وإدراك عال – قالت هذه النمل للنمل ، بالوسيلة التى تتفاهم بها أمة النمل ، وباللغة المتعارفة بينها .. قالت للنمل قال تعالى : ( آدخلوا مسكنكم ( 18 ) ) . وعللت النملة الحكيمة طلبها ، بأنها فعلت ذلك لتحمى النمل من الهلاك تحت أقذدام جنود سليمان عليه السلام قال تعالى : ( لا يحطمنكم سليمن وجنوده ( 18 ) ) . أى : إذا بقيتم أيها النمل تتحركون عى وجه الأرض فسوف يحطمنكم سليمان وجنوده ، فادخلوا بيوتكم أماكن سكنكم لئلا تحطموا وتدمروا . وحتى لا تسئ أمتها من النمل الظن بسليمان عليه السلام وجنوده المؤمنين ، استدركت النملة الحكيمة قائلة قال تعالى : ( وهم لا يشعرون ( 18 ) ) . وهذه الأية الاستدراكية منها للاعتذار ، تعتذر لقومها عن أى أذى يصيبهم من سليمان وجنوده ، وتبين أن سليمان وجنوده ما كانوا يريدون إيذاع النمل ولا تحطيمها ، فإذا داسوها بأقدامهم فلأنهم لم يشعروا بها . وهذا يدل على حرص النملة الحكيمة على الإعتذار عم ما قد يصدر عن سليمان وجنوده ، وحرصها على تبرئة سليمان النبى عليه السلام من أى تهمة قد توجهها النمل به . كما يدل كلام النملة على حرصها على أمتها من النمل ، وإشفاقها عليهم ، واهتمامها بهم ، وتفكيرها فى تخليصهم من الخطر ، وإيصالهم إلى بر الأمان . فإذا كانت نملة صغيرة بهذا الإهتمام بالنمل ، وهى حشرة زاحفة صغيرة لا تكاد ترى ... فلماذا لا يكون البشر ذوو العقل والأفهام مهتمين بالناس ، حريصون على نصحهم وإبعاد الحظر إليهم ؟ وعندما كلمت النملة أمهتا بهذه النصيحة ، واستمع النمل لها ، واستجاب لها ، وسارع النمل إلى دخوله مساكنه والاحتماء من الخطر فى بيويته .\n\nسليمان عليه السلام يتبسم ضاحكا من قوله النملة ولم سمع جنود سليمان كلام النملة لأمتها ... لكن سليمان عليه السلام سمع كلامها ، وفهم مرادها ، وتأثر بنطقها ، لأن الله علمه منطق الطيور والحيوانات والحشرات . ولما سمع ذلك : (( تبسم ضاحكا من قولها )) . ولما تبسم ضاحكا من قول النملة معجبا مستحسنا توجه إلى الله بالحمد والشكر والتضرع والدعاء ( رب أوزعنى أن أشكر نعمتك التى أنعمت على وعلى ولدى وأن أعمل صلحا ترضه وآدخلنى برحمتك فى عبادك الصلحين ) . ووقف سليمان عليه السلام هو وجنوده حتى دخل جيش النمل إلى مساكنه ثم بدأ بعد ذلك فى التحرك ليكمل رحلته هو وجنوده .",
    "number-en": "The story of the ant with Solomon, peace be upon him",
    "label-en": "God Almighty said: Until, when they came to the Valley of the Ants, an ant said, “O ants, enter your dwellings, lest Solomon and his soldiers crush you while they were They don't feel it.\n\nOnce upon a time, there was a noble prophet whose name was Suleiman bin Dawood, peace be upon him. This noble prophet stood up one day and prayed a supplication that no prophet before him or after him had ever prayed. He stood up and said: (My Lord, forgive me and grant me a kingdom that no one after me should have. You are the Giver (35)). So God gave him a kingdom that he had not given to any human being, and He subjected to him things that he had not subjected to any human being. God taught him the language of birds and animals and gave him everything.. And he was the one who acknowledged that, so he said, peace be upon him: (O people, we have been taught the language of birds and we have been given everything (16)). That is, from everything that the king needs in terms of numbers, machines, soldiers, armies, and groups of jinn, humans, birds, beasts, and devils. The Prophet of God, Solomon, peace be upon him, was of great wisdom, and that is why the People of the Book call him “Solomon the Wise” and do not consider him a prophet at all. Mujahid said: There are four kings of the world: two believers and two unbelievers. As for the two believers: Suleiman bin Dawud and Dhul-Qarnayn, and as for the two unbelievers: Nimrod bin Kanaan, in short.\n\nIn fact, God Almighty subjected the wind to him, which carried him from one country to another in the blink of an eye... and even obeyed him if he commanded it. God Almighty said: (And for Solomon the wind was a storm, flowing at his command to the land in which We established (81)). And God Almighty said: (And for Solomon the wind, its beginning was a month and its rest was a month (12)). When he left the horses seeking the face of God, God compensated him with the wind that was faster, stronger, and greater, and there was no cost to him for it. God Almighty said: (Prosperity flows by His command wherever it strikes) (36)). That is: wherever he wanted from any country... he had a rug made of wood so that he could hear everything he needed from clear houses, palaces, tents, luggage, horses, camels, burdens, men from humans and jinn, and other animals and birds. So if he wanted to travel, or camp, or fight a king or enemies from any country God wanted, So if he carried these mentioned matters on the Basit, he commanded the wind and it entered under him and raised him, and if he was independent between the sky and the earth, he commanded the Kha, and it moved with it. If he wanted faster than that, he commanded the storm, so it carried him faster and placed him in any place he wanted, such that he would travel at the beginning of the day from Bayt al-Maqdis, and the wind would come with him and place him in Istakhar, a month’s journey, and he would stay there until the end of the day, and then he would depart at the end of the day and it would return him to Bayt al-Maqdis.\n\nIndeed, God Almighty subjected the jinn and devils to his service. God Almighty said: (And among the devils are those who delve into Him and teach work other than that, and We are their guardians (82)). And God Almighty said: And the two devils are every builder and diver (37). That is to say: some of them are used in huge buildings, such as niches, statues, and shrines like doors, and they are anchored and other hard work, which humans are not capable of... And a group of divers in the seas, extracting what is in it of pearls, jewels, and psychological things, which are not found except in it. God Almighty said: (And others bound in shackles (38)). That is, those who are trusted in shackles and shackles, from those who have rebelled, disobeyed, refrained from working and refused, or have done wrong in their actions and transgressed. Rather, he gave him an army of jinn, humans, and birds. God Almighty said: (And gathered for Solomon were his hosts of jinn, mankind, and birds (17)). Knowledge and wisdom came to him. This was all the property of Solomon, peace be upon him.\n\nIf you extend your hand to me to kill me, I will not extend my hand to you to kill you.... Indeed, I fear God, Lord of the worlds... I want you to bear my sin and your sin, so that you will be among the inmates of the Fire, and that is the recompense of the wrongdoers.” Abel departed with his wife in peace.. They got married and lived for several days, and symptoms of pregnancy appeared at the same time. Cain's soul volunteered to kill his brother. Abel lay down on the ground after a hard day's work and fell asleep. The sun descended toward the west, and a donkey had died in the forest. The wild lions ate his flesh, the eagles ate what was left of him, and the ground drank his blood, and his great jaw remained lying on the ground. Cain picked up the first weapon in the ground and went looking for his brother and found him asleep. Abel woke up from He fell asleep and opened his eyes. Cain's great hand rose with his jaw and fell quickly. Blood gushed out from Abel's face and filled Cain's chest. The sinful hand returned to falling upon the good face. In the fifth blow, Cain's hand hit the mud of the field. Abel's movement stopped, and Cain was certain that his brother was dead. He sat helpless in front of his victim, not knowing what to do with him and not knowing how to act.\n\nOne day, those armies and groups of jinn, humans, birds, and animals emerged. They all went out in competing ranks and they all stood waiting for the Prophet of God, Solomon, peace be upon him, to emerge. After a short time, Solomon, peace be upon him, went out and saw this great kingdom, so he remembered this beautiful supplication. (My Lord, forgive me and grant me a kingdom that no one will have after me. You are the Giver (35))... And how God answered his prayer and gave him that kingdom. Yes.. He understands the language of birds, speaks to it, and commands it, so it obeys his command. He commands the wind to transport it at any time and to any place, so it obeys, and it goes from the Levant to Iraq in the morning and returns with it before noon. He orders the jinn to build palaces for him and make niches and large pots for him. Some of them dive into the depths to bring back pearls, treasures, gems, and psychological things. He is a big and mighty king. Solomon, peace be upon him, looked at this queen and thanked God greatly.\n\nWhat a great king this noble prophet is. Yes ... Solomon, peace be upon him, marched with this large military army, which consisted of three divisions: the human division, the jinn division, and the bird division. And God Almighty said: (And gathered for Solomon his armies of the jinn, mankind, and birds (17)). This does not mean that Solomon, peace be upon him, ruled over all humans, all jinn, and all birds. Rather, he ruled over groups of humans representing the world of humans, groups of jinn representing the world of jinn, and types of birds representing the world of birds. These sects were soldiers in the army of Solomon, peace be upon him. Despite the differences in the ranks of the army, and the diversity of the origins of the soldiers, it was an organized, organized, and competing army, and the soldiers from these divisions were marching in a precise and precise order... This organization was referred to in the Almighty’s saying: (They understand and they disperse (17)).\n\nThe Prophet of God, Solomon, peace be upon him, in the village of ants. On this day, Solomon, peace be upon him, went out among these great crowds of birds, humans, and jinn, so they passed by the valley of ants. Then he heard the voice of an ant saying to the ants around it: God Almighty said: (O ants, enter your dwelling, lest Solomon and his soldiers destroy you while they do not perceive it (18)). The boat was accompanied by Salman’s procession of jinn, humans, and birds in order and order, with its end united over its beginning, its ranks united, and its steps consistent. Until, when they came to a valley full of ants, an ant said it had the capacity to supervise and organize the ants roaming in the valley - and the ant kingdom is like the kingdom of bees, carefully organized, in which the functions are diverse, and all of them are performed by a strange system, the like of which humans often refuse to follow, despite the sophisticated mind and high understanding they are endowed with - these ants said to the ants, by the means by which the nation of ants communicates, and in the language known to them.. She said to the ants: God Almighty said: (Enter your dwelling (18)). The wise ant justified her request by saying that she did so to protect the ants from destruction under the feet of the soldiers of Solomon, peace be upon him. God Almighty said: (Do not destroy you Solomon and his soldiers (18)). That is: If you, ants, continue moving on the face of the earth, Solomon and his soldiers will destroy you, so enter your homes, the places you live, lest you be destroyed and destroyed. And so that her nation of ants would not have bad thoughts about Solomon, peace be upon him, and his faithful soldiers, the wise ant responded by saying: God Almighty said: (And they perceive not (18)). This supplementary verse is an apology, apologizing to her people for any harm that befell them from Solomon and his soldiers, and it clarifies that Solomon and his soldiers did not want to scatter the ants or destroy them, so if they trampled them with their feet, it was because they did not feel them. This indicates the wise ant’s keenness to apologize for what might come from Solomon and his soldiers, and its keenness to acquit Solomon the Prophet, peace be upon him, of any accusation the ant might bring against him. The ant’s words also indicate her concern for her nation of ants, her compassion for them, her concern for them, and her thinking about ridding them of danger and bringing them to safety. If a small ant is so interested in ants, which are a small crawling insect that you can hardly see... why are not humans with reason and understanding interested in people, keen to advise them and remove prohibitions from them? When the ant spoke to its mother with this advice, the ants listened to her and responded to her, and the ants quickly entered their homes and took shelter from danger in their homes.\n\nSolomon, peace be upon him, smiled and laughed at what the ant said, and Solomon’s soldiers did not hear the ant’s words to her nation... But Solomon, peace be upon him, heard her words, understood what she meant, and was affected by her pronunciation, because God taught him the logic of birds, animals, and insects. When he heard that, he smiled and laughed at what she said. And when he smiled and laughed at the ant’s words with admiration and approval, he turned to God with praise, thanks, supplication, and supplication (My Lord, enable me to be grateful for Your blessings which You have bestowed upon me and upon my children, and to do righteousness that pleases You, and admit me, by Your mercy, into the ranks of Your righteous servants). Solomon, peace be upon him, stood with his soldiers until the army of ants entered his dwellings, and then he began to move to continue his journey with his soldiers."
  },
  {
    "number": "قصة الهدهد مع سليمان عليه السلام ",
    "text": "",
    "label": "قال الله تعالى : ﴿وَتَفَقَّدَ الطَّيْرَ فَقَالَ مَا لِيَ لا أَرَى الْهُدْهُدَ أَمْ كَانَ مِنَ الْغَائِبِينَ * لأُعَذِّبَنَّهُ عَذَابًا شَدِيدًا أَوْ لأَذْبَحَنَّهُ أَوْ لَيَأْتِيَنِّي بِسُلْطَانٍ مُبِينٍ﴾\n\nأكرمَ اللهُ عزَّ وجلَّ عبدَهُ ونبيَّهُ سليمانَ عليهِ السلامُ بنعَمٍ كثيرةٍ وخَصّهُ بمزايا رائعةً كانتْ عُنوانًا للعَظَمَةِ والمجدِ ومَظْهرًا من مظاهِرِ المُلْكِ العظيمِ والجاهِ الكبيرِ والدرجةِ العاليةِ عندَ اللهِ سبحانَهُ، فقدْ فضّلَهُ اللهُ تعالى بالنبُوّةِ وتسخيرِ الشياطينِ والجنِّ والطيرِ وقدْ علّمَهُ اللهُ تعالى مَنْطِقَ الطّيرِ ولُغتَهُ وسائرَ لغاتِ الحيواناتِ فكانَ يفهمُ عنْها ما لا يفهمُهُ سائرُ الناسِ وكانَ يتحدّثُ معها أحيانًا كما كانَ الأمرُ مع الهُدْهُدِ والنّملِ.\n\nوكانتْ وظيفةُ الهُدْهُدِ في جيشِ سيّدِنا سليمانَ أنّهم كانوا إذا أعوزوا الماءَ واحتاجوا إليهِ في حالِ الأسفارِ أنْ يجيءَ الهُدْهُدُ فينظرَ لهم هلْ بهذهِ البقاعِ مَنْ ماءٍ ؟ لأنّ الهُدْهُدَ كانَ ينظرُ إلى الماءِ تحتَ تُخومِ الأرضِ ، كانَ يرَى الماءَ في الأرضِ كما يرى الماءَ في الزّجاجَةِ بمشيئةِ اللهِ تعالى. فلقدْ ذَكَرَ المفسّرونَ أنّ سليمانَ لما حَجّ خرَجَ إلى اليمنِ فوافى صنعاءَ وقتَ الزّوالِ فنَزَلَ ليصلّي فلمْ يجدِ الماءَ فتفقّدَهُ لذلكَ .\n\nوذُكِرَ أيضًا أنّه وقعتْ نفحةٌ منَ الشمسِ على رأسِ سيِّدِنا سليمانَ فنظرَ فإذا موضعُ الهُدْهُدِ خالٍ ، لأنّ الطّيرَ كانتْ تُظِلّ سليمانَ عليهِ السلامُ منْ أشعّةِ الشّمسِ . فلمّا فقدَ الهُدْهُدَ دعا عريفَ الطّيرِ وهو النَّسْرُ فسألَهُ عنهُ فلمْ يجدْ عندَهُ عِلْمَهُ ، ثمّ قالَ لسيّدِ الطّيرِ وهوَ العُقابُ: \"عليَّ بهِ\" فارتفعَ العُقابُ فنظرَ فرأى الهُدْهُدَ مُقبِلاً منْ بعيدٍ فقصدَهُ فقالَ لهُ الهُدْهُدُ: \"ناشدتُكَ اللهَ أنْ تتْرُكَني\" فتركَهُ ووصلَ الهُدْهُدُ إلى سيِّدِنا سليمانَ فلمّا قَرُبَ منهُ أرْخَى ذنبَهُ وجناحيْهِ يجرُّهُما على الأرضِ وقال: \"يا نبيَّ اللهِ اذكُرْ وقوفَكَ بينَ يديِ اللهِ\" .(أيْ في موقفِ يومِ القيامةِ، وليس معنى ذلك أنّ الله موضوفٌ باليدِ الجارحةِ لأنه منَزّهٌ عن ذلك وموجودٌ بلا مكانٍ) فارتعَدَ سليمانُ وعفا عنهُ. يقولُ ربُّ العِزّةِ في مُحكَمِ التّنْزيلِ: ﴿وَتَفَقَّدَ الطَّيْرَ فَقَالَ مَا لِيَ لا أَرَى الْهُدْهُدَ أَمْ كَانَ مِنَ الْغَائِبِينَ * لأُعَذِّبَنَّهُ عَذَابًا شَدِيدًا أَوْ لأَذْبَحَنَّهُ أَوْ لَيَأْتِيَنِّي بِسُلْطَانٍ مُبِينٍ﴾ سورة النمل/20-21 .\n\nقالَ أوْ لأذبحنَّهُ أوْ ليأتيَني بسلطانٍ مبينٍ أي بحُجّةٍ لهُ فيها عُذرٌ ظاهرٌ على غيبتِه. فلمّا سألَهُ عنْ غَيْبَتِهِ أخبرَهُ بأنّهُ اطّلَعَ على ما لَمْ يطّلِعْ عليهِ وأخبرَهُ بخبرٍ يقينٍ صادقٍ وهوُ أنّهُ كانَ في اليمنِ في بلدَةِ سبَإٍ وأنّ هناكَ مَلِكَةً على هذهِ البلادِ تُدعى بلقيسَ قدْ ملَكَتْ على تلكَ الأمّةِ في اليمنِ وأوتيَتْ منْ كلِّ شىءٍ يُعطاهُ المُلوكُ ويؤتاهُ النّاسُ ولها عرشٌ عظيمٌ مزخرفٌ بأنواعِ الزِّينةِ والجواهرِ مِمّا يُبهِرُ العيونَ. يقولُ اللهُ تعالى: ﴿فَمَكَثَ غَيْرَ بَعِيدٍ فَقَالَ أَحَطتُ بِمَا لَمْ تُحِطْ بِهِ وَجِئْتُكَ مِن سَبَإٍ بِنَبَإٍ يَقِينٍ * إِنِّي وَجَدتُ امْرَأَةً تَمْلِكُهُمْ وَأُوتِيَتْ مِن كُلِّ شَىْءٍ وَلَهَا عَرْشٌ عَظِيمٌ * وَجَدتُهَا وَقَوْمَهَا يَسْجُدُونَ لِلشَّمْسِ مِن دُونِ اللهِ وَزَيَّنَ لَهُمُ الشَّيْطَانُ أَعْمَالَهُمْ فَصَدَّهُمْ عَنِ السَّبِيلِ فَهُمْ لا يَهْتَدُونَ * أَلاَّ يَسْجُدُوا للهِ الَّذِي يُخْرِجُ الْخَبْءَ فِي السَّمَوَاتِ وَالأَرْضِ وَيَعْلَمُ مَا تُخْفُونَ وَمَا تُعْلِنُونَ * اللهُ لا إِلَهَ إِلاَّ هُوَ رَبُّ الْعَرْشِ الْعَظِيمِ﴾ سورةُ النملِ/22-23-24-25-26 .\n\nأَلاَّ يَسْجُدُوا للهِ الَّذِي يُخْرِجُ الْخَبْءَ فِي السَّمَوَاتِ وَالأَرْضِ، وخَبْءُ السّماءِ المطرُ، وخَبْءُ الأرضِ النباتُ. وَيَعْلَمُ مَا تُخْفُونَ وَمَا تُعْلِنُونَ ، فلمّا فَرَغَ الهُدْهُدُ منْ كلامِهِ قالَ سليمانُ عليهِ السلامُ: \"سننظُرُ أصدَقْتَ (أي فيما أخبَرْتَ عن خبر بلقيس) أمْ كنتَ منَ الكاذبينَ ؟\"\n\nثمّ كتبَ سليمانُ كتابًا: \"منْ عبدِ اللهِ سليمانَ بنَ داودَ إلى بلقيسَ ملكةِ سبَإٍ بسمِ اللهِ الرحمنِ الرحيمِ السلامُ على مَنِ اتّبعِ الهُدى أمّا بعدُ فلا تعلُو عَلَيّ وأتوني مسلمينَ\" وطَبَعَهُ بالمِسكِ وختمَهُ بخاتَمِهِ وقالَ للهُدْهُدِ: \"اذهبْ بكتابي هذا فألْقِهِ إليهِمْ \" أيْ إلى بَلقيسَ وقومِها، فأخَذَ الهُدْهُدُ الكتابَ بمِنقارِهِ ودخلَ عليها مِنْ كُوّةٍ فطَرَحَ الكتابَ على نَمْرِها وهي راقدةٌ وتوارى في الكَوَّةِ فانتبَهَتْ فَزِعَةً ، يقولُ اللهُ تعالى في القرءانِ العظيمِ إخبارًا عنْ بلقيسَ : ﴿قَالَتْ يَا أَيُّهَا المَلأُ إِنِّي أُلْقِيَ إِلَيَّ كِتَابٌ كَرِيمٌ إِنَّهُ مِن سُلَيْمَانَ وَإِنَّهُ بِسْمِ اللهِ الرَّحْمَنِ الرَّحِيمِ أَلاَّ تَعْلُوا عَلَيَّ وَأْتُونِي مُسْلِمِينَ﴾ النمل/29-30-31 .",
    "number-en": "The story of the hoopoe with Solomon, peace be upon him",
    "label-en": "God Almighty said: “And he inspected the birds and said, ‘What is the matter with me that I do not see the hoopoe? Or is it one of those who are absent? To bring me clear authority.\n\nGod Almighty honored His servant and Prophet Solomon, peace be upon him, with many blessings and bestowed upon him wonderful advantages that were a symbol of greatness and glory and a manifestation of great kingship, great prestige, and a high rank in the eyes of God, Glory be to Him. God Almighty favored him with prophecy and the subjugation of devils, jinn, and birds. God Almighty taught him the logic of birds, their language, and all the languages ​​of animals, so he understood about them what other people did not understand, and he would sometimes talk to them, as was the case with the hoopoe and the ants. The job of the hoopoe in the army of our Master Solomon was that if they were in short supply of water and needed it while traveling, the hoopoe would come and check for them whether there was any water in these places? Because the hoopoe looked at the water under the borders of the earth. He saw the water in the earth just as he saw the water in a bottle, by the will of God Almighty. The commentators mentioned that when Solomon performed Hajj, he went out to Yemen and arrived in Sana’a at noon time. He went down to pray and did not find water, so he checked it for that reason.\n\nIt was also reported that a ray of sun fell on the head of our Master Solomon, and he looked and saw that the hoopoe’s place was empty, because the birds were providing shade for Solomon, peace be upon him, from the rays of the sun. When the hoopoe was missing, he called the master of the bird, which is the eagle, and asked him about him, but he did not find his knowledge with him. Then he said to the master of the bird, which is the eagle: “I will take care of it.” The eagle rose and looked and saw the hoopoe coming from afar, so he went to him and said to him. The hoopoe: “I called upon God to leave me.” So he left him, and the hoopoe reached our master Solomon. When he approached him, he relaxed his tail and his wings, dragging them along the ground, and said: “O Prophet of God, remember your standing before God.” (i.e., in a position on the day of Resurrection, This does not mean that God is attacked by a cruel hand, because He is above that and exists without a place.) So Solomon trembled and pardoned him. The Lord of Glory says in the decisive revelation: “And he inspected the bird and said, ‘What is the matter with me that I do not see the hoopoe? Or is it among those who are absent? We would have slaughtered it or it would have come to me with clear authority.” Surat An-Naml: 20-21.\n\nHe said, \"I will slaughter him, or he will bring me clear evidence,\" that is, a proof for which he has an apparent excuse for his absence. When he asked him about his absence, he told him that he had seen what he had not seen, and he told him certain and true news, which is that he was in Yemen in the town of Sheba, and that there was a queen in this country called Bilqis, who ruled over that nation in Yemen and was given Of everything that is given to kings and given to people, and it has a great throne decorated with all kinds of adornments and jewels that dazzle the eyes. God Almighty says: “Then he remained not long and said: I have encompassed what you have not encompassed, and I have come to you from Sheba with certain news. * Indeed, I have found a woman ruling over them, and I have been given Of everything, and she has a great throne. * I found her and her people prostrating to the sun instead of God, and Satan made their deeds pleasing to them, and turned them from the path. So they are not guided * Do they not prostrate to God, who brings forth what is hidden in the heavens and the earth, and He knows what you hide and what you declare * God There is no god but He, Lord of the Great Throne. (Surat An-Naml: 22-23-24-25-26)\n\nDo they not prostrate themselves to God who brings forth what is hidden in the heavens and the earth, and what is hidden in the sky is rain, and what is hidden in the earth is vegetation. And He knows what you hide and what you declare, When the hoopoe finished speaking, Solomon, peace be upon him, said: “We will see whether you told the truth (that is, in what you reported about the news of Bilqis) or whether you were one of the liars?”\n\nThen Solomon wrote a letter: “From Abdullah Suleiman, son of David, to Bilqis, Queen of Sheba. In the name of God, the Most Gracious, the Most Merciful. Peace be upon whoever follows guidance. As for now, do not be superior to me and come to me in submission.” He printed it with musk and sealed it with his seal and said to the hoopoe: “Go with this letter of mine and deliver it to them,” that is, to Bilqis and her people. Then the hoopoe took the book in its beak and entered upon her through a window. He threw the book on her tiger while she was lying down and hid in the window. Then she woke up in horror. God Almighty says in the Great Qur’an about Bilqis: “She said, ‘O you!’” “Indeed, a noble letter has been delivered to me. It is from Solomon, and it is in the name of God, the Most Gracious, the Most Merciful. ‘Do not be arrogant against me and come to me in submission.’” An-Naml/29-30-31."
  },
  {
    "number": "قصة حمار العزيز ",
    "text": "",
    "label": "قال الله تعالى : أَوْ كَالَّذِي مَرَّ عَلَى قَرْيَةٍ وَهِيَ خَاوِيَةٌ عَلَى عُرُوشِهَا قَالَ أَنَّى يُحْيِي هَذِهِ اللَّهُ بَعْدَ مَوْتِهَا فَأَمَاتَهُ اللَّهُ مِاْئَةَ عَامٍ ثُمَّ بَعَثَهُ قَالَ كَمْ لَبِثْتَ قَالَ لَبِثْتُ يَوْمًا أَوْ بَعْضَ يَوْمٍ قَالَ بَلْ لَبِثْتَ مِاْئَةَ عَامٍ فَانْظُرْ إِلَى طَعَامِكَ وَشَرَابِكَ لَمْ يَتَسَنَّهْ وَانْظُرْ إِلَى حِمَارِكَ وَلِنَجْعَلَكَ آَيَةً لِلنَّاسِ وَانْظُرْ إِلَى الْعِظَامِ كَيْفَ نُنْشِزُهَا ثُمَّ نَكْسُوهَا لَحْمًا فَلَمَّا تَبَيَّنَ لَهُ قَالَ أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ .\n\nعاشت اليهود فى الأرض فسادا بعد الموت موسى عليه السلام فكان الله تعالى يبعث إليهم الأنبياء ... النبى تلوا الأخر ، فما كان منهم إلا أن قتلوا من الأنبياء ما قتلوا ، وكذبوا من كذبوا ، وعبدوا الأصنام من دون الله تعالى ، فبعث الله تعالى عليهم ملكا من ملوك الفرس وهو (( بخنتصر )) الذى قتل ألافا من بنى إسرائيل ، وجعل الأحياء منهم خدما وعبيدا له ولقومه ، فكانت هذه عاقبة الكفر بالله ، وقتل أنبيائه بغير حق . وإمتدت يد العبث إلى (( بيت القدس )) حتى دمرها (( بخنتصر )) وجنوده فجعلوها حطاما ما كأن لم تغن بالأمس فهى خاوية على عروشها لا أثر فيها لحياة ولا بناء ، ولا صوت لساكن فيها ، إنما هى بقايا الخراب والدمار ... السقوف متساقطة على الجدران ... والأثاث والمتاع متناثر فى هذه المدينة التى كانت تمتلئ حياة وبهجة ، فلا يملك من يراها إلى الحسرة على ما تهدم منها ... ولعن بنو إسرائيل الذين تسببوا بذنوبهم فى هذا العذاب والدمار لما أغضبوا الله تعالى ...\n\nويكفى مشهد العظام البالية المتناثرة من بقايا جثث القتلى من بنى إسرائيل . وفى بيت المقدس – وهى على هذا الحال من الدمار والخراب : خاوية على عروشها – كان العبد الصالح (( عزير )) – قد ركب حماره ، وخرج يبتغى من رزق الله ... وكان (( عزير )) شابا من (( بنى إسرائيل )) ، نشأ على التقوى والعبادة وحسن الصلة بالله تعالى ... وتفقه وتعلم حتى برز بين الناس ، وأضحى من العلماء الذين يشار إليهم بالبنان ، ويعتمد عليهم فى بيان الأحكام . ولقد كان والده من كبار الأحبار وخدام الشريعة ، وكهان الهيكل ... ومنه تلقى (( عزير )) أولى معارفه وعلومه ، وعلى نهجه سار فى حياته . وفى ذات يوم – وكان والده قد مات وورث هو عنه مقامه ومكانته فى القوم – خرج (( عزير )) من البلد يسكنها إلى ضاحية فيها حيث تكثر المزارع وبساتين الفاكهة وعيون المياه الجارية ، وكان ل (( عزير )) هناك بستان من كروم العنب ، وبعض أشجار الفاكهة . ولقد خرج بقصد التنزه والترويج عن النفس ، والإطلاع عى الشجر والثمر، والأعتناء بما هر فى حاجة إلى رعاية وإهتمام منها ، كى تؤتى أكلها شهيا طيبا . وبينما هو فى الطريق أصابه الحر الشديد ، فوجد أرضا خربة من خرائب وأطلال بيت المقدس ، فدخل فيها لسيظل بظل أحد جدرانها . نزل عزير من على حماره وكان معه سلة فيها تين وسلة فيها عنب ، فخرج قصعة كانت معه وأعتصر فيها من العنب الذى كان معه ، ثم خرج خبزا يابسا فألقاه فى تلك القصعه ليبتل ليأكله ، ثم استلقى على قفاه وأسند رجليه إلى الحائط وأخذ عزير ينظر إلى سقف تلك البيوت الخربة وهى خاوي على عروشها وقد هلك أهلها ولم يبق منهم أحد ... ورأى عظاما بالية فتعجب وقال : كيف يحيى الله هذه القرية بعد موتها . ولم يقل هذا الكلام وهو يشك فى قدرة الله ولكنه كان متعجبا من شدة الخراب الذى حدث لتلك القرية . كانت خاطرة مرت به ، داعبت خياله ، وعبثت بفكره ، إلى حين ، وهى – ولا شك – من قبيل سيدنا (( إبراهيم )) عليه السلام : ( رب أرنى كيف تحى الموتى قال أولم تؤمن قال بلى ولكن ليطمئن قلبى ) .\n\nإن الرجل رأى مشهد الدمار والخراب ، فتعجب ، وتساءل كيف يعيد الله تعالى الحياة فى هذا البلد بعد أن ماتت فيه كل مظاهر الحياة ... فالبيوت محطمة مهدمة ، والسكان قد هجروها ، فالحياة مستحيلة على مثل هذه القرية ، إلا ان ربه سبحانه يسمعه ، ويريد أن يريه كيف يحيى الموتى ؟ وكيف تعود الحياة مرة أخرى إلى العظام الباليه ، والجثث التى تحولت إلى تراب ، ورعى الدود فيها وسرى عليها . فأرسل الله إليه ملك الموت فى التو واللحظة فأماته الله مائة عام . وفى هذه الفترة حدثت أشياء كثيره ... فلقد مات الناس وخلق أناس وتغيرت معالم الكون . وعادت الحياة إلى بيت المقدس بعد أن رفع الله عنهم العذاب ، ومات بخنتصر ، وحكم من بعض الحكام العادلين ... وإلى العهد الأول من الحياة والبهجة عادت بيت المقدس إلا أن شيئا واحدا هجر القلوب بلاعوده ، وهو الإيمان الذى فارق بنى إسرائيل ، حتى أنهم نسوا التوراة التى أنزلت على (( موسى )) فحرفوها – أى : بدلوها وغيروها – وكتبوها بأقلامهم التى تقطر زورا وزيفا وكذبا على الله ورسوله . وحيث مات العزير لا زل طيله مائة عام لم يلتفت إليه أحد أو ينتبه ، وصار حماره الذى ركبه مجرد عظام بالية كبقية العظام التى رأها عزير قبل موته ... أما الطعام فقد بقى كما هو طليلة المائة عام لم يتغير أو يتبدل فهو محفوظ بحفظ الله تعالى ، وعزير نفسه الأن مجرد عظام بالية متنفتتة . وبعد مرور المائة عام أرسل الله إلى عزير ملكا ليرد إليه الروح مرة أخرى . فقد أماته الله مائة عام وهو لايدرى أنه مات مائة عام بل إنه ظن أنه كان نائما ... ولذلك لما استوى جالسا سأله الملك : كم لبثت ؟ قال : لبثت يوما أبو بعض يوم .. وذلك لأنه نام فى أول النهار عند الظهيرة وبعث فى أخر النهار والشمس أوشكت على الغروب ، فظن أنه نام لمدة خمس ساعات أو أقل من ذلك . وإذا بالملك يخبره بالمفاجأة التى كادت أن تذهب بعقله . قال له الملك : بل لبثت مائة عام .. وإذا أردت أن تتأكد من هذا الخبر فانظر إلى طعامك وشرابك الذى كان معك ، فإنه لم يتغر رغم مرور مائة عام عليه . وما زال عزير يظن أنه كان نائما ولذلك لم يتغير طعامه وشراب فهو حتى هذه اللحظة لا يصدق أنه مات مائة عام . فأراد الملك أن يقطع الشك باليقين فقال لعزير : إن كنت لاتصدق ذلك فانظر إلى حمارك . فنظر عزير إلى حماره ، فوجده ميتا وقد تهشمت عظامه وبينما وقف عزير ينظر إلى حماره فى حيرة ودهشه وإذا بالملك ينادى على عظام الحمار ، فأجابت وأقبلت من كل ناحية حتى أخذ الملك يركبها على بعضها ... وعزير ينظر إليه متعجبا . وبعد أن قام الملك بتركيب العظام وضع عليها العروق والأعصاب ، ثم كساها باللحم وأنبت عليها الجلد والشعر ، ثم نفخ فيه ، فقام الحمار رافعا رأسه وأذنيه إلى السماء وهو ينهق . فلما رأى عزير كل هذا أما عينيه قال : أعلم أن الله على كل شئ قدير . وبعد هذا الموقف العصيب قام عزير من مكانه وركب حماره وانطلق عائدا إلى قريتة وهو لا يدرى ما الذى حدث فيها خلال المائة عام التى مضت . فلما وصل عزير إلى قريته ، لم يعرف أحد من الناس ولم يعرف هو أحدا من الناس ... بل ولم يعرف شوارع القرية فقد تغير كل شئ . أخذ عزير يبحث عن بيته حتى وجد بعد جهد ومشقة . فطرق على الباب وهو ينتظر أن يرى إبنه الذى تركه منذ مائة عام وكان يبلغ من العمرعشرين سنة وكان عزير يبلغ من العمر وقتها أربعين سنة ... وكان قد ترك فى البيت أمة له تبلغ من العمر عشرين سنة .\n\nفلما طرق على الباب ، لم يرد عليه احد ... فأعاد الطرق مرة أخرى وإذا بامرأة كبيرة فى السن يبلغ عمرها مائة وعشرين سنة قد عمى بصرها تفتح الباب وتقول : من على الباب ؟ فقال لها عزير : يا هذه أهذأ منزل عزير ؟ قالت : نعم . وبكت . وقالت : ما رأيت أحدا من سنوات طويلة يذكر عزيرا ، وقد نسيه الناس قال : فإنى أنا عزير . قالت : سبحان الله ! فإن عزيرا قد فقدناه منذ مائة سنة ، فلم نسمع له بذكر ! قال : فإنى أنا عزير ، كان الله قد أماتنى مائة سنة ، ثم بعثنى ! قالت : فإن عزيرا كان رجلا مستجاب الدعوة ، يدعوا للمريض ولصاحب البلاء بالعافية والشفاء فادع الله أن يرد على بصرى حتى أراك ، فإن كنت عزيرا عرفتك . فدعا ربه ، ومسح يده على عينيها ففتحتهما ، وأخذ بيدها وقال : قومى بإذن الله ، فأطلق الله رجلها ، فقامت صحيحة ، كأنما نشطت من عقال . فنظرت إليه ، فقالت : أشهد أنك عزير . فانطلقت معه إلى المجلس الذى يجتمع فيه أهل القرية ... فإذا بعزير يرى ابنه الذى كان قد تركه منذ مائة عام وهو ابن العشرين ... يراه الأن وقد بلغ من العمر مائة وعشرين سنة ... وعزير ما زال فى سن الأربعين فأصبح ابنه أكبر منه بثمانين سنة !!! فقالت لهم هذه المرأة هذا عزير قد جاءكم . فكذبها الناس وقالوا : كيف ذلك وقد حدثنا آباؤنا أن عزيرا قد مات منذ مائة سنة بأرض بابل . فقالت : أنا مولاتكم فلانة ، دعا لى ربه ، فرد على بصرى ، وأطلق رجلى ، وزعم أن الله كان أماته مائة سنة ، ثم بعثة . فنهض الناس ، فأقبلوا إليه فنظر إليه ابنه ، وقال : كانت لأبى شامة سوداء بين كتفية ! فكشف عن كتفيه ، فإذا هو عزير ! ففرح الناس من بنى إسرائيل فرحا شديدا ؛ لأن عزيرا هو الوحيد الذى كان يحفظ التوراة كاملة .. وعندما غاب مائة سنة عنهم ، قام ( بخنتصر ) وحرق لهم التوراة ، فلم يبق منها أى شئ إلا ما يحفظه بعض الرجال . وهنا قام الناس ورحبوا بعزير وطلبوا منه أن يكتب لهم التوراة كاملة . فقال لهم : انتظروا فإن أبى كان قد دفن التوراة أيام ( بختصر ) فى مكان لا يعرفه إلا أنا فتعالوا بنا لنذهب إلى هناك ونحضر التوراة .\n\nوانطلقوا جميعا حتى وصلوا إلى ذلك المكان بصعوبة بعد أن تغيرت معالم القرية ... فحفروا حتة استخرجوا التوراة فوجدوا أوراقها قد تعفنت وتغيرت معالمها فحزنوا حزنا شديدا . فما كان منهم إلا أن طلبوا من عزير أن يكتب لهم التوراة من جديد فجلس عزير تحت ظل شجرة وجلس بنوا إسرائيل حوله ، فكتب لهم التوراة من جديد وعاش مع قومه فى خير وسعادة إلى أن مات ورحل عن هذه الدنيا .",
    "number-en": "The story of the dear donkey",
    "label-en": "God Almighty said: Or like one who passed by a town when its thrones were empty. He said, “How can God revive this one after its death?” Then God caused it to die for a hundred years. Then he sent him back and said, “How long did you stay?” He said, “You stayed for a day or part of a day.” He said, “Rather, you stayed for a hundred years. So look at your food and drink. And look at your donkey, and We will make you a sign for the people. And look at the bones, how We make them sharp. Then they covered them with flesh. When it became clear to him, He said I know that God has power over all things.\n\nThe Jews lived in corruption on earth after the death of Moses, peace be upon him, so God Almighty sent to them prophets... one prophet after another, and they killed as many prophets as they killed, and denied those they lied to, and worshiped idols instead of God Almighty, so God Almighty sent to them one of the Persian kings, namely ((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((((B))) of the children of Israel, and made the living among them servants). The Jews lived in the land. And slaves to him and his people, so this was the consequence of disbelief in God and killing His prophets unjustly. The hand of tampering extended to “the House of Jerusalem” until it was destroyed by “Bakhnassar” and his soldiers, turning it into rubble as if it had not sung the day before. It was empty of its thrones, with no sign of life or building, and no sound of anyone living in it. Rather, it was the remains of desolation and destruction... the ceilings had fallen on the walls... and the furniture and belongings were scattered in this city that was filled with life and joy, so whoever saw it could not bear to be sad. For what you destroyed... The children of Israel cursed those whose sins caused this torment and destruction when they angered God Almighty...\n\nThe sight of worn-out bones scattered from the remains of the bodies of slain Israelites is sufficient. And in Bayt al-Maqdis - while it was in this state of devastation and desolation: empty of its thrones - the righteous servant ((Uzair)) - had ridden his donkey, and went out in search of God’s provision... And ((Uzair)) was a young man from ((the Children of Israel)), who had been brought up in piety, worship, and a good relationship with God Almighty... He learned jurisprudence and learned until he became prominent among the people, and he became one of the scholars who are referred to as “Lebanons” and who are relied upon to explain rulings. His father was one of the most senior rabbis, servants of the Sharia, and priests of the temple... From him, “Uzair” received his first knowledge and knowledge, and he followed his path throughout his life. One day - and his father had died and he inherited from him his position and status among the people - Uzair left the country to live in a suburb where there were many farms, fruit orchards, and springs of running water. Uzair had an orchard of grape vines and some fruit trees. He went out with the intention of taking a walk, promoting himself, looking at trees and fruits, and taking care of a foal that needed care and attention from it, so that it would bear delicious, good food. While he was on the way, he was struck by extreme heat, and he found a desolate land of the ruins and ruins of Jerusalem, so he entered it to take the shade of one of its walls. Uzair got off his donkey, and he had a basket containing figs and a basket containing grapes. He took out a bowl that he had with him and squeezed out of it the grapes that he had with him. Then he took out dry bread and threw it into that bowl to get wet to eat it. Then he lay down on his back and leaned his feet against the wall. Uzair looked at the roof of those ruined houses, empty of their thrones, and their people had perished and not a single one of them remained... and he saw worn-out bones and was amazed and said: How? May God revive this village after its death. He did not say these words while he doubted God's power, but he was amazed at the severity of the devastation that had happened to that village. It was a thought that passed through him, caressed his imagination, and toyed with his thoughts, for a while, and it is - without a doubt - like our master ((Ibrahim)) peace be upon him: (My Lord, show me how you revive the dead. He said, “Have you not believed?” He said, “Yes, but so that my heart may be at peace.”)\n\nThe man saw the scene of devastation and devastation, and he was amazed and wondered how God Almighty would restore life in this country after all aspects of life had died in it... The houses are shattered and destroyed, and the residents have abandoned them. Life is impossible for such a village, except that his Lord, Glory be to Him, hears him and wants to show him how to revive the dead? How can life return again to worn-out bones and corpses that have turned to dust, and worms have grazed and spread over them? So God sent the angel of death to him immediately and in the moment, so God killed him for a hundred years. During this period, many things happened... People died, people were created, and the features of the universe changed. Life returned to Jerusalem after God lifted the torment from them, died victoriously, and was ruled by some just rulers... And to the first era of life and joy, the Holy House returned, but one thing abandoned the hearts without returning, and that is the faith that left the children of Israel, to the point that they forgot the Torah that was revealed to ((Moses)), so they distorted it - that is, they changed it and changed it - and wrote it with their pens dripping with falsehood, falsity, and lies against God and His Messenger. And where Uzair died, for a hundred years no one paid any attention to him, and the donkey he rode became nothing but worn-out bones like the rest of the bones that Uzair saw before his death... As for the food, it has remained as it was for a hundred years and has not changed or changed. It has been preserved by the protection of God Almighty, and Uzair himself is now just worn out, crumbling bones. After a hundred years had passed, God sent a king to Uzair to return his soul to him again. God killed him for a hundred years, and he did not realize that he had died for a hundred years. Rather, he thought that he was sleeping... Therefore, when he sat up, the king asked him: How long did you stay? He said: I stayed for more than a day... This is because he slept at the beginning of the day at noon and got up at the end of the day when the sun was about to set, so he thought he slept for five hours or less than that. Then the king told him of the surprise that almost blew his mind. The king said to him: Rather, you lived for a hundred years.. And if you want to confirm this news, look at the food and drink that you had with you, for it has not changed despite the passage of a hundred years. Uzair still thinks that he was asleep, and therefore his food and drink did not change. Until this moment, he does not believe that he has been dead for a hundred years. So the king wanted to eliminate doubt with certainty, so he said to Uzair: If you don’t believe that, look at your donkey. So Uzair looked at his donkey and found it dead and its bones were shattered. While Uzair stood looking at his donkey in confusion and astonishment, the king called for the donkey’s bones, and they responded and came from every direction until the king began to ride them on some of them... and Uzair looked at him in astonishment. After the king assembled the bones, he placed veins and nerves on them, then covered them with meat and grew skin and hair on them. Then he blew on them, and the donkey rose, raising his head and ears to the sky while braying. When Uzair saw all this before his eyes, he said: I know that God has power over all things. After this difficult situation, Uzair got up from his place, rode his donkey, and headed back to his village, not knowing what had happened there during the past hundred years. When Uzair arrived at his village, he did not know any of the people, and he did not know any of the people... and he did not even know the streets of the village. Everything had changed. Uzair started searching for his house until he found it after much effort and hardship. He knocked on the door while waiting to see his son, whom he had left a hundred years ago. He was twenty years old, and Uzair was forty years old at the time... He had left a twenty-year-old slave of his in the house.\n\nWhen he knocked on the door, no one answered him... So he knocked again and saw an old woman, one hundred and twenty years old, whose sight was blind, opening the door and saying: Who is at the door? Uzair said to her: O this, is Uzair’s house quieter? She said: Yes. And she cried. She said: I have not seen anyone for many years mention Uzair, and people have forgotten him. He said: For I am Uzair. She said: Glory be to God! We lost Ezair a hundred years ago, and we did not hear any mention of him! He said: I am Uzair. God had killed me for a hundred years, then He resurrected me! She said: For Uzair was a man who responded to prayers. He prayed for the sick and the afflicted with good health and recovery, so pray to God to restore my sight so that I can see you. If you are Uzair, I will know you. So he called upon his Lord, and wiped his hand over her eyes and she opened them, and he took her by the hand and said: Stand up, God willing. So God released her leg, and she stood upright, as if she had been energized by a headband. She looked at him and said: I bear witness that you are Uzair. So I went with him to the council where the people of the village were meeting... and then Ba’zair saw his son whom he had left a hundred years ago when he was twenty years old... he saw him now that he had reached the age of one hundred and twenty years... and Uzair was still at the age of forty, so his son became eighty years older than him!!! This woman said to them: This Uzair has come to you. So the people denied her and said: How is that, when our fathers told us that Ezra had died a hundred years ago in the land of Babylon? She said: I am your mistress, so-and-so. He prayed to his Lord for me, restored my sight, and set my feet free. He claimed that God had caused him to die for a hundred years, and then a resurrection. So the people got up and approached him, and his son looked at him and said: My father had a black mole between his shoulders! He uncovered his shoulders, and it was Uzair! The people of Israel were very happy. Because Ezra was the only one who had memorized the entire Torah. When he had been away from them for a hundred years, he (Bakhtasar) rose and burned the Torah for them, so nothing remained of it except what some men had memorized. Here the people rose and welcomed Uzair and asked him to write the entire Torah for them. He said to them: Wait, for my father had buried the Torah a few days ago (in brief) in a place that no one knows except me, so come with us and let us go there and bring the Torah.\n\nThey all set out until they reached that place with difficulty after the features of the village had changed... so they dug a hole and extracted the Torah, and they found its leaves had rotted and its features had changed, so they became very sad. All they had to do was ask Uzair to write the Torah for them again. So Uzair sat under the shade of a tree and the children of Israel sat around him. So he wrote the Torah for them again and lived with his people in goodness and happiness until he died and left this world."
  },
  {
    "number": "قصة فيل إبرهه ",
    "text": "",
    "label": "\nقال الله تعالى : (أَلَمْ تَرَ كَيْفَ فَعَلَ رَبُّكَ بِأَصْحَابِ الْفِيلِ (1) أَلَمْ يَجْعَلْ كَيْدَهُمْ فِي تَضْلِيلٍ (2) وَأَرْسَلَ عَلَيْهِمْ طَيْرًا أَبَابِيلَ (3) تَرْمِيهِمْ بِحِجَارَةٍ مِنْ سِجِّيلٍ (4) فَجَعَلَهُمْ كَعَصْفٍ مَأْكُولٍ (5)\n\nفي عام 571م كانت هناك محاولة لهدم الكعبة الشريفة من قبل أبرهة الحبشي، وقد خلد القرآن الكريم قصة هذه المحاولة وأسهبت المصادر التاريخية في الحديث عنها، وتفاصيل هذه القصة أنه بنى أبرهة كنسية بصنعاء، واسمها (القليس) وأراد أن يصرف حج العرب إليها بعد أن جعلها تحفة من تحف البناء والعمارة، ولا تقل روعة عن كنيسة أيا صوفيا في القسطنطينية؛ فثارت حفيظة العرب عليه، وأخذوا يضمرون الشر له ولكنيسته.\n\nوقد اختلفت الأقوال في السبب الذي أثار حفيظة أبرهة على العرب ورغبته في الانتقام منهم وهدم الكعبة؛ فقيل إن رجلا من أهل كنانة دخل القليس وعبث بأثاثها وقعد فيها ثم قام بتلطيخها بالقاذورات والأوساخ، فلما أخبر أبرهة بذلك وقيل له إن الذي انتهك حرمة القليس هو لرجل من أهل هذا البيت الذي تحجه العرب بمكة لما سمع بقولك إنك تريد أن تصرف حج العرب إلى بيتك هذا = غضب وأقسم ليسيرن إلى الكعبة حتى يهدمها، وليحملن العرب على أن يحجوا إلى كنيسته بالسيف. وقيل إن بعض العرب أججوا نارا فحملتها الريح إلى القليس وأحرقتها؛ مما أثار ثائرة أبرهة، وجعله يصمم على السير إلى مكة وهدم الكعبة ودكها دكا.\n\nوقد دفعه ذلك إلى تجهيز جيش كبير اختلف الرواة في عدده وتعداده، وأحضر معه فيلا ضخما كبير الجثة سمته الروايات (محمودا) بعثه نجاشي الحبشة إليه للقيام بتلك المهمة. والواقع أن الرواة أغفلوا حقائق مهمة؛ فليس منطقيا أن تقوم حملة كبيرة كهذه، وتقطع مئات الكيلو مترات بسبب قيام رجل بانتهاك حرمة القليس أو بإحراق جماعة من العرب لجزء منها، بل يجب أن يكون السبب أهم من ذلك وأكبر، وأن تكون فكرة غزو مكة هدفها أعمق من ذلك. فالحقيقة أن الدافع الرئيسي لذلك كان دافعا دينيا وسياسيا واقتصاديا معا! أما الدافع الديني فكان الرغبة في نشر النصرانية في بلاد العرب، وهدم الكعبة وتحويل حج العرب إلى كنيسة صنعاء، خصوصا أن النصارى وجدوا في الكعبة منافسا كبيرا أمامهم. والدافع السياسي فهو فرض السيطرة الحبشية على بلاد الحجاز بعد غزوها كما فرضت على اليمن؛ وذلك لتحقيق حلم الدولة البيزنطية بفرض سيطرتها على شبه الجزيرة العربية، وتكوين جبهة عسكرية مؤيدة من الأحباش من جهة، ومن الروم المقيمين في بلاد الشام من جهة أخرى بهدف التصدي لمحاولات الفرس التي كانت تستهدف أمن البحر الأحمر، ومن هنا وفقت بيزنطة بكل قوتها وراء هذا المشروع الخطير حتى تحقق نصرا سياسيا كبيرا.\n\nأما الدافع الاقتصادي فيرجع إلى أن اليمن بعد احتلال الاحباش لها قد فقدت دورها التقليدي في نقل التجارة العالمية يوم أن كانت تسيطر على باب المندب، وتملك أسطولا ضخما لنقل البضائع إلى بلدان الهند والصين وغيرها، يضاف إلى ذلك أن النزاع بين الفرس والروم قد أدى إلى إغلاق الطريق التجاري الشرقي المار ببلاد العراق إلى الشام، ومن ثم أصبح الطريق البري عبر تهامة والحجاز هو الطريق المفتوح أمام التجارة الشرقية، وكان على أهل مكة القيام بدور الوسيط لنقل التجارة بين الطرفين، ولما كانت هذه الوساطة التجارية تدر ربحا كبيرا على من يقوم بها فقد حاول الأحباش احتكار هذا المصدر الاقتصادي بالاستيلاء على مكة، وثم كانت حملة أبرهة. وعلى كل حال فعندما علم العرب بسوء نية أبرهة تجاه الكعبة خرجوا إليه لمنعه من ذلك، ولكن أبرهة تمكن من هزيمة كل من تعرض لحملته فهزم ذا نفر وأصحابه، وهزم قبيلتي خثعم، وهما شهران وناهس، وهزم غيرها من القبائل التي تعرضت له.\n\nولما تهيأ أبرهة لدخول مكة ومعه فيله الضخم وبعض الأفيال الأخرى، وذلك لهدم الكعبة بشد جدارها بالسلاسل المشدودة بالأفيال؛ توسل عبد المطلب إلى ربه وناجاه بأن يحفظ بيته وبيت خليله إبراهيم عليه السلام، وأن يمنع أبرهة من الاعتداء عليه، فحمى الله بيته العتيق من ذلك الطاغية الغاشم، ورد كيده إلى نحره؛ فلم يستطع جيش أبرهة أن يدخل مكة، وإنما توقف في وادي محسر؛ حيث برك الفيل الموجه لهدم الكعبة، وأبى أن يطأ حرم الله بغيا، فإذا وجهوه ناحية الشام أو اليمن أسرع في العدْو، وإذا وجهوه شطر الحرم برك، وحاولوا وأخفقوا، ثم أرسل الله تعالى على أبرهة وجيشه طيرا من البحر أمثال الخطاطيف والبلسان مع كل طائر منها ثلاثة أحجار يحملها؛ حجر في منقاره، وحجران في رجليه أمثال الحمص والعدس، لا تصيب منهم أحدا إلا هلك، فخرجوا يتساقطون بكل طريق ويهلكون بكل مهلك، وأصيب أبرهة في جسده، وتفشت الأمراض بين جنوده حتى هلك معظمهم، فكان عسكره يتساقطون موتى على الطريق وهم في عودتهم إلى اليمن!\n\nهذه كانت المعجزة الخارقة التي سبقت ميلاد رسول الله صلى الله عليه وسلم، وقد خلد الله تعالى هذا الحدث التاريخي في القرآن الكريم بقوله: (ألم تر كيف فعل ربك بأصحاب الفيل * ألم يجعل كيدهم في تضليل * وأرسل عليهم طيرا أبابيل * ترميهم بحجارة من سجيل * فجعلهم كعصف مأكول). وهكذا تدخلت العناية الإلهية لإنقاذ البيت العتيق، فكان للكعبة رب يحميها ويرد عنها كيد المعتدين، وتنتهي حملة أبرهة بفاجعة جعلتهم عبرة لمن يعتبر، وعظة لمن يتعظ. وبعد أن حمى الله تعالى مكة المكرمة من أصحاب الفيل ورد كيدهم إلى نحورهم ازدادت هيبتها في نفوس العرب وأصبح للقرشيين مكانة عظيمة بين القبائل العربية، وازدادت مكانتهم الدينية والتجارية، وإلى جانب ذلك أصبح العرب يؤرخون حوادثهم بعام الفيل، واستمرت الأمور على ذلك حتى جاءت الدعوة الإسلامية بعد أربعين عاما من هذه الحملة، وتحول بيت الله الحرام إلى كعبة المسلمين وقبلة لهم؛ حيث أزال الرسول عنه آثار الجاهلية، وأمر بطمس معالم الوثنية، وصار حرما آمنا لا يدخله مشرك.                     ",
    "number-en": "The story of Elephant Needle",
    "label-en": "God Almighty said: (Have you not seen how your Lord dealt with the companions of the elephant? (1) Did He not cause their scheming to lead astray? (2) And sent upon them flocks of birds (3) that drove them away. With stones of shale (4) Then He made them like edible straw (5)\n\nIn the year 571 AD, there was an attempt to demolish the Holy Kaaba by Abraha Al-Habashi. The Holy Qur’an has immortalized the story of this attempt, and historical sources have talked at length about it. The details of this story are that Abraha built a church in Sana’a. Its name is (Al-Qalis), and he wanted to divert the Arab pilgrimage to it after he made it a masterpiece of construction and architecture, no less magnificent than the Church of Hagia Sophia in Constantinople. The anger of the Arabs aroused against him, and they began to harbor evil against him and his church.\n\nThe opinions differed regarding the reason that aroused Abraha’s anger against the Arabs and his desire to take revenge on them and demolish the Kaaba. It was said that a man from the people of Kenana entered the hall, tampered with its furniture, sat in it, and then smeared it with filth and dirt. When Abraha was informed of this and was told that the one who violated the sanctity of the Qalis was a man from the people of this house to which the Arabs perform Hajj in Mecca, when he heard your statement that you want to divert the Arabs’ pilgrimage to this house of yours, he became angry and swore to march to the Kaaba until he demolished it, and to force the Arabs to perform Hajj to his church by the sword. It was said that some Arabs started a fire and the wind carried it to Al-Qalis and burned it. This angered Abraha, and made him resolve to march to Mecca, demolish the Kaaba, and destroy it. This prompted him to prepare a large army, the number of which the narrators differed in, and he brought with him a huge elephant with a large body, which the narratives called (Mahmoud), which Negashi of Abyssinia sent to him to carry out this mission. In fact, the narrators overlooked important facts. It is not logical for a large campaign like this to be launched, covering hundreds of kilometers, because of a man violating the sanctity of Al-Qulays or a group of Arabs burning part of it. Rather, the reason must be more important and greater than that, and the idea of ​​invading Mecca must have a deeper goal than that. The truth is that the main motive for this was religious, political, and economic together! As for the religious motive, it was the desire to spread Christianity in the Arab countries, demolish the Kaaba, and transfer the Arab pilgrimage to the Sana’a Church, especially since the Christians found in the Kaaba a great competitor to them. The political motive is to impose Abyssinian control on the country of Hijaz after its invasion, just as it was imposed on Yemen. This is to achieve the dream of the Byzantine state by imposing its control over the Arabian Peninsula, and to form a military front supported by the Abyssinians on the one hand, From the Romans residing in the Levant, on the other hand, with the aim of confronting the attempts of the Persians that were targeting the security of the Red Sea, and from here Byzantium lent all its might behind this dangerous project until it achieved a major political victory.\n\nAs for the economic motive, it is due to the fact that after the Abyssinians occupied it, Yemen lost its traditional role in transporting world trade when it controlled Bab al-Mandab and owned a huge fleet to transport goods to the countries of India, China and others. In addition, the conflict between the Persians and the Romans led to the closure of the eastern trade route passing through Iraq to the Levant, and then the land route through Tihama and the Hijaz became the route open to eastern trade, and the people of Mecca had to play the role of mediator to transfer trade between the two parties, and since this commercial mediation generated a huge profit for those who carried it out, the Abyssinians tried to monopolize this economic source by seizing Mecca, and then came the Abraha campaign. In any case, when the Arabs learned of Abrahah’s bad intentions towards the Kaaba, they went out to him to prevent him from doing so, but Abrahah was able to defeat everyone who was exposed to his campaign, so he defeated Dhu Nafar and his companions, and defeated the Khath’am tribes, namely Shahran and Nahis, and defeated the other tribes that attacked him.\n\nWhen Abraha prepared to enter Mecca with his huge elephant and some other elephants, in order to demolish the Kaaba by tightening its wall with chains attached to the elephants; Abdul Muttalib begged his Lord and pleaded with him to protect his house and the house of his friend Abraham, peace be upon him, and to prevent Abraha from attacking him. So God protected his ancient house from that brutal tyrant. He returned his plot to his slaughter; Abraha's army was unable to enter Mecca, but rather stopped in Wadi Muhassar. Where the elephant directed to demolish the Kaaba, and refused to tread on the sanctuary of God in transgression, so if they directed it towards the Levant or Yemen, it ran quickly, and if they directed it to bisect the sanctuary, it was blessed, and they tried and failed. Then God Almighty sent birds from the sea like hawksbills and plantains, with each bird carrying three stones; A stone in his beak, and two stones in his feet, are like chickpeas and lentils. You do not hit any of them without him perishing. So they came out, falling in every way and perishing in every fatal way, and Abraha was injured in his body. Diseases spread among his soldiers until most of them died, and his soldiers were falling dead on the road on their return to Yemen!\n\nThis was the extraordinary miracle that preceded the birth of the Messenger of God, may God bless him and grant him peace, and God Almighty immortalized this historical event in the Holy Qur’an by saying: (Have you not seen how your Lord dealt with the companions of the elephant? Did He not cause their plots to lead astray? And sent upon them flocks of birds that pelted them with stones of shale. Then He made them like consuming chaff.) Thus, divine providence intervened to save the ancient house, so the Kaaba had a Lord who would protect it and ward off the plots of the aggressors, and Abraha’s campaign ended with a tragedy that made them an example for those who consider it, and a sermon for those who learn. After God Almighty protected Mecca from the owners of the elephant and turned their plots back to their throats, its prestige increased in the souls of the Arabs, and the Quraishites gained a great status among the Arab tribes, and their religious and commercial status increased. In addition to that, the Arabs began to date their incidents with the Year of the Elephant, and things continued like this until the Islamic call came forty years after this campaign. The Sacred House of God was transformed into the Kaaba and Qibla for Muslims. Where the Messenger removed the traces of pre-Islamic times from it, and ordered the obliteration of the signs of paganism, and it became a safe sanctuary that no polytheist would enter."
  }
]