[
  {
    "number": "قصة خديجة بنت خُويلد",
    "text": "",
    "label": "نسبها ونشأتها :\n\nهي خديجة بنت خويلد بن أسد بن عبد العزى قصي بن كلاب القرشية الأسدية ، ولدت سنة 68 قبل الهجرة (556 م). تربت وترعرعت في بيت مجد ورياسة، نشأت على الصفات والأخلاق الحميدة، عرفت بالعفة والعقل والحزم حتى دعاها قومها في الجاهلية بالطاهرة ، وكانت السيدة خديجة تاجرة، ذات مال، تستأجر الرجال وتدفع المال مضاربة، وقد بلغها عن رسول الله صلى الله عليه و سلم أنه كان صادق أمين، كريم الأخلاق، فبعثت إليه وطلبت منه أن يخرج في تجارة لها إلى الشام مع غلام لها يقال له ميسرة. وقبل رسول الله صلى الله عليه وسلم ، وربحت تجارتها ضعف ما كانت تربح. أخبر الغلام ميسرة السيدة خديجة عن أخلاق رسول الله صلى الله عليه و سلم ، فدست له من عرض عليه الزواج منها، فقبل الرسول صلى الله عليه وسلم ، فأرسلت السيدة خديجة إلى عمها عمرو بن أسعد بن عبد العزى، فحضر وتزوجها رسول الله صلى الله عليه وسلم ، وكان لها من العمر أربعين سنة ولرسول الله صلى الله عليه و سلم خمس وعشرون سنة.\n\nالسيدة خديجة - رضي الله عنها - كانت أول امرأة تزوجها الرسول ، صلى الله عليه وسلم، وكانت أحب زوجاته إليه، ومن كرامتها أنها لم يتزوج عليها غيرها حتى ماتت [. أنجبت له ولدين وأربع بنات وهم: القاسم (وكان يكنى به)، وعبد الله ، ورقية وزينب وأم كلثوم وفاطمة .\n\nإسلامها :\n\nعندما بعث الله – سبحانه وتعالى – النبي صلى الله عليه و سلم كانت السيدة خديجة – رضي الله عنها- هي أول من آمن بالله ورسوله، وأول من أسلم من النساء والرجال، وكان رسول الله صلى الله عليه وسلم والسيدة خديجة يصليان سراً إلى أن ظهرت الدعوة. تلقى رسول الله صلى الله عليه و سلم كثيراً من التعذيب والتكذيب من قومه، فكانت السيدة خديجة رضي الله عنها تخفف عنه وتهون عليه ما يلقى من أكاذيب المشركين من قريش. وعندما انزل الله – سبحانه وتعالى – الوحي على الرسول - صلى الله عليه وسلم -قال له ( اقرأ بسم ربك الذي خلق) فرجع بها ترجف بوادره ، حتى دخل على خديجة ، فقال : ( زملوني زملوني ) . فزملوه حتى ذهب عنه الروع ، فقال : ( يا خديجة ، ما لي ) . وأخبرها الخبر ، وقال : ( قد خشيت على نفسي ) . فقالت له : كلا ، أبشر ، فوالله لا يخزيك الله أبدا ، إنك لتصل الرحم ، وتصدق الحديث ، وتحمل الكل ، وتقري الضيف ، وتعين على نوائب الحق . ثم انطلقت به خديجة حتى أتت به ورقة بن نوفل بن أسد ابن عبد العزى بن قصي ، وهو ابن عم خديجة أخي أبيها ، وكان امرأ تنصر في الجاهلية ، وكان يكتب الكتاب العربي ، فيكتب بالعربية من الإنجيل ما شاء الله أن يكتب ، وكان شيخا كبيرا قد عمي ، فقالت له خديجة : أي ابن عم ، اسمع من ابن أخيك ، فقال ورقة : ابن أخي ماذا ترى ؟ فأخبره النبي صلى الله عليه وسلم ما رأى ، فقال ورقة : هذا الناموس الذي أنزل على موسى ، يا ليتني فيها جذعا ، أكون حيا حين يخرجك قومك . فقال رسول الله صلى الله عليه وسلم : ( أو مخرجي هم ) . فقال ورقة : نعم ، لم يأت رجل قط بمثل ما جئت به إلا عودي ، وإن يدركني يومك أنصرك نصرا مؤزرا . ثم لم ينشب ورقة أن توفي ، وفتر الوحي فترة حتى حزن النبي صلى الله عليه وسلم ، فيما بلغنا ، حزنا غدا منه مرارا كي يتردى من رؤوس شواهق الجبال ، فكلما أوفى بذروة جبل لكي يلقي منه نفسه تبدى له جبريل ، فقال : يا محمد ، إنك رسول الله حقا . فيسكن لذلك جأشه ، وتقر نفسه ، فيرجع ، فإذا طالت عليه فترة الوحي غدا لمثل ذلك ، فإذا أوفى بذروة جبل تبدى له جبريل فقال له مثل ذلك\n\nالراوي: عائشة - خلاصة الدرجة: [صحيح] - المحدث: البخاري - المصدر: الجامع الصحيح - الصفحة أو الرقم: 6982\n\nمنزلتها عند رسول الله :\n\nكانت السيدة خديجة امرأة عاقلة، جليلة، دينة، مصونة، كريمة، من أهل الجنة، فقد أمر الله – تعالى – رسوله أن يبشرها في الجنة ببيت من قصب لا صخب فيه ولا نصب.\n\nكان رسول الله صلى الله عليه وسلم يفضلها على سائر زوجاته، وكان يكثر من ذكرها بحيث أن عائشة كانت تقول : ((ما غرت على أحد من نساء النبي صلى الله عليه وسلم ما غرت على خديجة ، وما رأيتها ، ولكن كان النبي صلى الله عليه وسلم يكثر ذكرها ، وربما ذبح الشاة ، ثم يقطعها أعضاء ، ثم يبعثها في صدائق خديجة ، فربما قلت له : كأنه لم يكن في الدنيا امرأة إلا خديجة ، فيقول : ( إنها كانت ، وكانت ، وكان لي منها ولد )\n\nالراوي: عائشة - خلاصة الدرجة: [صحيح] - المحدث: البخاري - المصدر: الجامع الصحيح - الصفحة أو الرقم: 3818\n\nوقالت عائشة رضي الله عنها : ((كان إذا ذكر خديجة ؛ أثنى عليها فأحسن الثناء . قالت [ عائشة] : فغرت يوما فقلت : ما أكثر ما تذكر حمراء الشدق ، قد أبدلك الله خيرا منها ! قال : ما أبدلني الله خيرا منها ؛ قد آمنت بي إذ كفر بي الناس ، وصدقتني إذ كذبني الناس ، وواستني بمالها إذ حرمني الناس ، ورزقني الله عز وجل ولدها إذ حرمني أولاد النساء\n\nالراوي: عائشة - خلاصة الدرجة: إسناده حسن - المحدث: الهيثمي - المصدر: مجمع الزوائد - الصفحة أو الرقم: 9/227\n\nوفاتها :\n\nتوفيت السيدة خديجة ساعد رسول الله الأيمن في بث دعوة الإسلام قبل هجرته إلى المدينة المنورة بثلاثة سنوات، ولها من العمر خمس وستون سنة، وأنزلها رسول الله بنفسه في حفرتها وأدخلها القبر بيده، وكانت وفاتها مصيبة كبيرة بالنسبة للرسول - صلى الله عليه وسلم- تحملها بصبر وجأش راضياً بحكم الله – سبحانه وتعالى.",
    "number-en": "The story of Khadija bint Khuwaylid",
    "label-en": "Her lineage and upbringing:\n\nShe is Khadija bint Khuwaylid bin Asad bin Abd al-Uzza Qusay bin Kilab al-Qurayshi al-Asadi. She was born in the year 68 before the Hijra (556 AD). She was raised and raised in a house of glory and leadership. She was brought up with good qualities and morals. She was known for her chastity, reason, and firmness until her people in pre-Islamic times called her pure. Mrs. Khadija was a merchant with money. She hired men and paid the money in speculation. She had heard from the Messenger of God, may God’s prayers and peace be upon him, that he was truthful, trustworthy, and of noble morals. So she sent to him and asked him to go out to do business for her in the Levant with a boy of hers called Maysarah. The Messenger of God, may God bless him and grant him peace, accepted, and her business profited double what she had previously earned. The boy, Maysarah, told Mrs. Khadija about the morals of the Messenger of God, may God bless him and grant him peace, so she approached him with someone who offered to marry her, and the Messenger, may God bless him and grant him peace, accepted. So Mrs. Khadija sent to her uncle Amr bin Asad bin Abdul Uzza, and he came and married her to the Messenger of God, may God bless him and grant him peace. She was forty years old and the Messenger of God, may God bless him and grant him peace, was twenty-five years old. Mrs. Khadija - may God be pleased with her - was the first woman whom the Messenger, may God bless him and grant him peace, married, and she was the most beloved of his wives, and part of her dignity was that he did not marry anyone else until she died [. She gave birth to him two sons and four daughters: Al-Qasim (who was nicknamed him), Abdullah, Ruqayyah, Zainab, Umm Kulthum, and Fatima.\n\nHer conversion to Islam:\n\nWhen God - Glory be to Him - the Most High - sent the Prophet, may God bless him and grant him peace, Mrs. Khadija - may God be pleased with her - was the first to believe in God and His Messenger, and the first of women and men to convert to Islam. The Messenger of God, may God bless him and grant him peace, and Mrs. Khadija were praying in secret until the call appeared. The Messenger of God, may God’s prayers and peace be upon him, received a lot of torture and denial from his people. Lady Khadija, may God be pleased with her, used to comfort him and make light of the lies he received from the polytheists from Quraysh. When God - Glory be to Him - the Most High - revealed the revelation to the Messenger - may God bless him and grant him peace - he said to him (Read in the name of your Lord who created), so he returned with it, trembling, until he entered upon Khadija, and said: (Help me, comfort me). They hugged him until he lost his fear, and he said: (O Khadija, what is wrong with me?) He told her the news and said: “I feared for myself.” She said to him: No, give good news, for by God, God will never disgrace you. You will uphold ties of kinship, speak truthfully, bear all things, honor guests, and help in the calamities of truth. Then Khadija set off with him until Waraqah ibn Nawfal ibn Asad ibn Abd al-Uzza ibn Qusayy, who was Khadija’s cousin, her father’s brother, was a man who had converted to Christianity during pre-Islamic times. He used to write Arabic books, writing in Arabic from the Bible whatever God wished for him to write. He was an old man who had become blind. Khadija said to him: Yes, cousin, listen to your nephew. Waraqah said: My brother’s son, what do you see? So the Prophet, may God’s prayers and peace be upon him, told him what he saw, and Waraqah said: This is the law that was revealed to Moses. I wish I were alive there, so that I would be alive when your people expel you. Then the Messenger of God, may God bless him and grant him peace, said: (Or my directors are them). Waraqah said: Yes, no man has ever come with anything like what you have come with, except come back, and if your day comes to me, I will support you with a strong victory. Then Waraqah did not arise until he died, and the revelation waned for a while until the Prophet, may God’s prayers and peace be upon him, became sad, as we have been told, a sadness that began to fall repeatedly from the tops of the highest mountains. Whenever he reached the peak of a mountain in order to throw himself from it, Gabriel appeared to him and said: O Muhammad, you are truly the Messenger of God. Therefore, his anxiety will calm down, and his soul will be calm, so he will return, and if the period of revelation lasts for a long time, tomorrow will be like this. When he reached the peak of a mountain, Gabriel appeared to him and told him the same\n\nNarrator: Aisha - Summary of degree: [Sahih] - Narrator: Al-Bukhari - Source: Al-Jami’ Al-Sahih - Page or number: 6982\n\nHer status with the Messenger of God:\n\nMrs. Khadija was a sane, venerable, religious, pious, and generous woman, one of the people of Paradise. God Almighty commanded His Messenger to give her good tidings in Paradise of a house made of reeds without noise or hardship. The Messenger of God, may God’s prayers and peace be upon him, preferred her to all of his wives, and he mentioned her frequently, to the point that Aisha used to say: “I have never been more jealous of any of the wives of the Prophet, may God’s prayers and peace be upon him, than I have been more jealous of Khadija, and I have not seen her. But the Prophet, may God’s prayers and peace be upon him, mentioned her often, and he might have slaughtered a sheep, then cut off its limbs, and then sent them to Khadija’s friends. I might have said to him: It is as if there was no woman in this world except Khadija.” He says: (It was, and it was, I had a son by her)\n\nNarrator: Aisha - Summary of degree: [Sahih] - Narrator: Al-Bukhari - Source: Al-Jami’ Al-Sahih - Page or number: 3818\n\nAisha, may God be pleased with her, said: “Whenever he mentioned Khadija, he praised her and praised her very well. She [Aisha] said: One day I became surprised and said: How often do you mention the redness of the cheeks? God has replaced you with something better than her! He said: God has not given me anything better than her. She believed in me when people disbelieved in me, and she believed me when people disbelieved in me, and she consoled me with her money when people deprived me of it, and God Almighty blessed me with her son when he deprived me of women’s children.\n\nNarrator: Aisha - Summary of the degree: Its chain of transmission is Hasan - Narrator: Al-Haythami - Source: Majma’ al-Zawa’id - Page or number: 9/227\n\nHer death:\n\nLady Khadija, the right hand assistant of the Messenger of God in spreading the message of Islam, died three years before his migration to Medina. She was sixty-five years old, and the Messenger of God himself lowered her into her pit and entered her grave with his hand. Her death was a great calamity for the Messenger - may God bless him and grant him peace. He endured it with patience and determination, content with the judgment of God - Glory be to Him."
  },
  {
    "number": "قصة سودة بنت زَمعة",
    "text": "",
    "label": "اسمها ونسبها :\n\nأول امرأة تزوجها الرسول بعد خديجة وبها نزلت آية الحجاب\n\nهي أم المؤمنين سوده بنت زمعة بن قيس بن عبد ود ابن نصر بن مالك بن حسل بن عامر بن لؤي القرشية العامرية، وأمها الشمّوس بنت قيس بن زيد بن عمر الأنصارية.\n\nإسلامها :\n\nكانت سيدة جليلة نبيلة ضخمة، من فواضل نساء عصرها. كانت قبل أن يتزوجها رسول الله صلى الله عليه وسلم تحت ابن عم لها يقال له: السكران بن عمرو، أخي سهيل بن عمرو العامري. ولما أسلمت بايعت النبي صلى الله عليه وسلم وأسلم معها زوجها السكران وهاجرا جميعاً إلى أرض الحبشة، وذاقت الويل في الذهاب معه والإياب حتى مات عنها وتركها حزينة مقهورة لا عون لها ولا حرفة وأبوها شيخ كبير.\n\nزواجها :\n\nفي حديث لعائشة عن خولة بنت حكيم، أن خولة بنت حكيم السلمية رفيقة سودة في الهجرة إلى الحبشة وزوجها عثمان بن مظعون لما عرض على رسول الله صلى الله عليه وسلم بعائشة رضي الله عنها: أنها صغيرة ويريد من هي أكبر سناً لتدبير شؤون بيته ورعاية فاطمة الزهراء.\n\nفعرضت الزواج من سوده بنت زمعة، فهي امرأة كبيرة وواعية، رزان ومؤمنة، وأن جاوزت صباها وخلت ملامحها من الجمال. ولم تكد خولة تتم كلامها حتى أثنى عليها الرسول صلى الله عليه وسلم- فأتى فتزوجها.\n\nتزوج النبي صلى الله عليه وسلم- بسودة ولديها ستة أبناء وكان زواجها في رمضان في السنة العاشرة من النبوة، بعد وفاة خديجة بمكة، وقيل: سنة ثمانية للهجرة على صداق قدره أربعمائة درهم، وهاجر بها إلى المدينة.\n\nفضلها :\n\nتعد السيدة سودة – رضي الله عنها - من فواضل نساء عصرها، أسلمت وبايعت النبي صلى الله عليه وسلم ، وهاجرت إلى أرض الحبشة. تزوج بها الرسول صلى الله عليه وسلم ، عرفت بالصلاح والتقوى، روت عن النبي أحاديث كثيرة وروى عنها الكثير. ونزلت بها آية الحجاب.\n\nصفاتها :\n\nلما دخلت عائشة رضي الله عنها بيت الرسول صلى الله عليه وسلم زوجة محبوبة تملأ العين بصباها ومرحها وذكائها، شاءت سودة أن تتخلى عن مكانها في بيت محمد صلى الله عليه وسلم فهي لم تأخذ منه إلا الرحمة والمكرمة، وهذه عائشة يدنيها من الرسول المودة والإيثار والاعتزاز بأبيها، وملاحة يهواها الرجل.\n\nوقد أنس الرسول محمد صلى الله عليه وسلم بمرحها وصباها في بيته فانقبضت سودة وبدت في بيت زوجها كالسجين، ولما جاءها الرسول صلى الله عليه وسلم يوماً وسألها إن كانت تريد تسريحاً، وهو يعلم أن ليس لها في الزواج مأرب إلا الستر والعافية وهما في عصمة الرسول ونعمة الله، قالت سودة وقد هدأت بها غيرة الأنثى: يا رسول الله مالي من حرص على أن أكون لك زوجة مثل عائشة فأمسكني، وحسبي أن أعيش قريبة منك، أحب حبيبك وأرضى لرضاك.\n\nووطدت سوده نفسها على أن تروض غيرتها بالتقوى، وأن تسقط يومها لعائشة وتؤثرها على نفسها، وبعد أن تزوج الرسول صلى الله عليه وسلم بحفصة بنت عمر جبراً لخاطرها المكسور بعد وفاة زوجها وسنها لم يتجاوز الثامنة عشر، هانت لدى سودة الحياة مع ضرتين ندتين كلتاهما تعتز بأبيها، ولكنها كانت أقرب لعائشة ترضيها لمرضاة زوجها.\n\nعن هشام، عن ابن سيرين: أن عمر رضي الله عنه- بعث إلى سودة بفرارة دراهم، فقالت: في الغرارة مثل التمر، يا جارية: بلغيني الفتح، ففرقتها.\n\nأعمالها :\n\nروت السيدة سودة – رضي الله عنها- خمسة أحاديث، وروى عنها عبدالله بن عباس ويحيى بن عبدالله بن عبد الرحمن بن سعدين زاره الأنصاري. وروى لها أبو داود والنسائي وخرج لها البخاري.\n\nوفاتها :\n\nتوفيت السيدة سودة في آخر زمن عمر بن الخطاب، ويقال إنها توفيت بالمدينة المنورة في شوال سنة أربعة وخمسون، وفي خلافة معاوية.                      ",
    "number-en": "The story of Sawda bint Zam’a",
    "label-en": "Her name and lineage:\n\nThe first woman the Messenger married after Khadija, and with her the verse about the hijab was revealed\n\nShe is the Mother of the Believers Sawda bint Zam`ah bin Qais bin Abd Wad bin Nasr bin Malik bin Hasal bin Amer bin Luay al-Qurashiyah al-Amiriyah, and her mother is al-Shammus bint Qais bin Zaid bin Omar al-Ansariyya.\n\nHer conversion to Islam:\n\nShe was a great, noble and huge lady, one of the virtuous women of her time. Before the Messenger of God, may God bless him and grant him peace, married her, she was married to a cousin of hers called: Al-Sakran bin Amr, the brother of Suhail bin Amr Al-Amiri. When she converted to Islam, she pledged allegiance to the Prophet, may God bless him and grant him peace, and her drunken husband embraced Islam with her, and they all immigrated to the land of Abyssinia, and she tasted woe going with him and coming back until he died on her behalf, leaving her sad and oppressed, with no help or work, and her father being an old man.\n\nHer marriage:\n\nIn a hadith of Aisha on the authority of Khawla bint Hakim, that Khawla bint Hakim al-Salamiyya was Sawda’s companion in the migration to Abyssinia and her husband, Othman bin Mazun, when he presented Aisha, may God be pleased with her, to the Messenger of God, may God bless him and grant him peace, saying that she was young and he wanted someone older to manage the affairs of his household and take care of Fatima al-Zahra.\n\nShe offered to marry Sawda bint Zam’a, as she was an old and wise woman, sober and faithful, even though she was past her youth and her features were devoid of beauty. Khawla had hardly finished her words when the Messenger, may God bless him and grant him peace, praised her and went and married her.\n\nThe Prophet, may God’s prayers and peace be upon him, married Sawda, who has six children. Her marriage was in Ramadan, in the tenth year of the Prophethood, after the death of Khadija in Mecca, and it was said: the eighth year of the Hijra, on a dowry of four hundred dirhams, and he immigrated with her to Medina.\n\nHer virtue:\n\nMrs. Sawda - may God be pleased with her - is considered one of the virtuous women of her time. She converted to Islam and pledged allegiance to the Prophet, may God bless him and grant him peace, and immigrated to the land of Abyssinia. The Messenger, may God bless him and grant him peace, married her. She was known for her righteousness and piety. She narrated many hadiths from the Prophet and many others narrated about her. The verse about the hijab was revealed with it.\n\nIts characteristics:\n\nWhen Aisha, may God be pleased with her, entered the house of the Messenger, may God bless him and grant him peace, as a beloved wife who filled the eye with her youth, joy, and intelligence, Sawda wanted to give up her place in the house of Muhammad, may God bless him and grant him peace, as she had received nothing from him except mercy and generosity. This Aisha was brought close to the Messenger by affection, altruism, pride in her father, and a gentleness that the man loved.\n\nThe Messenger Muhammad, may God’s prayers and peace be upon him, enjoyed her fun and her youth in his house, so Sawda became withdrawn and looked like a prisoner in her husband’s house. When the Messenger, may God’s prayers and peace be upon him, came to her one day and asked her if she wanted to be released, knowing that she had no goal in marriage except protection and well-being, which are under the protection of the Messenger and the grace of God, Sawda said, calmed by the female’s jealousy: O Messenger of God, I have no desire to have a wife like Aisha for you. So hold me, and it is enough for me to live close to you, love your beloved, and be satisfied with your satisfaction.\n\nSawda determined herself to tame her jealousy with piety, and to give up her day to Aisha and give her preference over herself. After the Messenger, may God bless him and grant him peace, married Hafsa bint Omar to make up for her broken heart after the death of her husband when she was only eighteen, Sawda’s life was easy with two equal co-wives, both of whom were proud of her father, but she was closer to Aisha, pleasing her to please her husband.\n\nOn the authority of Hisham, on the authority of Ibn Sirin: Omar, may God be pleased with him, sent Sawda with a ransom of dirhams, and she said: In the ghararah there is something like dates, O slave woman: convey to me the conquest, so she dispersed it.\n\nHer works:\n\nMrs. Sawda - may God be pleased with her - narrated five hadiths, and Abdullah bin Abbas and Yahya bin Abdullah bin Abdul Rahman bin Saadin Zarah Al-Ansari narrated from them. Abu Dawud and Al-Nasa’i narrated it, and Al-Bukhari narrated it.\n\nHer death:\n\nMrs. Sawda died at the end of the time of Omar bin Al-Khattab, and it is said that she died in Medina in Shawwal of the year fifty-four, during the caliphate of Muawiyah."
  },
  {
    "number": "قصة عائشة بنت أبى بكر الصديق",
    "text": "",
    "label": "السيدة عائشة (رضي الله عنها) هو ما لهذه الإنسانة من عقل نير، وذكاء حاد ، وعلم جم. ولدورها الفعال في خدمة الفكر الإسلامي من خلال نقلها لأحاديث رسول الله وتفسيرها لكثير من جوانب حياة الرسول صلى الله عليه و سلم واجتهاداتها . وهي كذلك المرأة التي تخطت حدود دورها كامرأة لتصبح معلمة أمة بأكملها ألا وهي الأمة الإسلامية. لقد كانت (رضي الله عنها) من أبرع الناس في القرآن والحديث و الفقه، فقد قال عنها عروة بن الزبير (( ما رأيت أحداً أعلم بالقرآن ولا بفرائضه ولا بحلال ولا بحرام ولا بشعر ولا بحديث عرب ولا بنسب من عائشة)). 1\n\nوفي هذه النقطة البحثية تطرقت إلى ثلاث مجالات تميزت فيهم السيدة عائشة وهي :\n\n1. علمها وتعليمها .\n\n2. السيدة المفسرة المحدثة.\n\n3. السيدة الفقيهه .\n\nوقد اخترت هذه المجالات ؛ لأهميتها ولأثرها الواضح في المجتمع والفكر الإسلامي، فهي (رضي الله عنها) بعلمها ودرايتها ساهمت بتصحيح المفاهيم، والتوجيه لإتباع سنة رسول الله صلى الله عليه وسلم . فقد كان أهل العلم يقصدونها للأخذ من علمها الغزير، فأصبحت بذلك نبراساً منيراً يضيء على أهل العلم وطلابه.تلكم هي عائشة بنت أبي بكر الصديق زوجة رسول الله وأفقه نساء المسلمين وأعلمهن بالقرآن والحديث والفقه. ولدت بمكة المكرمة في العام الثامن قبل الهجرة ، تزوجها الرسول صلى الله عليه وسلم في السنة الثانية للهجرة، فكانت أكثر نسائه رواية لأحاديثه.\n\nكانت من أحب نساء الرسول إليه، وتحكي (رضي الله عنها) عن ذلك فتقول ((قالت عائشة لنساء النبي صلى الله عليه وسلم : فضلت عليكن بعشر ولا فخر : كنت أحب نسائه إليه وكان أبي أحب رجاله إليه ، وابتكرني ولم يبتكر غيري ، وتزوجني لسبع ، وبنى بي لتسع ، ونزل عذري من السماء واستأذن النبي صلى الله عليه وسلم نساءه في مرضه ، فقال : إنه ليشق علي الاختلاف بينكن فائذن لي أن أكون عند بعضكن . فقالت أم سلمة : قد عرفنا من تريد عائشة . أذنا لك ، وكان آخر زاده من الدنيا ريقي ، أتي بسواك ، فقال : انكثيه ياعائشة . فنكثته وقبض بين حجري ونحري ، ودفن في بيتي )).\n\nالراوي: عبدالملك بن عمير - خلاصة الدرجة: إسناده صالح ، ولكن فيه انقطاع - المحدث: الذهبي - المصدر: سير أعلام النبلاء - الصفحة أو الرقم: 2/147\n\nتوفيت(رضي الله عنها) في الثامنة والخمسين للهجرة.\n\n\nعلمها وتعليمها :\n\nتعد عائشة (رضي الله عنها) من أكبر النساء في العالم فقهاً وعلماً، فقد أحيطت بعلم كل ما يتصل بالدين من قرآن وحديث وتفسير وفقه. وكانت (رضي الله عنها) مرجعاً لأصحاب رسول الله عندما يستعصي عليهم أمر، فقد كانوا (رضي الله عنهم) يستفتونها فيجدون لديها حلاً لما أشكل عليهم. حيث قال أبو موسى الأشعري : ((ما أشكل علينا –أصحاب رسول الله صلى الله عليه و سلم حديث قط، فسألنا عائشة إلا وجدنا عندها منه علماً)) .\n\nوقد كان مقام السيدة عائشة بين المسلمين مقام الأستاذ من تلاميذه، حيث أنها إذا سمعت من علماء المسلمين والصحابة روايات ليست على وجهها الصحيح،تقوم بالتصحيح لهم وتبين ما خفي عليهم، فاشتهر ذلك عنها ، وأصبح كل من يشك في رواية أتاها سائلاً.\n\nلقد تميزت السيدة بعلمها الرفيع لعوامل مكنتها من أن تصل إلى هذه المكانة، من أهم هذه العوامل:\n\n- ذكائها الحاد وقوة ذاكرتها، وذلك لكثرة ما روت عن النبي صلى الله عليه و سلم .\n\n- زواجها في سن مبكر من النبي صلى الله عليه و سلم، ونشأتها في بيت النبوة، فأصبحت (رضي الله عنها) التلميذة النبوية.\n\n- كثرة ما نزل من الوحي في حجرتها، وهذا بما فضلت به بين نساء رسول الله.\n\n- حبها للعلم و المعرفة، فقد كانت تسأل و تستفسر إذا لم تعرف أمراً أو استعصى عليها مسائلة، فقد قال عنها ابن أبي مليكة ((كانت لا تسمع شيئا لا تعرفه إلا راجعت فيه حتى تعرفه)).\n\nونتيجة لعلمها وفقهها أصبحت حجرتها المباركة وجهة طلاب العلم حتى غدت هذه الحجرة أول مدارس الإسلام وأعظمها أثر في تاريخ الإسلام. وكانت (رضي الله عنها) تضع حجاباً بينها وبين تلاميذها، وذلك لما قاله مسروق((سمعت تصفيقها بيديها من وراء الحجاب)).\n\nلقد اتبعت السيدة أساليب رفيعة في تعليمها متبعة بذلك نهج رسول الله في تعليمه لأصحابه. من هذه الأساليب عدم الإسراع في الكلام وإنما التأني ليتمكن المتعلم من الاستيعاب، . فقد قال عروة إن السيدة عائشة قالت مستنكرة((ألا يعجبك أبو هريرة جاء فجلس إلى جانب حجرتي يحدّث عن رسول الله صلى الله عليه و سلم يسمعني ذلك، وكنت أسبِّح-أصلي-فقام قبل أن أقضي سبحتي، ولو أدركته لرددت عليه، إن رسول الله صلى الله عليه و سلم لم يكن يسرد الحديث كسردكم.\n\nكذلك من أساليبها في التعليم، التعليم أحياناً بالإسلوب العملي، وذلك توضيحاً للأحكام الشرعية العملية كالوضوء. كما أنها كانت لا تتحرج في الإجابة على المستفتي في أي مسائلة من مسائل الدين ولو كانت في أدق مسائل الإنسان الخاصة. كذلك لاحظنا بأن السيدة عائشة كانت تستخدم الإسلوب العلمي المقترن بالأدلة سواء كانت من الكتاب أو السنة. ويتضح ذلك في رواية مسروق حيث قال((كنت متكئا عند عائشة . فقالت : يا أبا عائشة ! ثلاث من تكلم بواحدة منهن فقد أعظم على الله الفرية . قلت : ما هن ؟ قالت : من زعم أن محمدا صلى الله عليه وسلم رأى ربه فقد أعظم على الله الفرية . قال وكنت متكئا فجلست . فقلت : يا أم المؤمنين ! أنظريني ولا تعجليني . ألم يقل الله عز وجل :{ولقد رآه بالأفق المبين}[ 81 / التكوير / الآية - 23]{ولقد رآه نزلة أخرى}[ 53 / النجم / الآية - 13] فقالت : أنا أول هذه الأمة سأل عن ذلك رسول الله صلى الله عليه وسلم . فقال : \" إنما هو جبريل . لم أره على صورته التي خلق عليها غير هاتين المرتين . رأيته منهبطا من السماء . سادا عظم خلقه ما بين السماء إلى الأرض )\n\nالراوي: عائشة - خلاصة الدرجة: صحيح - المحدث: مسلم - المصدر: المسند الصحيح - الصفحة أو الرقم: 177\n\nفقالت: أنا أول هذه الأمة سأل عن ذلك رسول الله صلى الله عليه وسلم ،فقال: ( إنما هو جبريل )) الراوي: عبدالله بن مسعود و عائشة - خلاصة الدرجة: صح عن عائشة وابن مسعود - المحدث: ابن القيم - المصدر: زاد المعاد - الصفحة أو الرقم: 3/33 \nفقالت: أولم تسمع أن الله يقول:( لا تدركه الأبصار وهو يدرك الأبصار وهو اللطيف الخبير) أو لم تسمع أن الله يقول:(وما كان لبشر أن يكلمه الله إلا وحيا أو من وراء حجاب أو يرسل رسولاً فيوحي بإذنه ما يشاء إنه عليٌ حكيم).\n\nقالت: ومن زعم أن رسول الله صلى الله عليه و سلم كتم شيئا من كتاب الله فقد أعظم على الله الفرية ، و الله يقول: ( يا أيها الرسول بلغ ما أنزل إليك من ربك وإن لم تفعل فما بلغت رسالته ). قالت: ومن زعم أنه يخبر بما يكون في غد فقد أعظم على الله الفرية ، والله يقول ( قل لا يعلم من في السماوات و الأرض الغيب إلا الله ))\n\nوبذلك يتضح لنا بأن السيدة عائشة (رضي الله عنها)كانت معقلاً للفكر الإسلامي، وسراجاً يضيء على طلاب العلم. ولذكائها و حبها للعلم كان النبي صلى الله عليه و سلم يحبها ويؤثرها حيث قال:(( وإن فضل عائشة على النساء كفضل الثريد على سائر الطعام)).\n\nالسيدة المفسرة المحدثة\n\nكانت السيدة عائشة (رضي الله عنها) عالمة مفسرة ومحدثة، تعلم نساء المؤمنين،ويسألها كثير من الصحابة في أمور الدين،فقد هيأ لها الله سبحانه كل الأسباب التي جعلت منها أحد أعلام التفسير والحديث. وإذا تطرقنا إلى دورها العظيم في التفسير فإننا نجد أن كونها ابنة أبو بكر الصديق هو أحد الأسباب التي مكنتها من احتلال هذه المكانة في عالم التفسير، حيث أنها منذ نعومة أظافرها وهي تسمع القرآن من فم والدها الصديق، كما أن ذكائها و قوة ذاكرتها سبب آخر،ونلاحظ ذلك من قولها:(( لقد نزل بمكة على محمد صلى الله عليه و سلم وإني لجارية ألعب (بل الساعة موعدهم والساعة أدهى وأمر) وما نزلت سورة البقرة والنساء إلا وأنا عنده)).\n\nومن أهم الأسباب إنها كانت تشهد نزول الوحي على رسول الله، وكانت(رضي الله عنها)تسأل الرسول عن معاني القرآن الكريم وإلى ما تشير إليه بعض الآيات.فجمعت بذلك شرف تلقي القرآن من النبي صلى الله عليه و سلم فور نزوله وتلقي معانيه أيضا من رسول الله. وقد جمعت (رضي الله عنها) إلى جانب ذلك كل ما يحتاجه المفسر كقوتها في اللغة العربية وفصاحة لسانها و علو بيانها.\n\nكانت السيدة تحرص على تفسير القرآن الكريم بما يتناسب وأصول الدين وعقائده، ويتضح ذلك في ما قاله عروة يسأل السيدة عائشة عن قوله تعالى(( حتى إذا استيأس الرسل و ظنوا أنهم قد كُذِبُوا جاءهم نصرنا…)) قلت: أ كُذِبُوا أم كُذِّبُوا؟ قالت عائشة: كُذِّبُوا، قلت: قد استيقنوا أن قومهم كذّبوهم فما هو بالظن، قالت: أجل قد استيقنوا بذلك، فقلت لها:وظنَّوا أنهم قد كُذِبُوا؟ قالت: معاذ الله لم تكن الرسل تظن ذلك بربها، قلت: فما هذه الآية؟ قالت: هم أتباع الرسل الذين آمنوا بربهم وصدقوهم، فطال عليهم البلاء و استأخر عنهم النصر، حتى إذا استيأس الرسل ممن كذبهم من قومهم، وظنت الرسل أن اتباعهم قد كذَّبوهم جاءهم نصر الله عند ذلك)).\n\nوفي موقف آخر يتضح لنا أن السيدة عائشة كانت تحرص على إظهار ارتباط آيات القرآن بعضها ببعض بحيث كانت تفسر القرآن بالقرآن. وبذلك فإن السيدة عائشة تكون قد مهدت لكل من أتى بعدها أمثل الطرق لفهم القرآن الكريم . أما من حيث إنها كانت من كبار حفاظ السنة من الصحابة، فقد احتلت (رضي الله عنها) المرتبة الخامسة في حفظ الحديث وروايته، حيث إنها أتت بعد أبي هريرة ، وابن عمر وأنس بن مالك ، وابن عباس (رضي الله عنهم).\n\nولكنها امتازت عنهم بأن معظم الأحاديث التي روتها قد تلقتها مباشرة من النبي صلى الله عليه و سلم كما أن معظم الأحاديث التي روتها كانت تتضمن على السنن الفعلية . ذلك أن الحجرة المباركة أصبحت مدرسة الحديث الأول يقصدها أهل العلم لزيارة النبي صلى الله عليه و سلم وتلقي السنة من السيدة التي كانت أقرب الناس إلى رسول الله، فكانت لا تبخل بعلمها على أحدٍ منهم، ولذلك كان عدد الرواة عنها كبير.\n\nكانت (رضي الله عنها) ترى وجوب المحافظة على ألفاظ الحديث كما هي، وقد لاحظنا ذلك من رواية عروة بن الزبير عندما قالت له (( يا ابن أختي ! بلغني أن عبدالله بن عمرو مار بنا إلى الحج . فالقه فسائله . فإنه قد حمل عن النبي صلى الله عليه وسلم علما كثيرا . قال فلقيته فساءلته عن أشياء يذكرها عن رسول الله صلى الله عليه وسلم . قال عروة : فكان فيما ذكر ؛ أن النبي صلى الله عليه وسلم قال \" إن الله لا ينتزع العلم من الناس انتزاعا . ولكن يقبض العلماء فيرفع العلم معهم . ويبقى في الناس رؤسا جهالا . يفتونهم بغير علم . فيضلون ويضلون \" . قال عروة : فلما حدثت عائشة بذلك ، أعظمت ذلك وأنكرته . قالت : أحدثك أنه سمع النبي صلى الله عليه وسلم يقول هذا ؟ قال عروة : حتى إذا كان قابل ، قالت له : إن ابن عمرو قد قدم . فالقه . ثم فاتحه حتى تسأله عن الحديث الذي ذكره لك في العلم . قال فلقيته فساءلته . فذكره لي نحو ما حدثني به ، في مرته الأولى . قال عروة : فلما أخبرتها بذلك . قالت : ما أحسبه إلا قد صدق . أراه لم يزد فيه شيئا ولم ينقص )) .\n\nالراوي: عائشة - خلاصة الدرجة: صحيح - المحدث: مسلم - المصدر: المسند الصحيح - الصفحة أو الرقم: 2673\n\nولذلك كان بعض رواة الحديث يأتون إليها ويسمعونها بعض الأحاديث ليتأكدوا من صحتها، كما إنهم لو اختلفوا في أمر ما رجعوا إليها. ومن هذا كله يتبين لنا دور السيدة عائشة و فضلها في نقل السنة النبوية ونشرها بين الناس، ولولا أن الله تعالى أهلها لذلك لضاع قسم كبير من سنة النبي صلى الله عليه و سلم الفعلية في بيته عليه الصلاة و السلام .\n\nالسيدة الفقيهة :\n\nتعد السيدة عائشة(رضي الله عنها) من أكبر النساء في العالم فقهاً وعلماً، فقد كانت من كبار علماء الصحابة المجتهدين، وكما ذكرنا سابقاً بأن أصحاب الرسول صلى الله عليه و سلم كانوا يستفتونها فتفتيهم، وقد ذكر القاسم بن محمد أن عائشة قد اشتغلت بالفتوى من خلافة أبي بكر إلى أن توفيت. ولم تكتفِ (رضي الله عنها) بما عرفت من النبي صلى الله عليه و سلم وإنما اجتهدت في استنباط الأحكام للوقائع التي لم تجد لها حكماً في الكتاب أو السنة، فكانت إذا سئلت عن حكم مسألة ما بحثت في الكتاب والسنة، فإن لم تجد اجتهدت لاستنباط الحكم، حتى قيل إن ربع الأحكام الشرعية منقولة عنها. فها هي (رضي الله عنها) تؤكد على تحريم زواج المتعة مستدلة بقول الله تعالى : (( والذين هم لفروجهم حافظون.إلا على أزواجهم أو ما ملكت أيمانهم فإنهم غير ملومين.فمن ابتغى وراء ذلك فأولئك هم العادون)).\n\nوقد استقلت السيدة ببعض الآراء الفقهية، التي خالفت بها آراء الصحابة، ومن هذه الآراء:\n\n1-جواز التنفل بركعتين بعد صلاة العصر، قائلة((لم يدع رسول الله صلى الله عليه وسلم الركعتين بعد العصر . قال فقالت عائشة : قال رسول الله صلى الله عليه وسلم \" لا تتحروا طلوع الشمس ولا غروبها . فتصلوا عند ذلك )).\n\nالراوي: عائشة - خلاصة الدرجة: صحيح - المحدث: مسلم - المصدر: المسند الصحيح - الصفحة أو الرقم: 833 \nوعلى الرغم من أنه من المعلوم أن التنفل بعد صلاة العصر مكروه، فقال بعض الفقهاء أن التنفل بعد العصر من خصوصياته .\n\n2- كما أنها كانت ترى أن عدد ركعات قيام رمضان إحدى عشرة ركعة مع الوتر، مستدلة بصلاة رسول الله صلى الله عليه و سلم ،وذلك عندما سألها أبو سلمة بن عبدالرحمن (( كيف كانت صلاة رسول الله صلى الله عليه وسلم في رمضان ؟ فقالت : ما كان رسول الله صلى الله عليه وسلم يزيد في رمضان ولا في غيره على إحدى عشرة ركعة ، يصلي أربعا ، فلا تسل عن حسنهن وطولهن ، ثم يصلي أربعا ، فلا تسل عن حسنهن وطولهن ، ثم يصلي ثلاثا . قالت عائشة : فقلت : يا رسول الله ، أتنام قبل أن توتر ؟ . فقال : يا عائشة ، إن عيني تنامان ولا ينام قلبي )).\n\nالراوي: عائشة - خلاصة الدرجة: [صحيح] - المحدث: البخاري - المصدر: الجامع الصحيح - الصفحة أو الرقم: 1147\n\n2 - الراوي: عائشة - خلاصة الدرجة: [صحيح] - المحدث: البخاري - المصدر: الجامع الصحيح - الصفحة أو الرقم: 2013\n\nفكان الصحابة (رضي الله عنهم) يصلونها عشرين ركعة، لأن فعل النبي صلى الله عليه و سلم لهذا العدد لا يدل على نفي ما عداه . وهكذا جمعت السيدة عائشة بين علو بيانها و رجاحة عقلها، حتى قال عنها عطاء:(( كانت عائشة أفقه الناس وأحسن الناس رأياً في العامة)).\n\nالخلاصة :\n\nتوفيت السيدة عائشة (رضي الله عنها) وهي في السادسة و الستين من عمرها،بعد أن تركت أعمق الأثر في الحياة الفقهية و الاجتماعية والسياسية للمسلمين. وحفظت لهم بضعة آلاف من صحيح الحديث عن رسول صلى الله عليه و سلم .\n\nلقد عاشت السيدة بعد رسول الله صلى الله عليه و سلم لتصحيح رأي الناس في المرأة العربية ، فقد جمعت (رضي الله عنها) بين جميع جوانب العلوم الإسلامية ، فهي السيدة المفسرة العالمة المحدثة الفقيهة. وكما ذكرنا سابقاً فهي التي قال عنها رسول الله صلى الله عليه و سلم أن فضلها على النساء كفضل الثريد على سائر الطعام، فكأنها فضلت على النساء.\n\nكما أن عروة بن الزبير قال فيها:((ما رأيت أعلم بفقه ولا طب ولا شعر من عائشة))، وأيضا قال فيها أبو عمر بن عبدالبر:(( إن عائشة كانت وحيدة بعصرها في ثلاثة علوم علم الفقه وعلم الطب وعلم الشعر)).\n\nوهكذا فإننا نلمس عظيم الأثر للسيدة التي اعتبرت نبراساً منيراً يضيء على أهل العلم وطلابه،للسيدة التي كانت أقرب الناس لمعلم الأمة وأحبهم، والتي أخذت منه الكثير وأفادت به المجتمع الإسلامي. فهي بذلك اعتبرت امتدادا لرسول الله صلى الله عليه و سلم                      ",
    "number-en": "The story of Aisha bint Abu Bakr Al-Siddiq",
    "label-en": "Mrs. Aisha (may God be pleased with her) is the bright mind, sharp intelligence, and great knowledge of this person. And for its effective role in serving Islamic thought through its transmission of the hadiths of the Messenger of God and its interpretation of many aspects of the life of the Messenger, may God bless him and grant him peace, and its diligences. She is also the woman who transcended the limits of her role as a woman to become the teacher of an entire nation, namely the Islamic nation. She (may God be pleased with her) was one of the most brilliant people in the Qur’an, Hadith, and jurisprudence. Urwa bin Al-Zubayr said about her: “I have not seen anyone more knowledgeable about the Qur’an, nor its obligations, nor what is permissible, nor what is forbidden, nor about poetry, nor about the hadith of Arabs, nor about lineage than Aisha.” 1\n\nIn this research point, I touched on three areas in which Mrs. Aisha excelled:\n\n1. Teach and teach her.\n\n2. The Modern Interpreter Lady.\n\n3. Mrs. Faqiha.\n\nI have chosen these areas: Because of her importance and her clear impact on society and Islamic thought, she (may God be pleased with her) with her knowledge and knowledge contributed to correcting concepts and providing guidance to follow the Sunnah of the Messenger of God, may God bless him and grant him peace. The people of knowledge used to go to her to gain from her abundant knowledge, and thus she became a shining beacon for the people of knowledge and its students. That is Aisha, the daughter of Abu Bakr Al-Siddiq, the wife of the Messenger of God, the most jurist of Muslim women, and the most knowledgeable of them in the Qur’an, Hadith, and jurisprudence. She was born in Mecca in the eighth year before the Hijra. The Messenger, may God bless him and grant him peace, married her in the second year of the Hijra, and she was the one who narrated most of his hadiths.\n\nShe was one of the most beloved of the Messenger’s wives to him, and she (may God be pleased with her) narrates about that, saying: “Aisha said to the wives of the Prophet, may God’s prayers and peace be upon him: I preferred ten of you over you, and I am not proud of it. I was the most beloved of his wives, and my father was the most beloved of his men. He invented me and did not create anyone else, and he married me for seven years, and he had children with me for nine years. My virginity descended from heaven, and the Prophet, may God’s prayers and peace be upon him, asked permission from his wives during his illness. He said: It is difficult for me to disagree between you, so allow me to be with some of you. Umm Salamah said: We know who Aisha wants. We gave you permission, and his last provision of this world was my saliva. He brought your siwak and said: Break it, Aisha. So I broke him, and he was caught between my lap and my neck, and he was buried in my house.)\n\nNarrator: Abd al-Malik bin Umair - Summary of the degree: Its chain of transmission is valid, but there is a break - The narrator: Al-Dhahabi - Source: Siyar A’lam al-Nubala’ - Page or number: 2/147\n\nShe (may God be pleased with her) died at the age of fifty-eight AH. Her knowledge and education:\n\nAisha (may God be pleased with her) is considered one of the greatest women in the world in jurisprudence and knowledge. She was knowledgeable about everything related to religion, including the Qur’an, Hadith, interpretation and jurisprudence. She (may God be pleased with her) was a reference for the Companions of the Messenger of God when a matter was difficult for them. They (may God be pleased with them) would ask her to consult her and find in her a solution to their problems. Where Abu Musa Al-Ash’ari said: ((There is no problem for us - the Companions of the Messenger of God, may God bless him and grant him peace, about a hadith at all. So we asked Aisha, unless we found that she had knowledge of it)).\n\nLady Aisha’s position among Muslims was that of a professor among his students, as if she heard narrations from Muslim scholars and companions that were not in their correct form, she would correct them and clarify what was hidden from them. This became famous about her, and everyone who doubted a narration that came to her became a questioner. The woman was distinguished by her high knowledge due to factors that enabled her to reach this position, the most important of which are:\n\n- Her sharp intelligence and strong memory, due to the abundance of what she narrated on the authority of the Prophet, may God bless him and grant him peace.\n\n- Her marriage at an early age to the Prophet, may God bless him and grant him peace, and her upbringing in the house of the Prophet, so she (may God be pleased with her) became the Prophet’s student.\n\n- A large number of revelations were revealed in her room, and this is due to what she excelled among the wives of the Messenger of God. - Her love for science and knowledge. She used to ask and inquire if she did not know something or it was difficult for her to ask. Ibn Abi Mulaika said about her: ((She would not hear something that she did not know except that she would review it until she knew it)).\n\nAs a result of her knowledge and jurisprudence, her blessed room became a destination for students of knowledge, until this room became the first school of Islam and the most influential in the history of Islam. She (may God be pleased with her) was wearing a veil between herself and her students, as Masruq said: “I heard her clapping her hands from behind the veil.”\n\nThe lady followed high-level methods in her education, following the approach of the Messenger of God in teaching his companions. One of these methods is not to speak quickly, but rather to take it slowly so that the learner can comprehend. Urwa said that Mrs. Aisha said in disapproval, “Don’t you like that Abu Hurairah came and sat next to my room talking about the Messenger of God, may God’s prayers and peace be upon him, listening to me, and I was praising - praying - and he got up before I finished my rosary, and if I had caught him, I would have responded to him. The Messenger of God, may God’s prayers and peace be upon him, did not narrate the hadith like yours.\n\nIt is also one of her methods of teaching, sometimes teaching in a practical manner, in order to clarify practical legal rulings such as ablution. She also did not hesitate to answer the questioner on any religious question, even if it was the most delicate, private human issue. We also noticed that Mrs. Aisha used the scientific method combined with evidence, whether from the Qur’an or the Sunnah. This is made clear in Masrooq’s narration, where he said: “I was reclining with Aisha. She said: O Abu Aisha! There are three things. Whoever speaks any of them has committed great libel against God. I said: What are they? She said: Whoever claims that Muhammad, may God’s prayers and peace be upon him, saw his Lord, has committed great libel against God. He said: I was reclining, so I sat down. I said: O Mother of the Believers! Look at me and don't rush me. Didn’t God Almighty say: {And indeed He saw Him on the clear horizon}[ 81 / Al-Takwir / Verse - 23] {And He certainly saw Him at another landing}[ 53 / Al-Najm / Verse - 13] So she said: I am the first of this nation to ask about that the Messenger of God, may God bless him and grant him peace. He said: “It is Gabriel. I have not seen him in the image in which he was created except these two times. I saw him descending from the sky.” The greatness of His creation prevailed between the heavens and the earth.)\n\nNarrator: Aisha - Summary of grade: Sahih - Narrator: Muslim - Source: Al-Musnad Al-Sahih - Page or number: 177\n\nShe said: I am the first of this nation. The Messenger of God, may God bless him and grant him peace, asked about that, and he said: (It is Gabriel)) Narrator: Abdullah bin Masoud and Aisha - Summary of the degree: authentic on the authority of Aisha and Ibn Masoud - Hadith: Ibn Al-Qayyim - Source: Zad Al-Ma’ad - Page or number: 3/33 She said: Have you not heard that God says: (Sights do not perceive Him, but He perceives sight, and He is the Kind and All-Aware?) Or have you not heard that God says: (And it is not for a human being that God should speak to him except by revelation, or from behind a veil, or that He sends a messenger and reveals by His permission whatever He wills. Indeed, He is Most High, All-Wise.)\n\nShe said: Whoever claims that the Messenger of God, may God bless him and grant him peace, concealed something from the Book of God, has committed the greatest libel against God, and God says: (O Messenger, convey what has been revealed to you from your Lord, and if you do not do so, you have not conveyed His message.) She said: And whoever claims that he tells what will happen tomorrow has committed the greatest libel against God, and God says (Say: “No one in the heavens and the earth knows the unseen except God.”)\n\nThus, it becomes clear to us that Mrs. Aisha (may God be pleased with her) was a stronghold of Islamic thought and a lamp that shines on students of knowledge. Because of her intelligence and love of knowledge, the Prophet, may God’s prayers and peace be upon him, loved her and preferred her, as he said: ((The superiority of Aisha over women is like the superiority of porridge over all other food)). The updated lady interpreter\n\nMrs. Aisha (may God be pleased with her) was a scholar, interpreter and hadith scholar. She taught the women of the believers, and many companions asked her about matters of religion. God Almighty provided her with all the reasons that made her one of the figures of interpretation and hadith. If we touch on her great role in interpretation, we find that her being the daughter of Abu Bakr Al-Siddiq is one of the reasons that enabled her to occupy this position in the world of interpretation, since from an early age she heard the Qur’an from the mouth of her father Al-Siddiq. Her intelligence and the strength of her memory are another reason, and we notice this from her saying: ((It was revealed in Mecca to Muhammad, may God’s prayers and peace be upon him, and I was a slave girl playing. (Rather, the Hour is their appointed time, and the Hour is worse and more bitter. Surah Al-Baqarah and An-Nisa was not revealed except while I was with him)).\n\nOne of the most important reasons is that she was witnessing the revelation of the revelation to the Messenger of God, and she (may God be pleased with her) would ask the Messenger about the meanings of the Holy Qur’an and what some of the verses refer to. Thus, she combined the honor of receiving the Qur’an from the Prophet, may God bless him and grant him peace, immediately after its revelation, and also receiving its meanings from the Messenger of God. In addition, she (may God be pleased with her) collected everything that an interpreter needs, such as her strength in the Arabic language, the eloquence of her tongue, and the clarity of her eloquence.\n\nThe lady was keen to interpret the Holy Qur’an in a way that was consistent with the principles of the religion and its beliefs, and this is evident in what Urwa said asking the lady Aisha about the Almighty’s saying ((Until when the messengers despaired and thought that they had been lied to, Our victory would come to them...)) I said: Did they lie or were they lied to? Aisha said: They were lied to. I said: They were certain that their people had lied to them, so what is the assumption? She said: Yes, they were certain of that. I said to her: And they thought that they had been lied to? She said: God forbid, the messengers did not think that about their Lord. I said: So what is this verse? She said: They are the followers of the Messengers who believed in their Lord and were truthful to them, but the affliction prolonged them and victory delayed them, until when the Messengers despaired of those among their people who had lied to them, and the Messengers thought that their followers had lied to them, then God’s victory would come to them.)\n\nIn another situation, it becomes clear to us that Mrs. Aisha was keen to show that the verses of the Qur’an were connected to each other, so that she was interpreting the Qur’an with the Qur’an. Thus, Mrs. Aisha paved the way for everyone who came after her to understand the Holy Qur’an. As for the fact that she was one of the great memorizers of the Sunnah among the Companions, she (may God be pleased with her) ranked fifth in memorizing and narrating hadith, as she came after Abu Hurairah, Ibn Omar, Anas bin Malik, and Ibn Abbas (may God be pleased with them).\n\nBut she distinguished herself from them in that most of the hadiths she narrated were received directly from the Prophet, may God bless him and grant him peace, and most of the hadiths she narrated included actual Sunnahs. This is because the blessed room became the school of the first hadith, where scholars came to visit the Prophet, may God bless him and grant him peace, and to receive the Sunnah from the lady who was the closest person to the Messenger of God, and she was not stingy with her knowledge to any of them, and therefore the number of her narrators was large.\n\nShe (may God be pleased with her) believed that it was necessary to preserve the wording of the hadith as it was, and we noticed this from the narration of Urwa bin Al-Zubayr when she said to him: “O son of my sister! I have heard that Abdullah bin Amr passed by us on the Hajj. So I asked him and asked him. For he carried a lot of knowledge from the Prophet, may God bless him and grant him peace. He said, “I met him and asked him about things he mentioned about the Messenger of God, may God bless him and grant him peace. Urwa said: It was as he mentioned; The Prophet, may God bless him and grant him peace, said, “God does not take away knowledge from the people. Rather, He takes the scholars and raises the knowledge with them. And ignorant leaders will remain among the people. They will issue fatwas without knowledge. They will go astray and go astray.” Urwa said: When Aisha told that, she venerated it and denied it. She said: Did I tell you that he heard the Prophet, may God bless him and grant him peace, say this? Urwa said: Even when he met, she said to him: Ibn Amr has come. So he found him. Then open up to him and ask him about the hadith he mentioned to you regarding knowledge. He said, “I met him and asked him.” So he mentioned it to me in the same way as he told me the first time. Urwa said: When I told her about that. She said: I do not think he has told the truth. I see that nothing has increased or decreased in it.)\n\nNarrator: Aisha - Summary of grade: Sahih - Narrator: Muslim - Source: Al-Musnad Al-Sahih - Page or number: 2673\n\nTherefore, some hadith narrators would come to her and listen to some of the hadiths to make sure of their authenticity, and if they disagreed about a matter, they would not refer to them. From all of this, it becomes clear to us the role of Lady Aisha and her virtue in transmitting the Prophetic Sunnah and spreading it among the people. Had God Almighty not made it permissible, a large portion of the actual Sunnah of the Prophet, may God bless him and grant him peace, would have been lost in his house, may God bless him and grant him peace.\n\nMrs. Jurist:\n\nLady Aisha (may God be pleased with her) is considered one of the greatest women in the world in jurisprudence and knowledge. She was one of the great scholars of the diligent companions, and as we mentioned previously, the companions of the Messenger, may God bless him and grant him peace, used to ask her for fatwas and she would give them fatwas. Al-Qasim bin Muhammad mentioned that Aisha worked in fatwa from the caliphate of Abu Bakr until she died. She (may God be pleased with her) was not satisfied with what she knew from the Prophet, may God bless him and grant him peace, but rather she worked hard to derive rulings for the facts for which she did not find a ruling in the Qur’an or the Sunnah. So, if she was asked about the ruling on an issue, she would search in the Qur’an and the Sunnah. If she did not find that, she worked hard to derive the ruling, to the point that it was said that a quarter of the legal rulings were transmitted from them. Here she (may God be pleased with her) confirms the prohibition of temporary marriage, citing the words of God Almighty: ((And those who guard their private parts. Except for their wives or those whom their right hands possess, for they are not to blame. But whoever seeks beyond that - those are the transgressors.)).\n\nThe lady adopted some jurisprudential opinions in which she differed from the opinions of the Companions, and among these opinions are:\n\n1- It is permissible to perform voluntary prayers with two rak’ahs after the afternoon prayer, saying: “The Messenger of God, may God’s prayers and peace be upon him, did not omit two rak’ahs after the afternoon prayer.” He said, “Aisha said: The Messenger of God, may God’s prayers and peace be upon him, said, ‘Do not seek the rising or setting of the sun. Then pray.\n\nNarrator: Aisha - Summary of degree: Sahih - Narrator: Muslim - Source: Al-Musnad Al-Sahih - Page or number: 833 \nAlthough it is known that performing voluntary prayers after the afternoon prayer is disliked, some jurists said that performing voluntary prayers after the afternoon prayer is one of its peculiarities.\n\n2- She also believed that the number of rak’ahs for praying in Ramadan was eleven rak’ahs with Witr, as evidenced by the prayer of the Messenger of God, may God’s prayers and peace be upon him, when Abu Salamah bin Abdul Rahman asked her, “How was the prayer of the Messenger of God, may God’s prayers and peace be upon him, in Ramadan?” She said: The Messenger of God, may God’s prayers and peace be upon him, did not exceed eleven rak’ahs in Ramadan or at any other time. He would pray four, so do not ask about their beauty and length. Then he would pray four, so do not ask about their beauty and length, then he would pray three. Aisha said: So I said: O Messenger of God, do you sleep before praying the Witr prayer? . He said: O Aisha, my eyes sleep but my heart does not sleep.) Narrator: Aisha - Summary of grade: [Sahih] - Narrator: Al-Bukhari - Source: Al-Jami’ Al-Sahih - Page or number: 1147\n\n2 - Narrator: Aisha - Summary of grade: [Sahih] - Hadith: Al-Bukhari - Source: Al-Jami’ Al-Sahih - Page or number: 2013\n\nThe Companions (may God be pleased with them) used to pray twenty rak'ahs, because the fact that the Prophet, may God bless him and grant him peace, did this number does not indicate the negation of anything else. Thus, Mrs. Aisha combined the height of her eloquence with the clarity of her mind, until Ataa said about her: ((Aisha was the most knowledgeable of people and had the best opinion among the common people)).\n\nConclusion:\n\nMrs. Aisha (may God be pleased with her) died when she was sixty-six years old, after leaving the deepest impact on the jurisprudential, social, and political life of Muslims. I preserved for them several thousand authentic hadiths from the Messenger, may God bless him and grant him peace.\n\nThe lady lived after the Messenger of God, may God bless him and grant him peace, to correct people’s opinion of the Arab woman. She (may God be pleased with her) combined all aspects of Islamic sciences. She is the lady, the interpreter, the scholar, the hadith scholar, and the jurist. As we mentioned previously, she is the one about whom the Messenger of God, may God bless him and grant him peace, said that her superiority over women is like the superiority of porridge over all other food, so it is as if she was superior to women.\n\nAlso, Urwa bin Al-Zubayr said about it: ((I have not seen someone more knowledgeable in jurisprudence, medicine, or poetry than Aisha)), and Abu Omar bin Abdul-Barr also said about it: ((Aisha was alone in her time in three sciences: jurisprudence, science of medicine, and poetry)). Thus, we sense the great impact of the woman who was considered a shining beacon for the people of knowledge and its students, of the woman who was the closest and most beloved person to the nation’s teacher, and who took a lot from him and benefited the Islamic community. Thus, she was considered an extension of the Messenger of God, may God bless him and grant him peace"
  },
  {
    "number": "قصة حفصة بنت عمر بن الخطاب",
    "text": "",
    "label": "هي حفصة بنت عمر أمير المؤمنين (عمر بن الخطاب) ر ضي الله عنهما ، ولدت قبل المبعث بخمسة الأعوام. لقد كانت حفصة زوجة صالحة للصحابي الجليل (خنيس بن حذافة السهمي) الذي كان من أصحاب الهجرتين، هاجر إلى الحبشة مع المهاجرين الأولين إليها فرارا بدينه ، ثم إلى المدينة نصرة لنبيه صلى الله عليه و سلم، و قد شهد بدرا أولا ثم شهد أحدا، فأصابته جراحه توفي على أثرها ، و ترك من ورائه زوجته ( حفصة بنت عمر ) شابة في ريعان العمر ، فترملت ولها عشرون سنة\n\nزواج حفصة من الرسول صلى الله عليه وسلم :\n\nتألم عمر بن الخطاب لابنته الشابة ، وأوجعه أن يرى ملامح الترمل تغتال شبابها وأصبح يشعر بانقباض في نفسه كلما رأى ابنته الشابة تعاني من عزلة الترمل، وهي التي كانت في حياة زوجها تنعم بالسعادة الزوجية، فأخذ يفكر بعد انقضاء عد تها في أمرها ، من سيكون زوجا لابنته؟ \nومرت الأيام متتابعة ..وما من خاطب لها ، وهو غير عالم بأن النبي صلى الله عليه و سلم قد أخذت من اهتمامه فأسر إلى أبي بكر الصديق أنه يريد خطبتها. ولما تطاولت الأيام عليه وابنته الشابة الأيم يؤلمها الترمل، فعرضها عمر على أبي بكر فسكت ، فعرضها على عثمان حين ماتت رقية بنت النبي صلى الله عليه وآله وسلم فقال : ما أريد أن أتزوج اليوم ، فذكر ذلك عمر لرسول الله صلى الله عليه وآله وسلم فقال : يتزوج حفصة من هو خير من عثمان ، ويتزوج عثمان من هو خير من حفصة ، فلقي أبو بكر عمر فقال : لا تجد علي فإن رسول الله صلى الله عليه وآله وسلم ذكر حفصة ، فلم أكن أفشي سر رسول الله صلى الله عليه وآله وسلم ، ولو تركها لتزوجتها ، وتزوج رسول الله صلى الله عليه وآله وسلم حفصة بعد عائشة\n\nالراوي: - - خلاصة الدرجة: أصله في الصحيح - المحدث: ابن حجر العسقلاني - المصدر: الإصابة - الصفحة أو الرقم: 4/273\n\nوعمر لا يدري معنى قول النبي صلى الله عليه و سلم . لما به من هموم لابنته ، ثم خطبها النبي صلى الله عليه و سلم ، فزوجه عمر رضي الله عنه ابنته حفصة ، وينال شرف مصاهرة النبي صلى الله عليه و سلم ، ويرى نفسه أنه قارب المنزلة التي بلغها أبو بكر من مصاهرته من ابنته عائشة ، وهذا هو المقصود والله أعلم من تفكير النبي صلى الله عليه و سلم بخطبة لحفصة بنت عمر رضي الله عنها ؟!\n\nوزوج رسول الله صلى الله عليه و سلم عثمان بابنته أم كلثوم بعد وفاة أختها رقية، ولما أن تزوج رسول الله صلى الله عليه و سلم حفصة ..لقي عمر بن الخطاب أبا بكر.. فاعتذر أبو بكر إليه، وقال : لا تجد علي ، فإن ر سول الله صلى الله عليه و سلم، كان ذكر حفصة، فلم أكن لأفشي سره ، ولو تركها لتزوجتها ؟!\n\nوبذلك تحققت فرحة عمر وابنته حفصة .. وبارك الصحابة يد رسول صلى الله عليه و سلم وهي تمتد لتكرم عمر بن الخطاب بشرف المصاهرة منه عليه الصلاة والسلام ، وتمسح عن حفصة آلام الترمل والفرقة.وكان زواجه صلى الله عليه و سلم بحفصة سنة ثلاث من الهجرة على صداق قدره 400 درهم، وسنها يومئذ عشرون عاما3.\n\nحفصة في بيت النبوة :\n\nوقد حظيت حفصة بنت عمر الخطاب –رضي الله عنها - بالشرف الرفيع الذي حظيت به سابقتها عائشة بنت أبي بكر الصديق !!.وتبوأت المنزلة الكريمة من بين (أمهات المؤمنين ) رضي الله عنهنَّ !!..\n\nوتدخل (حفصة ) بيت النبي صلى الله عليه و سلم ... ثالثة الزوجات في بيوتاته عليه الصلاة والسلام .. فقد جاءت بعد( سوده ) ..و( عائشة) ..\n\nأما سوده فرحبت بها راضية .. وأما عائشة فحارت ماذا تصنع مع هذه الزوجة الشابة.. وهي من هي! بنت الفاروق (عمر ) .. الذي أعز الله به الإسلام قديما .. وملئت قلوب المشركين منه ذعرا!!..\n\nوسكتت عائشة أمام هذا الزواج المفاجئ وهي التي كانت تضيق بيوم ضرتها (سوده) التي ما اكترثت لها كثيرا …فكيف يكون الحال معها حين تقتطع (حفصة) من أيامها مع الرسول صلى الله عليه وسلم ثلثها؟!.\n\nوتتضاءل غيرة عائشة من حفصة لما رأت توافد زوجات أخريات على بيوتات النبي صلى الله عليه وسلم…\" زينب …وأم سلمة…وزينب الأخرى ..وجويرية… وصفية ..\" إنه لم يسعها إلا أن تصافيها الود…و تُـسر حفصة لود ضرتها عائشة …وينعمها ذلك الصفاء النادر بين الضرائر؟.!..\n\nصفات حفصة –رضي الله عنها :\n\n(حفصة) أم المؤمنين …الصوامة .. القوامة… شهادة صادقة من أمين الوحي (جبريل عليه السلام) !! … وبشارة محققه : إنها زوجتك – يا رسول الله- في الجنة!!… وقد وعت حفصة مواعظ الله حق الوعي .. وتأدبت بآداب كتابه الكريم حق التأدب... وقد عكفت على المصحف تلاوة و تدبرا و تفهما و تأملا ..مما أثار انتباه أبيها الفاروق (عمر بن الخطاب) إلى عظيم اهتمامها بكتاب الله تبارك و تعالى !! مما جعله يوصي بالمصحف الشريف الذي كتب في عهد أبي بكر الصديق بعد وفاة النبي صلى الله عليه و سلم .. و كتابه كانت على العرضة الأخيرة التي عارضها له جبريل مرتين في شهر رمضان من عام وفاته صلى الله عليه و سلم………..إلى ابنته (حفصة) أم المؤمنين!!..\n\nحفظ نسخة القرآن المكتوب عند حفصة : الوديعة الغالية\n\nروى أبو نعيم عن ابن شهاب عن خارجة بن زيد بن ثابت عن أبيه قال : \" لما أمرني أبوبكر فجمعت القرآن كتبته في قطع الأدم وكسر الأكتاف والعسب، فلما هلك أبو بكر رضي الله عنه- أي : توفي – كان عمر كتب ذلك في صحيفة واحدة فكانت عنده- أي: على رق من نوع واحد – فلما هلك عمر رضي الله عنه كانت الصحيفة عند حفصة زوجة النبي صلى الله عليه و سلم ، ثم أرسل عثمان رضي الله عنه إلى حفصة رضي الله عنها ، فسألها أن تعطيه الصحيفة ؛ و حلف ليردنها إليها، فأعطته ، فعرض المصحف عليها ، فردها إليها ، وطابت نفسه ، و أمر الناس فكتبوا المصاحف …!\n\nو قد امتاز هذا المصحف الشريف بخصائص الجمع الثاني للقرآن الكريم الذي تم إنجازه في خلافة أبي بكر الصديق رضي الله عنه ، بمشورة من عمر بن الخطاب ، و ذلك بعد ما استحر القتل في القراء في محاربة ( مسيلمة الكذاب ) حيث قتل في معركة اليمامة ( سبعون ) من القراء الحفظة للقرآن بأسره .. وخصائص جمع هذا المصحف نجملها فيما يلي :\n\nأولا : أن كل من كان قد تلقى عن رسول الله صلى الله عليه و سلم شيئا من القرآن أتى وأدلى به إلى زيد بن ثابت .\n\nثانيا : أن كل من كتب شيئا في حضرة النبي صلى الله عليه و سلم من القرآن الكريم أتى به إلى زيد .\n\nثالثا : أن زيدا كان لا يأخذ إلا من أصل قد كتب بين يدي النبي صلى الله عليه و سلم.\n\nرابعا : أن الجمع بعد المقارنة بين المحفوظ في الصدور ، و المرسوم في السطور ، و المقابلة بينهما ، لا بمجرد الاعتماد على أحدهما.\n\nخامسا : أن زيدا كان لا يقبل من أحد شيئا حتى يشهد معه شاهدان على سماعه و تلقيه عن رسول الله صلى الله عليه و سلم مباشرة بلا واسطة ؛ فيكون بذلك هذا الجمع قد تم فيه التدوين الجماعي ، و الثلاثة أقل الجمع.\n\nسادسا : أن ترتيب هذا المصحف الشريف – الأول من نوعه – و ضبطه كان على حسب العرضة الأخيرة على رسول الله صلى الله عليه و سلم قبل التحاقه بالرفيق الأعلى.\n\nوقد شارك زيد في هذه المهمة العظيمة ( عمر بن الخطاب ) فعن عروة بن الزبير أن أبا بكر قال لعمر و زيد : \" اقعدا على باب المسجد ، فمن جاءكم بشاهدين على شيء من كتاب الله فاكتباه \" !!.. قال الحافظ السخاوي في (جمال القراء) : \" المراد انهما يشهدان على أن ذلك المكتوب كتب بين يدي النبي صلى الله عليه و سلم ، أو المراد أنهما يشهدان على أن ذلك من الوجوه التي نزل بها القرآن \". ولما أجمع الصحابة على أمر أمير المؤمنين عثمان بن عفان في جمع الناس على مصحف إمام يستنسخون منه مصاحفهم ..\" أرسل أمير المؤمنين عثمان إلى أم المؤمنين حفصة رضي الله عنها أن أرسلي إلينا بالصحف ننسخها في المصاحف \" ..\n\nتلك هي الوديعة الغالية !!.. التي أودعها أمير المؤمنين عمر بن الخطاب عند ابنته حفصة أم المؤمنين.. فحفظتها بكل أمانة .. ورعتها بكل صون ...فحفظ لها الصحابة … والتابعون …. وتابعوهم من المؤمنين إلى يومنا هذا … وإلى أن يرث الله الأرض ومن عليها .. ذلك الذكر الجميل الذي تذكر فيه كلما تذاكر المسلمون جمع المصحف الشريف في مرحلتيه … في عهد الصديق أبي بكر … وعهد ذي النورين عثمان… وبعد مقتل عثمان…إلى آخر أيام علي….بقيت حفصة عاكفة على العبادة صوامة قوامة … إلى أن توفيت في أول عهد معاوية بن أبي سفيان …وشيعها أهل المدينة إلى مثواها الأخير في البقيع مع أمهات المؤمنين رضي الله عنهن.                      ",
    "number-en": "The story of Hafsa bint Omar bin Al-Khattab",
    "label-en": "She is Hafsa, the daughter of Omar, the Commander of the Faithful (Omar bin Al-Khattab), may God be pleased with them both. She was born five years before the mission. Hafsa was a good wife to the great companion (Khunays bin Hudhafa al-Sahmi), who was one of the people of the two migrations. He immigrated to Abyssinia with the first immigrants there to escape his religion, then to Medina in support of his Prophet, may God bless him and grant him peace. He witnessed Badr first and then witnessed Uhud. He was wounded and died as a result. He left behind his wife (Hafsa bint Omar), a young woman in the prime of her life. She was widowed when she was twenty years old\n\nHafsa’s marriage to the Messenger, may God bless him and grant him peace:\n\nOmar Ibn Al-Khattab felt pain for his young daughter, and it pained him to see the features of widowhood killing her youth. He began to feel a contraction in himself whenever he saw his young daughter suffering from the loneliness of widowhood, and she was the one who during her husband’s life was enjoying marital happiness. So, after the end of her waiting period, he began to think about her matter: Who would be his daughter’s husband? \nDays passed one by one...and no one proposed to her, not knowing that the Prophet, may God bless him and grant him peace, had taken his interest, so he confided to Abu Bakr Al-Siddiq that he wanted to propose to her. When the days were long for him and his young daughter was suffering from widowhood, Omar proposed her to Abu Bakr, but she remained silent. Then he proposed her to Othman when Ruqayyah, the daughter of the Prophet, may God’s prayers and peace be upon him and his family, died, and he said: I do not want to get married today. So Omar mentioned that to the Messenger of God, may God’s prayers and peace be upon him and his family, and he said: Hafsa may marry someone who is better than Othman, and Othman may marry someone who is better than Hafsa, so Abu Bakr met Omar. He said: Do not find fault with me, because the Messenger of God, may God’s prayers and peace be upon him and his family, mentioned Hafsa, and I did not divulge the secret of the Messenger of God, may God’s prayers and peace be upon him and his family, and if he had left her, I would have married her. The Messenger of God, may God bless him and his family and grant them peace, married Hafsa after Aisha\n\nNarrator: - - Summary of the degree: Its origin is in the Sahih - Hadith: Ibn Hajar Al-Asqalani - Source: Al-Isaba - Page or number: 4/273\n\nOmar did not know the meaning of what the Prophet, may God bless him and grant him peace, said. Because of his concerns for his daughter, then the Prophet, may God’s prayers and peace be upon him, proposed to her, so Omar, may God be pleased with him, married him to his daughter Hafsa, and he attained the honor of marrying into the Prophet, may God’s prayers and peace be upon him, and he saw himself as being close to the status that Abu Bakr had attained through his marriage to his daughter, Aisha. This is what is meant, and God knows best, what did the Prophet, may God’s prayers and peace be upon him, think about proposing to Hafsa bint Omar, may God be pleased with her?!\n\nThe Messenger of God, may God’s prayers and peace be upon him, married Othman to his daughter, Umm Kulthum, after the death of her sister Ruqayyah. When the Messenger of God, may God’s prayers and peace be upon him, married Hafsa... Omar bin Al-Khattab met Abu Bakr... so Abu Bakr apologized to him and said: Don’t find fault with me, because the Messenger of God, may God’s prayers and peace be upon him, mentioned Hafsa, so I would not divulge his secret, and if he had left her, would I have married her?!\n\nThus, the joy of Omar and his daughter Hafsa was achieved. The Companions blessed the hand of the Messenger, may God’s prayers and peace be upon him, as it extended to honor Omar ibn al-Khattab with the honor of marriage with him, may God’s prayers and peace be upon him, and to erase from Hafsa the pain of widowhood and separation. His marriage, may God’s prayers and peace be upon him, to Hafsa in the year three of the Hijra was based on a dowry of 400 dirhams, and she was twenty years old at that time3.\n\nHafsa in the House of Prophethood:\n\nHafsa bint Omar Al-Khattab - may God be pleased with her - enjoyed the high honor enjoyed by her predecessor, Aisha bint Abi Bakr Al-Siddiq!!. She assumed the honorable position among the “Mothers of the Believers”, may God be pleased with them!!..\n\nHafsa enters the house of the Prophet, may God bless him and grant him peace... The third wives in his homes, peace and blessings be upon him... She came after (Sawda)... and (Aisha)..\n\nAs for Sawda, she was satisfied with her.. As for Aisha, she was confused about what to do with this young wife.. and she is who she is! Bint Al-Farouq (Omar)... Through whom God glorified Islam in ancient times.. and the hearts of the polytheists were filled with fear from him!!..\n\nAisha remained silent in the face of this sudden marriage, as she was distressed by the day of her co-wife (Sawdah), who did not care much for her...so what would be the situation with her when (Hafsa) cut off a third of her days with the Messenger, may God bless him and grant him peace?! Aisha’s jealousy of Hafsa diminished when she saw the influx of other wives into the homes of the Prophet, may God bless him and grant him peace...” Zainab... and Umm Salamah... and the other Zainab... and Juwayriyah... and Safiyya...” She couldn’t help but feel affection for her... and for Hafsa to be pleased with the affection of her co-wife Aisha... and to be blessed with that rare serenity among co-wives?.!..\n\nCharacteristics of Hafsa - may God be pleased with her:\n\n(Hafsa) Mother of the Believers... Fasting... Stewardship... True testimony from the Trustee of Revelation (Gabriel, peace be upon him)!! ...And certain good news: She is your wife - O Messenger of God - in Paradise!!... Hafsa was fully aware of God’s admonitions... and she was properly disciplined by the etiquette of His Noble Book... She devoted herself to the Qur’an, recitation, contemplation, understanding and contemplation...which attracted the attention of her father Al-Farouq (Omar bin Al-Khattab) to her great interest in the Book of God Almighty!! Which made him recommend the Noble Qur’an, which was written during the reign of Abu Bakr al-Siddiq after the death of the Prophet, may God’s prayers and peace be upon him.. and his writing was on the last bow that Gabriel offered to him twice in the month of Ramadan in the year of his death, may God’s prayers and peace be upon him……..to his daughter (Hafsa), the Mother of the Believers!!.. Memorizing a copy of the written Qur’an according to Hafsa: the precious deposit\n\nAbu Nu`aym narrated on the authority of Ibn Shihab, on the authority of Kharijah ibn Zayd ibn Thabit, on the authority of his father, who said: “When Abu Bakr ordered me to compile the Qur’an, I wrote it in cutting the skin, breaking the shoulders, and breaking the bones. When Abu Bakr, may God be pleased with him, died - that is, he died - Omar wrote that on a single sheet of paper and it was with him - that is, on one type of parchment - so when Omar, may God be pleased with him, died, the sheet was with Hafsa, the wife of the Prophet, may God bless him and grant him peace, and then Othman, may God be pleased with him, sent it. God sent him to Hafsa, may God be pleased with her, so he asked her to give him the paper and swore to return it to her, so she gave it to him. So he showed the Qur’an to her, returned it to her, and he was happy, and he ordered the people to write down the Qur’an...!\n\nThis noble Qur’an was distinguished by the characteristics of the second compilation of the Holy Qur’an, which was completed during the caliphate of Abu Bakr al-Siddiq, may God be pleased with him, with the advice of Omar ibn al-Khattab, and that was after the killing of reciters began in the fight against (Musaylimah the Liar), as seventy reciters who had memorized the entire Qur’an were killed in the Battle of Al-Yamamah. The characteristics of the collection of this Qur’an are summarized as follows:\n\nFirst: Everyone who had received something from the Qur’an from the Messenger of God, may God bless him and grant him peace, came and presented it to Zaid bin Thabit.\n\nSecond: Anyone who wrote something in the presence of the Prophet, may God bless him and grant him peace, from the Holy Qur’an, brought it to Zaid.\n\nThird: Zaid would only take from an original that had been written in the hands of the Prophet, may God bless him and grant him peace.\n\nFourth: After comparing what is preserved in the chests and what is written in the lines, and the comparison between them, not by simply relying on one of them. Fifth: Zaid would not accept anything from anyone until two witnesses testified with him that he heard and received it directly from the Messenger of God, may God bless him and grant him peace, without an intermediary. Thus, this plural has been recorded collectively, and the three are the least plural.\n\nSixth: The arrangement and arrangement of this Noble Qur’an - the first of its kind - was according to the last offering made to the Messenger of God, may God bless him and grant him peace, before he joined the Supreme Comrade. Zaid (Omar bin Al-Khattab) participated in this great mission. On the authority of Urwa bin Al-Zubayr, Abu Bakr said to Omar and Zaid: “Sit at the door of the mosque. Whoever brings you two witnesses to anything from the Book of God, write it down.” Al-Hafiz Al-Sakhawi said in “Jamal Al-Qur’an”: “What is meant is that they bear witness to the fact that what was written was written in the hands of the Prophet, may God bless him and grant him peace, or what is meant is that they bear witness to the fact that this is one of the ways in which the Qur’an was revealed.” \". And when the Companions unanimously agreed on the command of the Commander of the Faithful, Othman bin Affan, to gather the people to the Qur’an of an imam from which they would copy their copies of the Qur’an.. “The Commander of the Faithful, Othman, sent to the Mother of the Faithful, Hafsa, may God be pleased with her, to send us the manuscripts so that we can copy them into the Qur’an.”\n\nThis is the precious deposit!!.. which the Commander of the Faithful, Omar ibn al-Khattab, entrusted to his daughter Hafsa, the Mother of the Faithful.. She preserved it with all faithfulness.. and cared for it with all protection... so the Companions... and the followers preserved it... And the believers followed them to this day... and until God inherits the earth and those on it.. That beautiful remembrance in which the Muslims remember the compilation of the Noble Qur’an in its two stages... during the era of Al-Siddiq Abu Bakr... and the era of Dhul-Nurayn Uthman... and after the killing of Uthman... until the last days of Ali... Hafsa remained devoted to worship, fasting and standing... until she died at the beginning of the reign of Muawiyah bin Abi Sufyan... and the people of Medina carried her to her final resting place in Al-Baqi’ with the Mothers of the Believers, may God be pleased with them."
  },
  {
    "number": "قصة زينب بنت خُزيمة الهلالية",
    "text": "",
    "label": "اسمها ولقبها :\n\nهي زينب بنت خزيمة الحارث بن عبد الله بن عمرو بن عبد مناف بن هلال بن عامر بن صعصعة الهلالية، ولم يختلف المؤرخون في نسبها من جهة أبيها كما صرح ابن عبد البر في ترجمتها بالاستيعاب بعد سياق نسبها، وهو ما أجمعت عليه مصادرنا لترجمتها أو نسبها ، وأما من جهة أمها فأغفلته مصادرنا، ونقل ابن عبد البر فيها قول أبى الحسن الجرجاني النسابة ، وكانت زينب بنت خزيمة أخت ميمونة بنت الحارث – أم المؤمنين – لأمها ، وكانت تدعى في الجاهلية – أم المساكين – واجتمعت المصادر على وصفها بالطيبة والكرم والعطف على الفقراء والمساكين في الجاهلية والإسلام ، ولا يكاد اسمها يذكر في أي كتاب إلا مقرونا بلقبها الكريم -أم المساكين . \nزواجها من الرسول صلى الله عليه و سلم \nزينب بنت خزيمة هي إحدى زوجات النبي و والتي لم يمض على دخول حفصة البيت المحمدي وقت قصير حين دخلته أرملة شهيد قرشي من المهاجرين الأولين فكانت بذلك رابعة أمهات المؤمنين. ويبدو أن قصر مقامها ببيت الرسول صلى الله عليه و سلم قد صرف عنها كتاب السيرة ومؤرخي عصر المبعث فلم يصل من أخبارها سوى بضع روايات لا تسلم من تناقض واختلاف ، وزينب بنت خزيمة أرملة شهيد قرشي من المهاجرين الأولين هو عبيدة بن الحارث بن عبد المطلب، قتل عنها في بدر فتزوجها النبي صلى الله عليه و سلم سنة 3 هجرية، ويقال إنه كان زواجا شكليا، حيث إن الرسول -صلى الله عليه وسلم تزوجها - بدافع الشفقة.\n\nواختلف فيمن تولى زواجها من النبي صلى الله عليه وسلم ففي الإصابة عن ابن الكلبي: أن رسول الله صلى الله عليه و سلم خطبها إلى نفسها فجعلت أمرها إليه فتزوجها ، وقال ابن هشام في السيرة : زوَّجه إياها عمها قبيصة بن عمرو الهلالي، وأصدقها الرسول صلى الله عليه و سلم أربعمائة درهم .\n\nواختلفوا أيضا في المدة التي أقامتها ببيت النبي صلى الله عليه و سلم ، ففي الإصابة رواية تقول: كان دخوله صلى الله عليه و سلم بها بعد دخوله على حفصة بنت عمر،رضي الله عنها، ثم لم تلبث عنده شهرين أو ثلاثة وماتت \" ، ورواية أخرى عن ابن كلبي تقول: ( فتزوجها في شهر رمضان سنة ثلاث، فأقامت عنده ثمانية أشهر وماتت في ربيع الآخر سنة أربع) . وفي شذرات الذهب: (وفيها- يعني السنة الثالثة- دخل بزينب بنت خزيمة العامرية، أم المساكين، وعاشت عنده ثلاثة أشهر ثم توفيت).\n\nوفاتها :\n\nالراجح أنها ماتت في الثلاثين من عمرها كما ذكر \"الواقدي\" ونقل \"ابن حجر\" في الإصابة.ورقدت في سلام كما عاشت في سلام. وصلى عليها النبي عليه الصلاة والسلام، ودفنها بالبقيع في شهر ربيع الآخر سنة أربع ، فكانت أول من دفن فيه من أمهات المؤمنين -رضي الله عنهن. وقد ماتت بعد زواجها بثمانية أشهر – رضي الله عنها - ولم يمت منهن- أمهات المؤمنين - في حياته غير السيدة خديجة أم المؤمنين الأولى- ومدفنها بالحجون في مكة- والسيدة زينب بنت خزيمة الهلالية، أم المؤمنين وأم المساكين                       ",
    "number-en": "The story of Zainab bint Khuzaymah Al Hilaliya",
    "label-en": "Her name and surname:\n\nShe is Zainab bint Khuzaymah Al-Harith bin Abdullah bin Amr bin Abd Manaf bin Hilal bin Amer bin Sasa’ah Al-Hilaliyya, and historians did not differ regarding her lineage on her father’s side, as Ibn Abd al-Barr stated in translating her with assimilation after the context of her lineage, which is what our sources agreed upon for her translation or lineage. As for her mother’s side, our sources ignored it, and Ibn Abd al-Barr quoted about her what Abu al-Hasan al-Jurjani said about lineage, and Zainab was the daughter of Khuzaymah is the sister of Maimuna bint al-Harith - the Mother of the Believers - on her mother’s behalf. She was called in pre-Islamic times - the Mother of the Poor - and the sources agreed to describe her as kind, generous, and compassionate to the poor and needy in pre-Islamic times and Islam. Her name is hardly mentioned in any book except in conjunction with her honorable title - Mother of the Poor. \nHer marriage to the Messenger, may God bless him and grant him peace \nZainab bint Khuzaymah is one of the Prophet’s wives. Only a short time had passed since Hafsa entered the Muhammad’s house when the widow of Shahid Quraishi, one of the first immigrants, entered it. She was therefore the fourth Mother of the Believers. It seems that her short stay in the house of the Messenger, may God bless him and grant him peace, has been dismissed by biographers and historians of the era of the resurrection, and only a few accounts have reached her that are not free from contradiction and disagreement. Zainab bint Khuzaymah is the widow of a Quraishi martyr, one of the first immigrants, Ubaidah bin Al-Harith bin Abdul Muttalib. He was killed on her behalf at Badr, so the Prophet, may God bless him and grant him peace, married her in the year 3 AH. It is said that it was a formal marriage, as the Messenger - may God bless him and grant him peace He married her - out of pity.\n\nThere was a difference of opinion regarding who was responsible for her marriage to the Prophet, may God’s prayers and peace be upon him. In Al-Isaba on the authority of Ibn Al-Kalbi: The Messenger of God, may God’s prayers and peace be upon him, proposed to her, so she left her affairs to him, so he married her. Ibn Hisham said in the biography: Her uncle Qubaysah bin Amr Al-Hilali gave her in marriage, and the Messenger, may God’s prayers and peace be upon him, gave her four hundred dirhams.\n\nThey also differed regarding the period of time that she stayed in the house of the Prophet, may God bless him and grant him peace. In Al-Isaba, there is a narration that says: “His entry, may God bless him and grant him peace, was after he entered upon Hafsa bint Omar, may God be pleased with her, and then she did not stay with him for two or three months and she died.” And another narration on the authority of Ibn Kalbi says: “So he married her in the month of Ramadan in the year three, and she stayed with him for eight months and died in Rabi’ al-Akhir in the year four.” And in the fragments of gold: (And in it - meaning - The third year - he entered into marriage with Zainab bint Khuzaymah al-Amiriyah, the Mother of the Poor, and she lived with him for three months and then died.\n\nHer death:\n\nIt is most likely that she died at the age of thirty, as Al-Waqidi mentioned and Ibn Hajar reported in Al-Isaba. She rested in peace, just as she lived in peace. The Prophet, may God’s prayers and peace be upon him, prayed over her and buried her in Al-Baqi’ in the month of Rabi’ al-Akhir in the year four, so she was the first of the Mothers of the Believers to be buried there - may God be pleased with them. She died eight months after her marriage - may God be pleased with her - and none of them - the Mothers of the Believers - died during his lifetime except Mrs. Khadija, the First Mother of the Believers - and her burial place is in Al-Hujun in Mecca - and Mrs. Zainab bint Khuzaymah Al-Hilaliyya, the Mother of the Believers and the Mother of the Poor."
  },
  {
    "number": "قصة أم سلمة هند بنت ابى أمية",
    "text": "",
    "label": "نسبهــــا :\n\nهي هند بنت سهيل المعروف بأبي أمية بن المغيرة، أم سلمة ( ويقال أن اسم جدها المغيرة هو حذيفة، ويعرف بزاد الركب) . وهي قرشية مخزومية ، وكان جدها المغيرة يقال له : زاد الركب ، وذلك لجوده ، حيث كان لا يدع أحدا يسافر معه حامل زاده، بل كان هو الذي يكفيهم. وقد تزوجها أبو سلمة عبد الله بن عبد الأسد المخزومي.\n\nفضلهــــا :\n\nتُعدَّ أم سلمة من أكمل النساء عقلا وخلقا، فهي و زوجها أبو سلمة من السابقين إلى الإسلام ، هاجرت مع أبي سلمة إلى أرض الحبشة ، وولدت له ((سلمة)) ورجعا إلى مكة، ثم هاجرا معه إلى المدينة. فولدت له ابنتين وابنا أيضا ، وكانت أول امرأة مهاجرة تدخل المدينة. ومات أبو سلمة في المدينة من أثر جرح في غزوة أحد، بعد أن قاتل قتال المخلصين المتعشقين للموت والشهادة . وكان من دعاء أبي سلمة: (اللهم اخلفني في أهلي بخير )، فأخلفه رسول الله صلى الله عليه وسلم على زوجته أم سلمة، فصارت أمًا للمؤمنين، وعلى بنيه: سلمة، وعمر، وزينب، فصاروا ربائب في حجره المبارك صلى الله عليه وسلم، وذلك سنة أربع للهجرة (4هـ).\n\nكما كانت تعد من فقهــاء الصحــابة ممن كان يفــتي، إذ عــدها ابن حزم ضمن الدرجة الثانية، أي متوسطي الفتوى بين الصحابة رضوان الله عليهم، حيث قال: (المتوسطون فيما روي عنهم مــن الفتـــوى: عثمــــان، أبوهــــريرة، عبــد الــله بــن عــــمرو، أنـــس، أم سلمة...) إلى أن عدهم ثلاثة عشر، ثم قال: (ويمكن أن يجمع من فتيا كل واحد منهم جزء صغير).\n\nزواج أم سلمة من النبي صلى الله عليه و سلم :\n\nعندما انقضت عدتها بعث إليها أبو بكر يخطبها فلم تتزوجه ، تقول السيدة ام سلمة :فلما حللت جاءني رسول الله صلى الله عليه وسلم فخطبني ، فقلت له : ما مثلي نكح ، أما أنا فلا ولد في وأنا غيور ذات عيال ، قال : أنا أكبر منك ، وأما الغيرة فيذهبها الله ، وأما العيال فإلى الله ورسوله ، فتزوجها رسول الله صلى الله عليه وسلم فجعل يأتيها ويقول : أين زناب ؟ حتى جاء عمار بن ياسر فاختلجها ، فقال : هذه تمنع رسول الله صلى الله عليه وسلم وكانت ترضعها ، فجاء رسول الله صلى الله عليه وسلم وقال : أين زناب ؟ فقالت : قريبة بنت أبي أمية –وواقفها عندها - : أخذها عمار بن ياسر ، فقال رسول الله صلى الله عليه وسلم : إني آتيكم الليلة ، قالت : فقمت فوضعت ثفالي ، وأخرجت حبات من شعير كانت في جرة ، وأخرجت شحما فعصدته له ، أو صعدته –شك الربيع - قالت : فبات رسول الله صلى الله عليه وسلم وأصبح فقال حين أصبح : إن لك على أهلك كرامة ، فإن شئت سبعت لك وإن أسبع أسبع لنسائي\n\nالراوي: أم سلمة هند بنت أبي أمية - خلاصة الدرجة: إسناده صحيح - المحدث: ابن حجر العسقلاني - المصدر: الإصابة - الصفحة أو الرقم: 4/459\n\nولما تزوج رسول الله صلى الله عليه و سلم أم سلمة حزنت عائشة رضي الله عنها حزنا شديدا لما ذكروا لها من جمال أم سلمة وقالت لما رأتها : والله أضعاف ما وصفت لي في الحسن والجمال .وكان رسول الله إذا صلى العصر دخل على نسائه فبدأ بأم سلمة وكان يختمها بعائشة رضي الله عنهن . \nوسافر رسول الله صلى الله عليه و سلم بعض الأسفار وأخذ معه صفية بنت حيي وأم سلمة فأقبل رسول الله صلى الله عليه و سلم إلى هودج صفية ، وهو يظن أنه هودج أم سلمة، وكان ذلك اليوم يوم أم سلمة فجعل النبي عليه الصلاة والسلام يتحدث مع صفية . فغارت أم سلمة وعلم الرسول صلى الله عليه و سلم فقالت له: تتحدث مع ابنة اليهودي في يومي وأنت رسول الله استغفر لي فإنما حملني على هذه الغيرة ....\n\nصفاتها وأخلاقها :\n\nكان لأم سلمه رأي صائب أشارت على النبي صلى الله عليه و سلم يوم الحديبية، وذلك أن النبي - عليه الصلاة والسلام- لما صالح أهل مكة وكتب كتاب الصلح بينه و بينهم وفرغ من قضية الكتاب قال لأصحابه: قوموا فانحروا ثم حلقوا . فلم يقم منهم رجل بعد أن قال ذلك ثلاث مرات . فقام رسول الله - صلى الله عليه وسلم- فدخل على أم سلمة فذكر لها ما لقي من الناس. فقالت له أم سلمة : يا نبي الله أتحب ذلك اخرج ثم لا تكلم أحدا منهم كلمة حتى تنحر بدنك وتدعو حالقك فيحلقك . فقام - عليه الصلاة و السلام - فخرج فلم يكلم أحدا منهم كلمة فنحر بدنته ودعا حالقه فحلقه ، فلما رأوا ذلك قاموا فنحروا وجعل بعضهم يحلق بعضا حتى كاد بعضهم يقتل بعضا .[ كناية عن سرعة المبادرة في الفعل].\n\nوتعد أم سلمة خير مثال يجب على أمهات وزوجات اليوم الاحتذاء به من خلال تربيتها لأولادها التربية الأخلاقية الكريمة. وكانت خير زوجة وأم صالحة، تملك العقل الراجح ، والشخصية القوية، وكانت قادرة على اتخاذ قراراتها بنفسها، وتتسم شخصيتها بحسن الأخلاق والأدب ، وهذا ما يندر في كثير من الأمهات والزوجات في وقتنا الحالي. كالعناية بالزوج، والنظر في أمور الأطفال، ومساعدة الزوج في أصعب الأوقات، وتقدير حال زوجها . كل هذا نفتقده في أمهات وزوجات اليوم، وذلك لاستهتارهن بأمور تربية الأطفال ، وإهمال الزوج وعدم رعايته، ومبالغتهن واهتمامهن بأمور الدنيا والتي غالبا ما تكون زائفة لا معنى لها .\n\nدور أم المؤمنين أم سلمة رضي الله عنها في رواية الحديث :\n\nمروياتها رضي الله عنها وتلاميذها\n\nروت أم المؤمنين أم سلمة رضي الله عنها الكثير الطيب، إذ تعد ثاني راوية للحديث بعد أم المؤمنين عائشة رضي الله عنها، إذ لها جملة أحاديث قدرت حسب كتاب بقي بن مخلد ثلاثمائة وثمانية وسبعين حديثًا (378). اتفق لها البخاري ومسلم على ثلاثة عشر حديثًا، وانفرد البخاري بثلاثة، ومسلم بثلاثة عشر. ومجموع مروياتها حسب ما ورد في تحفة الأشراف مائة وثمانية وخمسون حديثًا (158).\n\nمحتوى مروياتها رضي الله عنها :\n\nكان وجود أم المؤمنين أم سلمة، وأم المؤمنين عائشة رضي الله عنهما خاصة بين الصحابة، وتأخر وفاتهما بعد النبي صلى الله عليه وسلم من العوامل المهمة التي جعلت الناس يقصدونهما خاصة للسؤال والافتاء ، وبعد وفاة أم المؤمنين عائشة رضي الله عنها سنة (58هـ)، تربعت أم سلمة رضي الله عنها على الرواية والافتاء لكونها آخر من تبقى من أمهات المؤمنين، الأمر الذي جعل مروياتها كثيرة، إذ جمعت بين الأحكام والتفسير والآداب والأدعية، والفتن.... إلخ..\n\n\nإن مرويـــات أم ســلــمة معظــمها في الأحكــام وما اختص بالعبادات أساسًا كالطهارة والصلاة والزكاة والصوم والحج. وفي أحكام الجنائز ، وفي الأدب، وفي ستر العورة، وفي رفع الرأس إلى السماء عند الخروج من البيت، والمرأة ترخي من إزارها ذراعًا، وروت في الأشربة، والنهي عن عجم النوى طبخًا وخلط النبيذ بالتمر... وفي النكاح، روت زواجها، وفي الإحداد والرضاع... كما روت في المغازي، والمظالم والفتن، في الجيش الذي يخسف به، وفي المهدي، وروت في المناقب في ذكر علي وذكر عمار.وهذا يدل على قوة حافظة أم سلمة واهتمامها بالحديث -رضي الله عنها . ( للمزيد انظر آمال قرداش بنت الحسين ، دور المرأة في خدمة الحديث في القرون الثلاثة الأولى، كتاب الأمة ، عدد ( 70 )\n\nتلاميـــــذها :\n\nنقل عنها مروياتها جيل من التلاميذ رجالاً ونساء، من مختلف الأقطار، حيث روى عنها - رضي الله عنها - خلق كثير.\n\n- فمن الصحابة: أم المؤمنين عائــشة، وأبو سعيــد الخــدري، وعــمر بن أبي سلمة، وأنس بن مالك، وبريدة بن الحصين الأسلمي، وسليمـــــان بن بريــــدة، وأبو رافــــع، وابن عبـــــاس – رضي الله عنهم . \n- ومن التابعين، أشهرهم: سعيد بن المسيب، وسليمان بن يسار، وشقيق بن سلمة، وعبد الله بن أبي مليكة، وعامر الشعبي، والأســـود بن يــزيــد، ومجـاهد، وعـــطـاء بن أبـــي ربــــاح، شـــهر بن حوشب، نافع بن جبير بن مطعم... وآخرون. \n- ومن النساء: ابنتها زينب، هند بنت الحارث، وصفية بنت شيبة، وصفية بنت أبي عبيد، وأم ولد إبراهيم بن عبد الرحمن بن عــوف، وعمـــرة بنــت عبـــد الرحــمن، وحكيــمة، رميثـــة، وأم محمد ابن قيس. \n- ومن نساء أهل الكوفة: عمرة بنت أفعى، جسرة بنت دجاجة، أم مساور الحميري، أم موسى (سرية علي)، جدة ابن جدعان، أم مبشر. ( انظر آمال قرداش بنت الحسين ، دور المرأة في خدمة الحديث في القرون الثلاثة الأولى، كتاب الأمة ، عدد ( 70 )\n\nوفاة أم سلمة – رضي الله عنها :\n\nآخر من مات من أمهات المؤمنين \"كانت أم المؤمنين أم سلمة رضي الله عنها، آخر من مات من أمهات المؤمنين، عمرت حتى بلغها مقتل الحسين، لم تلبث بعده إلا يسيرًا، وانتقلت إلى الله تعالى سنة (62هـ)، وكانت قد عاشت نحوًا من تسعين سنة \" .                      ",
    "number-en": "The story of Umm Salamah Hind, daughter of Abu Umayyah",
    "label-en": "Her lineage:\n\nShe is Hind bint Suhail, known as Abu Umayyah bin Al-Mughirah, Umm Salamah (it is said that the name of her grandfather Al-Mughirah is Hudhayfah, and is known as Zad Al-Rukb). She is a Makhzoum Qurayshite, and her grandfather, Al-Mughirah, was called “Zada Al-Rukb”, because of his good quality, as he would not let anyone travel with him carrying his provisions, but rather he was the one who sufficed for them. Abu Salamah Abdullah bin Abdul Assad Al Makhzoumi married her.\n\nHer grace:\n\nUmm Salamah is considered one of the most perfect women in mind and morals. She and her husband Abu Salamah were among the first to convert to Islam. She migrated with Abu Salamah to the land of Abyssinia, and gave birth to him ((Salamah)). They returned to Mecca, then migrated with him to Medina. She bore him two daughters and a son as well, and she was the first immigrant woman to enter the city. Abu Salamah died in Medina from a wound in the Battle of Uhud, after fighting the fight of sincere people who craved death and martyrdom. One of Abu Salamah’s supplications was: (O God, replace me with my family in goodness), so the Messenger of God, may God bless him and grant him peace, succeeded him in his successor to his wife, Umm Salamah, and she became a mother to the believers, and to his children: Salamah, Omar, and Zainab, and they became stepsons in his blessed chamber, may God bless him and grant him peace, and that was in the fourth year of the Hijra (4 AH).\n\nShe was also considered one of the Companions’ jurists who issued fatwas, as Ibn Hazm counted her among the second class, that is, the average ones in issuing fatwas among the Companions, may God be pleased with them, as he said: (The average ones in what was narrated from them regarding fatwas: Uthman, Abu Hurairah, Abdullah bin Amr, Anas, Umm Salamah...) until he counted them thirteen, then he said: (It is possible to collect a small portion of the fatwas of each one of them).\n\nUmm Salamah’s marriage to the Prophet, may God bless him and grant him peace:\n\nWhen her waiting period was over, Abu Bakr sent to her to propose to her, but she did not marry him. Mrs. Umm Salamah says: When she was married, the Messenger of God, may God bless him and grant him peace, came to me and proposed to me. I said to him: He is not like me in marriage. As for me, I have no children and I am jealous of children. He said: I am older than you, and as for jealousy, God will take it away, and as for the children, it will go to God and His Messenger, so the Messenger of God, may God bless him and grant him peace, married her. So he started coming to her and saying: Where is Zanab? Until Ammar bin Yasser came and shook her, and said: This woman was breastfeeding the Messenger of God, may God bless him and grant him peace, and she was breastfeeding her. Then the Messenger of God, may God bless him and grant him peace, came and said: Where is Zanaab? She said: A relative of the daughter of Abi Umayyah - and the one standing by her -: Ammar bin Yasser took it, and the Messenger of God, may God’s prayers and peace be upon him, said: I will come to you tonight. She said: So I got up and put in my dung, and took out grains of barley that were in a jar, and I took out lard and cooked it for him, or cooked it - Al-Rabi’ doubted - she said: So the Messenger of God, may God’s prayers and peace be upon him, spent the night in the morning, and he said in the morning: You have it for your family. dignity, If you wish, I will do seven for you, and seven for my wives\n\nNarrator: Umm Salamah Hind bint Abi Umayyah - Summary of the degree: Its chain of transmission is authentic - Narrator: Ibn Hajar Al-Asqalani - Source: Al-Isaba - Page or number: 4/459\n\nWhen the Messenger of God, may God’s prayers and peace be upon him, married Umm Salamah, Aisha, may God be pleased with her, was deeply saddened by what they mentioned to her about Umm Salamah’s beauty, and she said when she saw her: By God, she is twice as beautiful and beautiful as she described to me. When the Messenger of God prayed the afternoon prayer, he would go to his wives, starting with Umm Salamah, and he would end with Aisha, may God be pleased with them. The Messenger of God, may God’s prayers and peace be upon him, traveled some travels and took with him Safiyya bint Huyya and Umm Salamah. The Messenger of God, may God’s prayers and peace be upon him, went to Safiyya’s howdah, thinking that it was Umm Salamah’s howdah. That day was Umm Salamah’s day, so the Prophet, may God’s prayers and peace be upon him, started talking to Safiyya. Umm Salamah became jealous and the Messenger, may God bless him and grant him peace, learned about it and said to him: You are talking to the daughter of the Jew in my day, and you are the Messenger of God. Ask forgiveness for me, for this jealousy only caused me.... Her qualities and morals:\n\nUmm Salamah had a correct opinion and pointed it out to the Prophet, may God’s prayers and peace be upon him, on the day of Hudaybiyyah. This is because when the Prophet - may God’s prayers and peace be upon him - reconciled with the people of Mecca and wrote a letter of reconciliation between him and them and finished the issue of the letter, he said to his companions: Arise and sacrifice, then shave. Not one of them rose after he said that three times. So the Messenger of God - may God bless him and grant him peace - got up and went to Umm Salamah and mentioned to her what he had encountered from the people. Umm Salamah said to him: O Prophet of God, do you like that? Go out and do not speak a word to any of them until you slaughter your body and call your barber and he shaves you. So he - may God’s prayers and peace be upon him - got up and went out, and he did not speak a word to any of them, so he slaughtered his camel and called his shaver, so he shaved it. When they saw that, they got up and slaughtered and started some of them shaving others until they almost killed each other [a metaphor for haste in action].\n\nUmm Salamah is a good example that today’s mothers and wives should emulate by raising her children with a decent moral education. She was the best wife and mother. She had a strong mind and a strong personality. She was able to make her own decisions, and her personality was characterized by good morals and etiquette. This is what is rare in many mothers and wives nowadays. Such as taking care of the husband, looking after the children’s affairs, helping the husband in the most difficult times, and appreciating her husband’s condition. We miss all of this in mothers and wives today, due to their negligence in matters of raising children, their husband’s neglect and lack of care, and their exaggeration and interest in worldly matters, which are often false and meaningless.\n\nThe role of the Mother of the Believers, Umm Salamah, may God be pleased with her, in narrating the hadith:\n\nHer narrations, may God be pleased with her and her students\n\nThe Mother of the Believers, Umm Salamah, may God be pleased with her, narrated a lot of good things, as she is considered the second narrator of the hadith after the Mother of the Believers, Aisha, may God be pleased with her, as she has a number of hadiths that, according to the book of Baqi bin Makhlid, were estimated at three hundred and seventy-eight hadiths (378). Al-Bukhari and Muslim agreed on thirteen hadiths, Al-Bukhari was alone on three, and Muslim on thirteen. The total number of its narrations, according to what was mentioned in Tuhfat Al-Ashraf, is one hundred and fifty-eight hadiths (158).\n\nContents of her narrations, may God be pleased with her:\n\nThe presence of the Mother of the Believers, Umm Salamah, and the Mother of the Believers, Aisha, may God be pleased with them, especially among the Companions, and the delay in their death after the Prophet, may God bless him and grant him peace, were among the important factors that made people go to them in particular to ask and issue fatwas, and after the death of the Mother of the Believers, Aisha, may God be pleased with her, in the year 58 AH. Umm Salamah, may God be pleased with her, took the lead in narrating and issuing fatwas because she was the last remaining of the Mothers of the Believers, which made her narrations numerous, as she combined rulings, interpretation, etiquette, supplications, temptations...etc..\n\n\nMost of the narrations of Umm Salamah are in rulings and what is mainly concerned with acts of worship, such as purity, prayer, zakat, fasting, and Hajj. And in the rulings on funerals, and in etiquette, and in covering the private parts, and in raising the head to the sky when leaving the house, and for a woman to loosen an cubit of her garment, and to drink water, and forbidding cooking stones of stones, and mixing wine with dates... In marriage, she narrated her marriage, mourning and breastfeeding... She also narrated in battles, injustices and temptations, in the army being eclipsed, and in the Mahdi, and she narrated in virtues in mentioning Ali and mentioning Ammar. This indicates the strength of Umm Salamah’s memory and her interest in the hadith - may God be pleased with her. (For more, see Amal Qardash bint Al-Hussein, The Role of Women in Serving Hadith in the First Three Centuries, Kitab Al-Ummah, No. (70))\n\nHer students:\n\nHer narrations were transmitted by a generation of students, men and women, from different countries, as many people - may God be pleased with her - narrated from her. Among the Companions: Mother of the Believers Aisha, Abu Saeed Al-Khudri, Omar bin Abi Salamah, Anas bin Malik, Buraidah bin Al-Husayn Al-Aslami, Suleiman bin Buraidah, Abu Rafi’, and Ibn Abbas - may God be pleased with them. \nAmong the followers, the most famous of them are: Saeed bin Al-Musayyab, Suleiman bin Yasar, Shaqiq bin Salamah, Abdullah bin Abi Malika, Amer Al-Shabi, Al-Aswad bin Yazid, Mujahid, Ata bin Abi Rabah, Shahr bin Hawshab, Nafi bin Jubair bin Mut’im... and others. Among the women: her daughter Zainab, Hind bint Al-Harith, Safiya bint Shaybah, Safiya bint Abi Ubaid, Umm Walad Ibrahim bin Abdul Rahman bin Awf, Amra bint Abdul Rahman, Hakima, Rumaitha, and Umm Muhammad bin Qais. \nAmong the women of the people of Kufa: Amra bint Afi’a, Jasra bint Dajjah, Umm Masawir al-Himyari, Umm Musa (Sariya Ali), Jeddah Ibn Jad’an, Umm Mubashir. (See Amal Qardash bint Al-Hussein, The Role of Women in Serving Hadith in the First Three Centuries, Kitab Al-Ummah, No. (70))\n\nThe death of Umm Salamah - may God be pleased with her:\n\nThe last of the Mothers of the Believers to die: “The Mother of the Believers, Umm Salamah, may God be pleased with her, was the last of the Mothers of the Believers to die. She lived until the death of Hussein reached her. She did not live after that but a short time, and she turned to God Almighty in the year (62 AH), and she had lived for about ninety years.”"
  },
  {
    "number": "قصة زينب بنت جَحش",
    "text": "",
    "label": "السيدة زينب بنت جحش امرأة من علية نساء قريش \nهذب الإسلام نفسها، وأضاء قلبها بنوره وضيائه، واكسبها التقوى والخلق الكريم، \nفأصبحت درة من الدرر المكنونة نادرة الوجود، وتعتبر سيدة من سيدات نساء الدنيا في الورع والتقوى والجود والتصدق، وقد غدت أما من أمهات المؤمنين بزواجها من النبي صلى الله عليه وسلم، ومما زادها شرفا وتقديرا وذكرا عند المؤرخين على طول الدهر ذكر قصة زواجها في القرآن الكريم، وبسببها أنزلت آية الحجاب ، فرفعت مكانتها وعلت منزلتها في محارب العبادة ، وكانت أواهة حليمة ، تصوم النهار وتقوم الليل ، وكانت سخية اليد، تجود بكل ما لديها دون أن تبخل أو تتوانى في تقديم العون للفقراء والمحتاجين حتى غدت مثالا عظيما في الكرم والجود والخلق الكريم ، وقد لقبت بألقاب عديدة منها: أم المساكين ، ومفزع الأيتام ، وملجأ الأرامل، فهي امرأة سباقة إلى فعل الخيرات، ولها سيرة ندية عطرة في تاريخنا الإسلامي ، وبهذا تعتبر السيدة زينب –رضي الله عنها- قدوة عظيمة لكل مسلمة تحتذي بأخلاقها وخصالها النبيلة ، و تقتفى أثرها، ويهتدي بهديها؛ ليكون ذلك سببا لها في الفوز برضا الله تعالى ورضا رسوله صلى الله عليه وسلم .\n\nاسمها ونسبها :\n\nزينب بنت جحش بن رياب بن يعمر بن مرة بن كثير بن غنم بن دوران بن أسد بن خزيمة\" ، وتكنى بأم الحكم. من أخوالها حمزة بن عبد المطلب – رضي الله عنه – الملقب بأسد الله وسيد الشهداء في غزوة أحد ، والعباس بن عبد المطلب الذي اشتهر ببذل المال وإعطائه في النوائب ، وخالتها صفية بنت عبد المطلب الهاشمية ، أم حواري النبي صلى الله عليه وسلم الزبير بن العوام الأسدي . ولها إخوان هما عبد الله بن جحش الأسدي صاحب أول راية عقدت في الإسلام وأحد الشهداء ، والآخر أبو أحمد واسمه عبد بن جحش الأعمى ، وهو أحد السابقين الأولين ومن المهاجرين إلى المدينة ، ولها أختان إحداهما أميمة بنت عبد المطلب عمة الرسول صلى الله عليه وسلم، والأخرى هي حمنة بنت جحش من السابقات إلى الإسلام .\"ولدت السيدة زينب – رضي الله عنها – في مكة المكرمة قبل الهجرة بأكثر من ثلاثين سنة\"، وقيل أنها \" ولدت قبل الهجرة بسبع عشرة سنة\". وقد نشأت السيدة زينب بنت جحش في بيت شرف ونسب وحسب ، وهي متمسكة بنسبها ، ومعتزة بشرف أسرتها ، وكثيرا ما كانت تفتخر بأصلها ، وقد قالت مرة :\"أنا سيدة أبناء عبد شمس\".\n\nإسلامهـــــا :\n\nكانت زينب بنت جحش من اللواتي أسرعن في الدخول في الإسلام، وقد كانت تحمل قلبا نقيا مخلصا لله ورسوله، فأخلصت في إسلامها، وقد تحملت أذى قريش و عذابها، إلى أن هاجرت إلى المدينة المنورة مع إخوانها المهاجرين، وقد أكرمهم الأنصار وقاسموهم منازلهم وناصفوهم أموالهم وديارهم \n. \nأخلاق السيدة الفاضلة وأعمالها الصالحة \nتميزت أم المؤمنين زينب بمكانة عالية وعظيمة، وخاصة بعد أن غدت زوجة للرسول وأما للمؤمنين. كانت سيدة صالحة صوامة قوامة ، تتصدق بكل ما تجود بها يدها على الفقراء والمحتاجين والمساكين، وكانت تصنع وتدبغ وتخرز وتبيع ما تصنعه وتتصدق به ، وهي امرأة مؤمنة تقية أمينة تصل الرحم .\n\nكرم السيدة زينب بنت جحش وعظيم إنفاقها \nوهنالك العديد من المواقف التي تشهد على عطاء أم المؤمنين زينب بنت حجش الكبير، وتؤكد على جودها وكرمها ، والذي تغدقه على المحتاجين بلا حدود .\" أخرج الشيخان – واللفظ لمسلم - عن عائشة – رضي الله عنها – قالت: قال رسول الله: \" أسرعكن لحاقا بي أطولكن يدا\" قالت : فكن( أمهات المؤمنين ) يتطاولن أيتهن أطول يدا ، قالت : وكانت أطولنا يدا زينب ؛ لأنها تعمل بيدها وتتصدق . وفي طريق آخر : قالت عائشة: فكنا إذا اجتمعنا في بيت إحدانا بعد وفاة الرسول صلى الله عليه وسلم نمد أيدينا في الجدار نتطاول ، فلم نزل نفعل ذلك حتى توفيت زينب بنت جحش ،وكانت امرأة قصيرة ولم تكن بأطولنا ، فعرفنا حينئذ أن النبي صلى الله عليه وسلم إنما أراد طول اليد بالصدقة ، وكانت زينب امرأة صناع اليدين ، فكانت تدبغ وتخرز وتتصدق به في سبيل الله. عن عائشة – رضي الله عنها - قالت: كانت زينب تغزل الغزل وتعطيه سرايا النبي – صلى الله عليه وسلم – يخيطون به ويستعينون به في مغازيهم.\"\n\nوموقف آخر على بذلها المال وتصدقها به \" ما حدثت به برزة بنت رافع فقالت : لما خرج العطاء ، أرسل عمر إلى زينب بنت جحش بالذي لها ، فلما أدخل إليها قالت : غفر الله لعمر بن الخطاب ، غيري من أخواتي كانت أقوى على قسم هذا مني ، قالوا: هذا كله لك ، قالت: سبحان الله واستترت منه بثوب ثم قالت : صبوه واطرحوا عليه ثوبا ، ثم قالت لي : ادخلي يديك واقبضي منه قبضة فاذهبي بها إلى بني فلان وبني فلان من ذوي رحمها وأيتام لها ، فقسمته حتى بقيت منه بقية تحت الثوب فقالت برزة لها: غفر الله لك يا أم المؤمنين والله لقد كان لنا في هذا المال حق ، قالت زينب: فلكم ما تحت الثوب فوجدنا تحته خمسمائة وثمانين درهما ، ثم رفعت يدها إلى السماء فقالت : اللهم لا يدركني عطاء لعمر بعد عامي هذا .\"\n\nعن عائشة – رضي الله عنها – قالت: \"كانت زينب بنت جحش تساميني في المنزلة عند رسول الله صلى الله عليه وسلم ، ما رأيت امرأة خيرا في الدين من زينب ، أتقى لله، وأصدق حديثا ، وأوصل للرحم، وأعظم صدقة – رضي الله عنها.\" \n\" عن عبدالله بن شداد أن رسول الله صلى الله عليه وسلم قال لعمر : \" إن زينب بنت جحش أواهة \" قيل : يا رسول الله ، ما الأواهة؟ قال: \" الخاشعة المتضرعة\" و \" إن ابراهيم لحليم أواه منيب \" . \nوقالت عائشة فيها :\" لقد ذهبت حميدة ، متعبدة ، مفزع اليتامى والأرامل.\" قال ابن سعد – رحمه الله- :\" ما تركت زينب بنت جحش – رضي الله عنها – درهما ولا دينارا، و كانت تتصدق بكل ما قدرت عليه ، وكانت مأوى المساكين .\"\n\nرواية زينب للحديث الشريف :\n\nكانت السيدة زينب – رضي الله عنها – من النساء اللواتي حفظن أحاديث الرسول صلى الله عليه وسلم ورويت عنها \n، وقد روت – رضي الله عنها أحد عشر حديثا ، واتفق الإمامان البخاري ومسلم لها على حديثين منها. لقد روى عنها العديد من الصحابة؛ منهم: ابن أخيها محمد بن عبدالله بن جحش ، والقاسم بن محمد بن أبي بكر، ومذكور مولاها. وروى عنها أيضا الكثير من الصحابيات منهن : \" زينب بنت أبي سلمة وأمها أم المؤمنين أم سلمة ، وأم المؤمنين رملة بنت أبي سفيان المعروفة بأم حبيبة – رضي الله عنها - ، وأيضا كلثوم بنت المصطلق.\n\nومن الأحاديث الشريفة التي رويت عنها - رضي الله عنها – قالت زينب دخلت على أم حبيبة زوج النبي صلى الله عليه وسلم حين توفي أبوها أبو سفيان بن حرب ، فدعت أم حبيبة بطيب فيه صفرة ، خلوق أو غيره ، فدهنت منه جارية ثم مست بعارضيها ، ثم قالت : والله ما لي بالطيب من حاجة ، غير أني سمعت رسول الله صلى الله عليه وسلم يقول : لا يحل لامرأة تؤمن بالله واليوم الآخر أن تحد على ميت فوق ثلاث ليال ، إلا على زوج أربعة أشهر وعشرا .\" الراوي: أم حبيبة رملة بنت أبي سفيان - خلاصة الدرجة: [صحيح] - المحدث: البخاري - المصدر: الجامع الصحيح - الصفحة أو الرقم: 5334\n\nومما أخرجه البخاري \" عن أم حبيبة بنت أبي سفيان، عن زينب بنت جحشأن النبي صلى الله عليه وسلم دخل عليها فزعا يقول : ( لا إله إلا الله ، ويل للعرب من شر اقترب ، فتح اليوم من ردم يأجوج ومأجوج مثل هذه ) . وحلق بإصبعه الإبهام والتي تليها ، قالت زينب بنت جحش : فقلت : يا رسول الله ، أنهلك وفينا الصالحون ؟ قال : ( نعم ، إذا كثر الخبث )\n\nالراوي: زينب بنت جحش - خلاصة الدرجة: [صحيح] - المحدث: البخاري - المصدر: الجامع الصحيح - الصفحة أو الرقم: 3346 \nأمهات المؤمنين                      ",
    "number-en": "The story of Zainab bint Jahsh",
    "label-en": "Mrs. Zainab bint Jahsh, a woman from among the elite of the women of Quraish \nIslam refined her soul, illuminated her heart with its light and brilliance, and gave her piety and noble character. \nShe became one of the rare hidden pearls, and she is considered one of the women of the world in terms of piety, piety, generosity, and charity. She became one of the mothers of the believers through her marriage to the Prophet, may God bless him and grant him peace. What increased her honor, appreciation, and mention among historians throughout time was the mention of the story of her marriage in the Holy Qur’an. Because of her, the verse about the hijab was revealed, so her status was raised and her position in the warrior of worship increased. She fasted during the day and prayed at night, and she was generous, giving everything she had without being stingy or hesitating in providing assistance to the poor and needy, to the point that she became a great example of generosity, generosity, and noble character. She was given many titles, including: Mother of the Poor, Refugee of Orphans, and Refuge of Widows. She was a pioneering woman in doing good deeds, and had a noble and fragrant biography in our Islamic history. Thus, Mrs. Zainab - may God be pleased with her - is considered A great role model for every Muslim woman who can emulate her noble morals and qualities and follow in her footsteps. And he is guided by her guidance; This would be a reason for her to gain the satisfaction of God Almighty and the satisfaction of His Messenger, may God bless him and grant him peace.\n\nHer name and lineage:\n\nZainab bint Jahsh bin Riyab bin Ya`mar bin Murra bin Katheer bin Ghanam bin Duran bin Asad bin Khuzaymah, and she was nicknamed Umm al-Hakam. Among her maternal uncles are Hamza bin Abdul Muttalib - may God be pleased with him - who was known as the Lion of God and the Master of Martyrs in the Battle of Uhud, and Abbas bin Abdul Muttalib, who was famous for spending money and giving it in calamities, and her maternal aunt Safiya bint Abdul Muttalib Al Hashemi, the mother of the disciples of the Prophet, may God bless him and grant him peace. May God bless him and grant him peace. Al-Zubayr bin Al-Awwam Al-Asadi. She has two brothers, Abdullah bin Jahsh Al-Asadi, the owner of the first banner held in Islam and one of the martyrs, and the other is Abu Ahmad, whose name is Abd bin Jahsh Al-Aama, and he is one of the first predecessors and among the immigrants to Medina, and she has two sisters, one of whom is Umaima bint Abdul Muttalib, the aunt of the Messenger, may God bless him and grant him peace, and the other is Hamna bint Jahsh, one of the first to convert to Islam. “Lady Zainab - may God be pleased with her - was born in Mecca more than a year before the migration. Thirty years,” and it was said that “she was born seventeen years before the Hijra.” Mrs. Zainab bint Jahsh grew up in a family of honor and lineage. She is committed to her lineage, and is proud of the honor of her family. She was often proud of her origins. She once said: “I am the mistress of the sons of Abd Shams.”\n\nHer conversion to Islam:\n\nZainab bint Jahsh was one of those who hastened to convert to Islam, and she had a pure heart loyal to God and His Messenger, so she was sincere in her Islam, and she endured the harm and torment of the Quraysh, until she migrated to Medina with her fellow immigrants, and the Ansar honored them, shared their homes with them, and dealt equally with them in their money and homes. \n. The morals of the virtuous lady and her good deeds \nThe Mother of the Believers, Zainab, was distinguished by a high and great status, especially after she became the wife of the Messenger and the mother of the believers. She was a good, fasting, and steadfast woman who gave in charity whatever she could to the poor, the needy, and the needy. She used to make, tan, and beadwork, and she sold what she made and gave it in charity. She was a faithful, pious, and faithful woman who maintained family ties. The generosity of Mrs. Zainab bint Jahsh and her great spending \nThere are many instances that testify to the great giving of the Mother of the Believers, Zainab bint Hajsh, and confirm her generosity and generosity, which she bestowed upon the needy without limits.” The two sheikhs reported - and the wording is by Muslim - on the authority of Aisha - may God be pleased with her - who said: The Messenger of God said: “You are the quickest to catch up with me, and I have the longest hand.” She said: So they (the Mothers of the Believers) were competing with each other, you who had the longest hand. She said: Zainab had the longest hand among us. Because she works with her hands and gives in charity. In another way: Aisha said: When we gathered in one of our homes after the death of the Messenger, may God bless him and grant him peace, we would extend our hands to the wall and touch each other, and we did not stop doing that until Zainab bint Jahsh died. She was a short woman and not as tall as us. We knew then that the Prophet, may God bless him and grant him peace, only wanted a long hand in charity, and Zainab was a woman who made hands, so she used to tan and bead and give it in charity for the sake of God. On the authority of Aisha - may God be pleased with her - she said: Zainab used to spin yarn and give it to the Prophet’s squadrons - may God bless him and grant him peace - who would sew with it and seek help from it in their raids.\n\nAnd another situation regarding her giving of money and her charity with it, which was narrated by Barzah bint Rafi’, who said: When the bid came out, Omar sent what was hers to Zainab bint Jahsh, and when he came to her, she said: May God forgive Omar bin Al-Khattab. My other sisters were stronger in this portion than me. They said: This is all for you. She said: Glory be to God, and she covered herself with a garment from him. Then she said: Pour it and throw a garment over it. Then she said to me: Put your hands in and take a handful of it and take it to the children of so-and-so and the children of so-and-so, her relatives and her orphans. She divided it until there was a remainder of it under the garment. Barza said to her: May God forgive you, O Mother of the Believers. By God, we have a right to this money. Zainab said: Take what is under the garment, and we found under it five hundred and eighty dirhams. Then she raised her hand to the sky and said: Oh God, do not overtake me in giving for a lifetime after my year. \"This.\"\n\nOn the authority of Aisha - may God be pleased with her - she said: “Zainab bint Jahsh was equal to me in status with the Messenger of God, may God bless him and grant him peace. I have never seen a woman better in religion than Zainab. The most fearful of God, the most truthful in speech, the most connected to the family, and the greatest charity - may God be pleased with her.” \nOn the authority of Abdullah bin Shaddad, the Messenger of God, may God bless him and grant him peace, said to Omar: “Zainab bint Jahsh is a fool.” It was said: O Messenger of God, what is a fool? He said: “The humble and supplicant woman” and “Indeed, Abraham is forbearing and repentant.” \nAisha said about it: “The virtuous, devout, and caring woman who raised orphans and widows has gone.” Ibn Saad - may God have mercy on him - said: “Zainab bint Jahsh - may God be pleased with her - did not leave behind a dirham or a dinar, and she used to give in charity whatever she could. It was a shelter for the poor.”\n\nZainab’s narration of the noble hadith:\n\nMrs. Zainab - may God be pleased with her - was one of the women who memorized the hadiths of the Messenger, may God bless him and grant him peace, and narrated on her authority. \nShe narrated - may God be pleased with her - eleven hadiths, and Imam Al-Bukhari and Muslim agreed on two of them. Many companions narrated about it; Among them: her nephew Muhammad bin Abdullah bin Jahsh, Al-Qasim bin Muhammad bin Abi Bakr, and mentioned, her servant. Many female companions also narrated from her, including: “Zainab bint Abi Salamah, and her mother was the Mother of the Believers, Umm Salamah, and the Mother of the Believers, Ramla bint Abi Sufyan, known as Umm Habibah - may God be pleased with her - and also Kulthum bint Al-Mustaliq.\n\nAmong the noble hadiths that were narrated from her - may God be pleased with her - Zainab said: “Zainab went to Umm Habibah, the wife of the Prophet, may God bless him and grant him peace, when her father, Abu Sufyan bin Harb, died. So Umm Habibah asked for perfume that had yellowness in it, whether clean or otherwise, so she anointed a slave girl with it and then touched her private parts. Then she said: By God, I have no need for perfume. However, I heard the Messenger of God, may God’s prayers and peace be upon him, saying: It is not permissible for a woman who believes in God and the Last Day to mourn a dead person for more than three nights, except for a husband for four months and ten days.” Narrator: Umm Habiba Ramla bint Abi Sufyan - Summary of degree: [Sahih] - Hadith: Al-Bukhari - Source: Al-Jami’ Al-Sahih - Page or number: 5334\n\nAnd from what Al-Bukhari narrated “on the authority of Umm Habibah bint Abi Sufyan, on the authority of Zainab bint Jahsh, that the Prophet, may God’s prayers and peace be upon him, entered upon her in fear, saying: (There is no god but God. Woe to the Arabs for the evil that has approached. Today, from the destruction of Gog and Magog, such as this has been opened). وحلق بإصبعه الإبهام والتي تليها ، قالت زينب بنت جحش : فقلت : يا رسول الله ، أنهلك وفينا الصالحون ؟ He said: (Yes, if there is a lot of malice)\n\nالراوي: زينب بنت جحش - خلاصة الدرجة: [صحيح] - المحدث: البخاري - المصدر: الجامع الصحيح - الصفحة أو الرقم: 3346 \nMothers of believers"
  },
  {
    "number": "قصة جوَيرية بنت الحارث",
    "text": "",
    "label": "سيرة عطرة يود الكثير من أهل الخير لو كانوا طرفا منها. وليست هناك أصدق وأبهى وأنضر من سيرة سيدة من سيدات وأمهات المؤمنين. نقف على سيرتها؛ لتكون لنا فيها عبرة وموعظة. ولنأخذ قطوفا دانية مباركة من سيرة أم المؤمنين جويرية التي خصها الله عز وجل بالطهارة، وما أجمل سيرتـها العطرة.رضي الله عنها وأرضاها.\n\nنــشـأة جويرية أم المؤمنين :\n\nهي برة بنت الحارث بن أبي ضرار بن حبيب بن عائذ بن مالك من خزاعة ، كان أبوها سيد وزعيم بني المصطلق .عاشت برة في بيت والدها معززة مكرمة في ترف وعز وفي بيت تسوده العراقة والأصالة ، وفي حداثة سنها تزوجت برة من مسافع بن صفوان أحد فتيان خزاعة وكانت لم تتجاوز العشرين من عمرها.\n\nبدايات النور :\n\nبدأ الشيطان يتسلل إلى قلوب بني المصطلق ويزين لهم بأنهم أقوياء يستطيعون التغلب على المسلمين، فأخذوا يعدون العدة ويتأهبون لمقاتلة المجتمع المسلم بقيادة الرسول صلى الله عليه وسلم فتجمعوا لقتال رسو ل الله صلى الله عليه وسلم ، وكان بقيادتهم سيدهم الحارث بن أبي ضرار، وقد كانت نتيجة القتال انتصار النبي صلى الله عليه وسلم وهزيمة بني المصطلق في عقر دارهم. فما كان من النبي إلا أن سبى كثيرا من الرجال والنساء،وكان مسافع بن صفوان زوج جويرية من الذين قتلتهم السيوف المسلمة وقد كانت السيدة جويرية بنت الحارث من النساء اللاتي وقعن في السبي فوقعت في سهم ثابت بن قيس بن شماس الأنصاري رضي الله عنه، عندها اتفقت معه على مبلغ من المال تدفعه له مقابل عتقها؛لأنها كانت تتوق للحرية.\n\nزواج جويرية من الرسول صلى الله عليه وسلم :\n\nوقعت جويرية بنت الحارث بن المصطلق في سهم ثابت بن قيس بن شماس – أو ابن عم له – فكاتبت على نفسها ، وكانت امرأة ملاحة تأخذها العين . قالت عائشة : فجاءت تسأل رسول الله صلى الله عليه وسلم في كتابتها ، فلما قامت على الباب ، فرأيتها كرهت مكانها ، وعرفت : أن رسول الله صلى الله عليه وسلم سيرى منها ، مثل الذي رأيت ، فقالت : يا رسول الله ، أنا جويرية بنت الحارث ، وإنما كان من أمري ما لا يخفى عليك ، وإني وقعت في سهم ثابت بن قيس بن شماس ، وإني كاتبت على نفسي ، فجئتك أسألك في كتابتي . فقال رسول الله صلى الله عليه وسلم : فهل لك إلى ما هو خير منه ؟ قالت : وما هو يا رسول الله ؟ قال : أؤدي عنك كتابتك وأتزوجك . قالت : قد فعلت . قالت : فتسامع – تعني الناس - أن رسول الله صلى الله عليه وسلم ، قد تزوج جويرية ، فأرسلوا ما في أيديهم من السبي ، فأعتقوهم ، وقالوا : أصهار رسول الله صلى الله عليه وسلم ، فما رأينا امرأة كانت أعظم بركة على قومها منها ، أعتق في سببها ، مائة أهل بيت من بني المصطلق \nالراوي: عائشة - خلاصة الدرجة: حسن - المحدث: ابن القطان - المصدر: أحكام النظر - الصفحة أو الرقم: 153 \nفقد كانت قبل قليل تتحرق طلبا لاستنشاق عبير الحرية، ولكنها وجدت الأعظم من ذلك. ففرحت جويرية فرحا شديدا وتألق وجهها لما سمعته من رسول الله صلى الله عليه وسلم ، ولما سوف تلاقيه من أمان من بعد الضياع والهوان فأجابته بدون تردد أو تلعثم : \" نعم يا رسول الله\". فتزوجها النبي صلى الله عليه وسلم وأصدقها 400 درهم. \nقال أبو عمر القرطبي في الاستيعاب: كان اسمها برة فغير رسول صلى الله عليه وسلم اسمها وسماها جويرية. فأصبحت جويرية بعدها أما للمؤمنين وزوجة لسيد الأولين والآخرين صلى الله عليه وسلم.\n\nبَركة جويرية :\n\nوخرج الخبر إلى مسامع المسلمين فأرسلوا ما في أيديهم من السبي وقالوا متعاظمين: هم أصهار رسول الله صلى الله عليه وسلم . فكانت بركة جويرية من أعظم البركات على قومها. قالت عنها السيدة عائشة – رضي الله عنها -: فلقد أعتق بتزويجه إياها مائة أهل بيت من بني المصطلق، فما أعلم امرأة أعظم بركة منها.\n\nصفاتها وأهم ملامحها :\n\nكانت السيدة جويرية من أجمل النساء، كما أنها تتصف بالعقل الحصيف والرأي السديد الموفق الرصين ، والخلق الكريم والفصاحة ومواقع الكلام كما كانت تعرف بصفاء قلبها ونقاء سريرتها، وزيادة على ذلك فقد كانت واعية ، تقية، نقية، ورعة ، فقيهة ، مشرقة الروح مضيئة القلب والعقل.\n\nالذاكرة القانتة :\n\nراحت السيدة جويرية تحذو حذو أمهات المؤمنين في الصلاة والعبادة وتقتبس من الرسول صلى الله عليه وسلم ومن أخلاقه وصفاته الحميدة حتى أصبحت مثلا في الفضل والفضيلة . فكانت أم المؤمنين جويرية من العابدات القانتات السابحات الصابرات، وكانت مواظبة على تحميد العلي القدير وتسبيحه وذكره .\n\nناقلة الحديث :\n\nحـــدث عنـــها ابن عبــــاس، وعبـــيد بن السباق، وكريب مولى ابن عباس ومجاهد وأبو أيوب يحيى بن مالك الأزدي وجابر بن عبد الله. بلغ مسندها في كتاب بقي منه مخلد سبعة أحاديث منها أربعة في الكتب الستة، عند البخاري حديث وعند مسلم حديثان. وقد تضمنت مروياتها أحاديث في الصوم، في عدم تخصيص يوم الجمعة بالصوم، وحديث في الدعوات في ثواب التسبيح، وفي الزكاة في إباحة الهدية للنبي صلى الله عليه وسلم وإن كان المهدي ملكها بطريق الصدقة، كما روت في العتق.\n\nوهكذا وبسبعة أحاديث شريفة خلدت أم المؤمنين جويرية بنت الحارث رضي الله عنها اسمها في عالم الرواية، لتضيف إلى شرف صحبتها للنبي صلى الله عليه وسلم وأمومتها للمسلمين، تبليغها الأمة سنن المصطفى صلى الله عليه وسلم، ما تيسر لها ذلك. ومن الأحاديث منها \" دخل رسول الله صلى الله عليه وسلم على جويرية بنت الحارث يوم الجمعة وهي صائمة فقال لها : أصمت أمس ؟ قالت : لا قال : أتريدين أن تصومي غدا ؟ قالت : لا قال : فأفطري ))\n\nالراوي: عبدالله بن عمرو بن العاص - خلاصة الدرجة: إسناده صحيح، لكن أعله الحافظ بالمخالفة - المحدث: الألباني - المصدر: صحيح ابن خزيمة - الصفحة أو الرقم: 2163\n\nلقاء الله وفاتها :\n\nعاشت السيدة جويرية بعد رسول الله راضية مرضية، وامتدت حياتها إلى خلافة سيدنا معاوية بن أبي سفيان رضي الله عنهما. وتوفيت أم المؤمنين في شهر ربيع الأول من السنة الخمسين للهجرة النبوية الشريفة، وشيع جثمانها في البقيع وصلى عليها مروان بن الحكم. ",
    "number-en": "The story of Juwayriyah bint Al-Harith",
    "label-en": "A fragrant biography that many good people would like to be a part of. There is nothing truer, more beautiful, and fresher than the biography of one of the ladies and mothers of the believers. We stand on her biography; To be an example and a sermon for us. Let us take a close and blessed snippet from the biography of the Mother of the Believers, Juwayriyah, whom God Almighty has designated for purity, and how beautiful is her fragrant biography. May God be pleased with her and pleased with her. The origins of Juwayriyah, Mother of the Believers:\n\nShe is Barra bint Al-Harith bin Abi Dirar bin Habib bin Aidh bin Malik from Khuza’a. Her father was the master and leader of the Banu Al-Mustaliq. Barra lived in her father’s house, proud and honorable, in luxury and glory, and in a house dominated by nobility and authenticity. At a young age, Barra married Musafa’ bin Safwan, one of the boys of Khuza’a, and she was not more than twenty years old. The beginnings of light:\n\nSatan began to infiltrate the hearts of the Banu al-Mustaliq and pretended to them that they were strong and capable of defeating the Muslims. They began to prepare and prepare to fight the Muslim community under the leadership of the Messenger, may God bless him and grant him peace. They gathered to fight the Messenger of God, may God bless him and grant him peace, and their master, Al-Harith bin Abi Dirar, was leading them. The result of the fighting was the victory of the Prophet, may the peace and blessings of God be upon him, and the defeat of the Banu al-Mustaliq in their own backyard. The Prophet only took many men and women captive, and Musafa bin Safwan, Juwayriyah’s husband, was one of those killed by Muslim swords. Mrs. Juwayriyah bint Al-Harith was one of the women who fell into captivity, so she fell into the share of Thabit bin Qais bin Shammas Al-Ansari, may God be pleased with him. Then she agreed with him on a sum of money to pay him in exchange for her emancipation, because she longed for freedom.\n\nJuwayriyah’s marriage to the Messenger, may God bless him and grant him peace:\n\nJuwayriyah bint Al-Harith bin Al-Mustaliq fell into the share of Thabit bin Qais bin Shammas - or his cousin - so she wrote for herself, and she was a sailing woman who was taken by the eye. Aisha said: She came to ask the Messenger of God, may God’s prayers and peace be upon him, about her writing. When she stood at the door and I saw her, I hated her place, and I knew that the Messenger of God, may God’s prayers and peace be upon him, would see from her the same as what I saw. She said: O Messenger of God, I am Juwayriyah bint Al-Harith, but there was something about me that was not hidden from you, and I fell into the arrow of Thabit bin Qais bin Shammas, and I wrote against myself. So I came to you to ask you in my writing. The Messenger of God, may God bless him and grant him peace, said: Do you have anything better than him? She said: What is it, O Messenger of God? He said: I will pay your debt and marry you. She said: I did. She said: So you heard - meaning the people - that the Messenger of God, may God’s prayers and peace be upon him, married Juwayriyah, so they sent what was in their hands of captives, so they freed them, and they said: The in-laws of the Messenger of God, may God’s prayers and peace be upon him, and we have never seen a woman who was a greater blessing to her people than her. For her reason, a hundred members of a family from Banu Al-Mustaliq were freed. \nNarrator: Aisha - Summary of grade: Hassan - Narrator: Ibn Al-Qattan - Source: Ahkam al-Nadhar - Page or number: 153 \nA short time ago, she was eager to breathe the scent of freedom, but she found something greater than that. Juwayriyah was extremely happy, and her face shone when she heard it from the Messenger of God, may God bless him and grant him peace, and the security she would find in him after loss and humiliation. She answered him without hesitation or stuttering: “Yes, O Messenger of God.” So the Prophet, may God bless him and grant him peace, married her and gave her 400 dirhams. \nAbu Omar Al-Qurtubi said in Al-Isti’ab: Her name was Barrah, so the Messenger, may God bless him and grant him peace, changed her name and called her Juwayriyah. Juwayriyah then became a mother to the believers and a wife to the master of the first and the last, may God bless him and grant him peace.\n\nJuwayriyah pond:\n\nThe news spread to the ears of the Muslims, so they sent the captives they had in their hands and said, aggrandizing: They are the in-laws of the Messenger of God, may God bless him and grant him peace. Juwayriyah’s blessing was one of the greatest blessings for her people. Mrs. Aisha - may God be pleased with her - said about her: By marrying her, he freed a hundred members of the family from the Banu Mustaliq, and I do not know of a woman more blessed than her.\n\nIts characteristics and most important features:\n\nMrs. Juwayriyah was one of the most beautiful women. She was also characterized by a wise mind, sound opinion, sound judgment, noble character, eloquence, and good speaking skills. She was also known for the purity of her heart and the purity of her soul. Moreover, she was aware, pious, pure, pious, jurisprudential, bright in spirit, luminous in heart and mind. Long memory:\n\nMrs. Juwayriyah began to follow the example of the Mothers of the Believers in prayer and worship, and to quote the Messenger, may God bless him and grant him peace, and his morals and good qualities, until she became an example of grace and virtue. The Mother of the Believers, Juwayriyah, was one of the devout, patient, and patient worshippers, and she was constant in praising, glorifying, and remembrance of the Almighty.\n\nConveyor of the hadith:\n\nIt was narrated by Ibn Abbas, Ubaid bin Al-Sabaq, Kurayb, the client of Ibn Abbas, Mujahid, Abu Ayyub Yahya bin Malik Al-Azdi, and Jabir bin Abdullah. Its chain of transmission in a book from which an immortal remains contains seven hadiths, including four in the six books. Bukhari has one hadith and two hadiths have Muslim. Her narrations included hadiths about fasting, about not singling out Friday for fasting, and a hadith about supplications regarding the reward of praising God, and about zakat, regarding the permissibility of a gift to the Prophet, may God bless him and grant him peace, even if the Mahdi owned it through charity, as she narrated about emancipation. Thus, with seven honorable hadiths, the Mother of the Believers Juwayriyah bint Al-Harith, may God be pleased with her, immortalized her name in the world of narration, adding to the honor of her companionship with the Prophet, may God bless him and grant him peace, and her motherhood to Muslims, and her conveying to the nation the Sunnahs of the Chosen One, may God bless him and grant him peace, as long as she was able to do so. Among the hadiths, including: “The Messenger of God, may God bless him and grant him peace, entered upon Juwayriyah bint Al-Harith on Friday while she was fasting, and he said to her: Did you fast yesterday? She said: No. He said: Do you want to fast tomorrow?” She said: No. He said: Then break your fast.)\n\nNarrator: Abdullah bin Amr bin Al-Aas - Summary of the degree: Its chain of transmission is authentic, but Al-Hafiz attributed it to the contradiction - The narrator: Al-Albani - Source: Sahih Ibn Khuzaymah - Page or number: 2163\n\nMeeting God and her death:\n\nMrs. Juwayriyah lived contented and satisfactory after the Messenger of God, and her life extended until the caliphate of our master Muawiyah bin Abi Sufyan, may God be pleased with them both. The Mother of the Believers died in the month of Rabi’ al-Awwal of the fiftieth year of the noble Prophet’s migration, and her body was buried in al-Baqi’ and Marwan bin al-Hakam prayed over her."
  },
  {
    "number": "قصة صفية بنت حُيَى بن اخطَب",
    "text": "",
    "label": "نسبها :\n\nهي صفية بنت حيي بن أخطب. يتصل نسبها بهارون النبي عليه السلام. \nتقول:\" كنت أحب ولد أبي إليه، وإلى عمي أبي ياسر لم ألقهما قط مع ولدهما إلا أخذاني دونه. فلما قدم رسول الله المدينة، غدا عليه أبي وعمي مغلسين، فلم يرجعا حتى كان مع غروب الشمس، فأتيا كالين ساقطين يمشيان الهوينا فهششت إليهما كما كنت أصنع، فوالله ما التفت إلي أحد منهما مع ما بهما من الغم. وسمعت عمي أبا ياسر وهو يقول لأبي: أهو هو؟ قال نعم والله. قال عمي: أتعرفه وتثبته؟ قال: نعم. قال: فما في نفسك منه؟ أجاب: عداوته والله ما بقيت\".\n\nمولدها ومكان نشأتها :\n\nلا يعرف بالضبط تاريخ ولادة صفية، ولكنها نشأت في الخزرج، كانت في الجاهلية من ذوات الشرف. ودانت باليهودية وكانت من أهل المدينة. وأمها تدعى برة بنت سموال.\n\nصفاتهــا :\n\nعرف عن صفية أنها ذات شخصية فاضلة، جميلة حليمة، ذات شرف رفيع ،\n\nحياتها قبل الإسلام :\n\nكانت لها مكانة عزيزة عند أهلها، ذكر بأنها تزوجت مرتين قبل اعتناقها الإسلام. أول أزواجها يدعى سلام ابن مشكم كان فارس القوم و شاعرهم. ثم فارقته وتزوجت من كنانة ابن الربيع ابن أبي الحقيق النصري صاحب حصن القموص، أعز حصن عند اليهود. قتل عنها يوم خيبر.\n\nكيف تعرفت على رسول الله صلى الله عليه وسلم :\n\nفي السنة السابعة من شهر محرم، استعد رسول الله عليه الصلاة والسلام لمحاربة اليهود. فعندما أشرف عليها قال: \" الله أكبر، خربت خيبر، إنا إذا نزلنا بساحة قوم فساء صباح المنذرين\".\n\nواندلع القتال بين المسلمين واليهود، فقتل رجال خيبر، وسبيت نساؤها ومن بينهم صفية، وفتحت حصونها. ومن هذه الحصون كان حصن ابن أبي الحقيق. عندما عاد بلال بالأسرى مر بهم ببعض من قتلاهم، فصرخت ابنة عم صفية، وحثت بالتراب على وجهها، فتضايق رسول الله من فعلتها وأمر بإبعادها عنه. وقال لصفية بأن تقف خلفه، وغطى عليها بثوبه حتى لا ترى القتلى. فقيل ان الرسول اصطفاها لنفسه.\n\nوذكر أن رسول الله صلى الله عليه وسلم غزا خيبر ، فصلينا عندها صلاة الغداة بغلس ، فركب نبي الله صلى الله عليه وسلم ، وركب أبو طلحة ، وأنا رديف أبي طلحة ، فأجرى نبي الله صلى الله عليه وسلم في زقاق خيبر ، وإن ركبتي لتمس فخذ نبي الله صلى الله عليه وسلم ، ثم حسر الإزار عن فخذه ، حتى إني أنظر إلى بياض فخذ نبي الله صلى الله عليه وسلم ، فلما دخل القرية قال : الله أكبر ، خربت خيبر ، إنا إذا نزلنا بساحة قوم ، فساء صباح المنذرين . قالها ثلاثا ، قال : وخرج القوم إلى أعمالهم ، فقالوا : محمد - قال عبد العزيز : وقال بعض أصحابنا : والخميس ، يعني الجيش - قال : فأصبناها عنوة ، فجمع السبي ، فجاء دحية ، فقال : يا نبي الله ، أعطني جارية من السبي ، قال : اذهب فخذ جارية . فأخذ صفية بنت حيي ، فجاء رجل إلى النبي صلى الله عليه وسلم فقال : يا نبي الله ، أعطيت دحية صفية بنت حيي ، سيدة قريظة والنضير ، لا تصلح إلا لك ، قال : ادعوه بها . فجاء بها ، فلما نظر إليها النبي صلى الله عليه وسلم قال : خذ جارية من السبي غيرها . قال : فأعتقها النبي صلى الله عليه وسلم وتزوجها . فقال له ثابت : يا أبا حمزة ، ما أصدقها ؟ قال : نفسها ، أعتقها وتزوجها ، حتى إذا كان بالطريق ، جهزتها له أم سليم ، فأهدتها له من الليل ، فأصبح النبي صلى الله عليه وسلم عروسا ، فقال : من كان عنده شيء فليجيء به . وبسط نطعا ، فجعل الرجل يجيء بالتمر ، وجعل الرجل يجيء بالسمن ، قال : وأحسبه قد ذكر السويق ، قال : فحاسوا حيسا ، فكانت وليمة رسول الله صلى الله عليه وسلم .\n\nالراوي: أنس بن مالك - خلاصة الدرجة: [صحيح] - المحدث: البخاري - المصدر: الجامع الصحيح - الصفحة أو الرقم: 371 \nإسلامهــا :\n\nكعادة رسول الله لا يجبر أحداً على اعتناق الإسلام إلا أن يكون مقتنعاً بما أنزل الله من كتاب وسنة. فسألها الرسول صلى الله عليه وسلم عن ذلك، وخيرها بين البقاء على دين اليهودية أو اعتناق الإسلام. فإن اختارت اليهودية اعتقها، وإن أسلمت سيمسكها لنفسه. وكان اختيارها الإسلام الذي جاء عن رغبة صادقة في التوبة وحباً لهدي محمداً صلى الله عليه وسلم.\n\nعند قدومها من خيبر أقامت في منزل لحارثة بن النعمان، وقدمت النساء لرؤيتها لما سمعوا عن جمالها، وكانت من بين النساء عائشة - رضي الله عنها- ذكر بأنها كانت منتقبة. و بعد خروجها سألها رسول الله عن صفية، فردت عائشة: رأيت يهودية، قال رسول الله : \" لقد أسلمت وحسن إسلامها\".\n\nيوم زفافها لمحمد عليه الصلاة السلام :\n\nأخذها رسول الله إلى منزل في خيبر، ليتزوجا ولكنها رفضت، فأثر ذلك على نفسة رسولنا الكريم. فأكملوا مسيرهم إلى الصهباء. وهناك قامت أم سليم بنت ملحان بتمشيط صفية وتزينها وتعطيرها، حتى ظهرت عروساً تلفت الأنظار. كانت تعمرها الفرحة، حتى أنها نسيت ما ألم بـأهلها. وأقيمت لها وليمة العرس، أما مهرها فكان خادمةً تدعى رزينة. وعندما دخل الرسول عليه الصلاة والسلام على صفية، أخبرته بأنها في ليلة زفافها بكنانة رأت في منامها قمراً يقع في حجرها، فأخبرت زوجها بذلك، فقال غاضبا: ً لكأنك تمنين ملك الحجاز محمداً ولطمها على وجهها.\n\nثم سألها الرسول عليه الصلاة والسلام عن سبب رفضها للعرس عندما كانا في خيبر، فأخبرته أنها خافت عليه قرب اليهود. قالت أمية بنت أبي قيس سمعت أنها لم تبلغ سبع عشرة سنة يوم زفت إلى رسول الله صلى الله عليه وسلم. \nمواقفها مع زوجات النبي \nبلغ صفية أن حفصة قالت بنت يهودي فبكت فدخل عليها النبي صلى الله عليه وسلم وهي تبكي فقال ما يبكيك قالت قالت لي حفصة إني ابنة يهودي فقال النبي صلى الله عليه وسلم وإنك لابنة نبي وإن عمك لنبي وإنك لتحت نبي ففيم تفخر عليك ثم قال اتقي الله يا حفصة \" الراوي: أنس بن مالك - خلاصة الدرجة: إسناده صحيح - المحدث: الألباني - المصدر: مشكاة المصابيح - الصفحة أو الرقم: 6143\n\nأن النبي صلى الله عليه وسلم حج بنسائه حتى إذا كان ببعض الطريق نزل رجل فساق بهم فأسرع فقال النبي صلى الله عليه وسلم كذاك سوقك بالقوارير يعني النساء فبينا هم يسيرون برك بصفية ابنة حيي جملها وكانت من أحسنهن ظهرا فبكت وجاء رسول الله صلى الله عليه وسلم حتى أخبر بذلك فجعل يمسح دموعها بيده وجعلت تزداد بكاء وهو ينهاها فلما أكثرت زجرها وانتهرها وأمر الناس فنزلوا ولم يكن يريد أن ينزل قالت فنزلوا وكان يومي فلما نزلوا ضرب خباء رسول الله صلى الله عليه وسلم ودخل فيه قالت فلم أدر على ما أهجم من رسول الله صلى الله عليه وسلم فخشيت أن يكون في نفسه شيء فانطلقت إلى عائشة فقلت لها تعلمين أني لم أكن لأبيع يومي من رسول الله صلى الله عليه وسلم أبدا وإني قد وهبت يومي لك على أن ترضي رسول الله صلى الله عليه وسلم عني قالت نعم قال فأخذت عائشة خمارا لها قد ثردته بزعفران فرشته بالماء ليذكى ريحه ثم لبست ثيابها ثم انطلقت إلى رسول الله صلى الله عليه وسلم فرفعت طرف الخباء فقال مالك يا عائشة إن هذا ليس بيومك قالت ذلك فضل الله يؤتيه من يشاء قال مع أهله فلما كان عند الرواح قالت لزينب بنت جحش أفقري أختك صفية جملا وكانت من أكثرهن ظهرا فقالت أنا أفقر يهوديتك فغضب النبي صلى الله عليه وسلم حين سمع ذلك منها فهجرها فلم يكلمها حتى قدم مكة وأيام منى في سفره حتى رجع إلى المدينة والمحرم وصفر فلم يأتها ولم يقسم لها حتى يئست منه فلما كان شهر ربيع الأول دخل عليها فرأت ظله فقالت إن هذا لظل رجل وما يدخل علي النبي صلى الله عليه وسلم فدخل النبي صلى الله عليه وسلم فلما دخل قالت يا رسول الله ما أدري ما أصنع حين دخلت علي قال وكانت لها جارية وكانت تخبؤها من رسول الله صلى الله عليه وسلم فقالت فلانة لك فمشى النبي صلى الله عليه وسلم إلى سرير زينب وكان قد رفع فوضعه بيده ثم أصاب أهله ورضي عنهم.\n\nالراوي: صفية بنت حيي - خلاصة الدرجة: [فيه] شمية أو سمية [الراوي عن صفية] فإن كانتا واحدة فالحديث صحيح - المحدث: الألباني - المصدر: السلسلة الصحيحة - الصفحة أو الرقم: 7/621 \nوفاة النبي عليه الصلاة و السلام :\n\nعن زيد بن أسلم قال : اجتمع نساء النبي صلى الله عليه وآله وسلم في مرضه الذي توفي فيه ، واجتمع إليه نساؤه ، فقالت صفية بنت حيي : إني والله يا نبي الله لوددت أن الذي بك بي ، فغمزن أزواجه ببصرهن ، فقال : مضمضن ، فقلن من أي شيء ؟ فقال : من تغامزكن بها ، والله إنها لصادقة \nالراوي: زيد بن أسلم - خلاصة الدرجة: إسناده حسن - المحدث: ابن حجر العسقلاني - المصدر: الإصابة - الصفحة أو الرقم: 4/347 \nوبعد وفاته صلى الله عليه وسلم افتقدت الحماية و الأمن، فظل الناس يعيرونها بأصلها. \nمواقف أخرى لصفية \nكان رسول الله صلى الله عليه وسلم معتكفا فأتيته أزوره ليلا فحدثته وقمت فانقلبت فقام معي ليقلبني وكان مسكنها في دار أسامة بن زيد فمر رجلان من الأنصار فلما رأيا النبي صلى الله عليه وسلم أسرعا فقال النبي صلى الله عليه وسلم على رسلكما إنها صفية بنت حيي . قالا : سبحان الله يا رسول الله ! ! قال : إن الشيطان يجري من الإنسان مجرى الدم ، فخشيت أن يقذف في قلوبكما شيئا – أو قال : شرا - \nالراوي: صفية - خلاصة الدرجة: صحيح - المحدث: الألباني - المصدر: صحيح أبي داود - الصفحة أو الرقم: 4994\n\nوفي عهد عمر بن الخطاب – رضي الله عنه- ، جاءته جارية لصفية تخبره بأن صفية تحب السبت وتصل اليهود، فلما استخبر صفية عن ذلك، فأجابت قائلة\" فأما السبت لم أحبه بعد أن أبدلني الله به بيوم الجمعة، وأما اليهود فإني أصل رحمي\". وسألت الجارية عن سبب فعلتها فقالت: الشيطان. فأعتقتها صفية.\n\nوفاتها :\n\nلها في كتب الحديث عشرة أحاديث. أخرج منها في الصحيحين حديث واحد متفق عليه- روى عنها ابن أخيها ومولاها كنانة ويزيد بن معتب، وزين العابدين بن علي بن الحسين، واسحاق بن عبدالله بن الحارث، ومسلم بن صفوان.\n\nتوفيت في المدينة، في عهد الخلفية معاوية، سنة 50 هجرياً. و دفنت بالبقيع مع أمهات المؤمنين، رضي الله عنهن جمعياً. \nالخاتمة :\n\nعندما سألها عن يوم السبت وزيارتها لليهود. فرغم أنها أسلمت لم تنسى أهلها، وهذا الشيء حث عليه ديننا الحنيف",
    "number-en": "The story of Safiyya bint Huyya bin Akhtab",
    "label-en": "Her lineage:\n\nShe is Safiyya bint Huyay bin Akhtab. Her lineage is related to Aaron the Prophet, peace be upon him. \nShe says: “I loved my father’s son to him, and to my uncle Abu Yasser. I never met them with their son except that they took me instead of him. When the Messenger of God came to Medina, my father and my uncle came to him bathed, and they did not return until it was sunset. They came two fallen men, walking slowly, so I rushed towards them as I used to do. By God, neither of them turned to me despite their grief. And I heard my uncle Abu Yasser saying to my father: Is it him? He said. Yes, by God. My uncle said: Do you know him and confirm him? He said: Yes. He said: What do you have in mind? He replied: “His enmity, by God, will not remain.”\n\nHer birth and place of upbringing:\n\nThe exact date of Safiya's birth is not known, but she grew up in Khazraj and was an honorable woman in pre-Islamic times. She converted to Judaism and was one of the people of Medina. Her mother's name is Barra bint Samwal.\n\nIts characteristics:\n\nSafiyya was known to have a virtuous personality, beautiful, forbearing, and of high honor.\n\nHer life before Islam:\n\nShe had a dear status among her family, and it was mentioned that she married twice before converting to Islam. Her first husband, called Salam Ibn Mishkam, was the people's knight and poet. Then she left him and married Kinana Ibn al-Rabi’ Ibn Abi al-Haqiq al-Nasri, the owner of Qamous Fort, the most precious fortress among the Jews. He was killed on her behalf on the Day of Khaybar.\n\nHow did you get to know the Messenger of God, may God bless him and grant him peace:\n\nIn the seventh year of the month of Muharram, the Messenger of God, may God bless him and grant him peace, prepared to fight the Jews. When he overlooked it, he said: “God is great, Khaybar has been destroyed. When we camp in a people’s square, the morning of the warners will be broken.”\n\nFighting broke out between Muslims and Jews, and Khaybar's men were killed, its women, including Safiyya, were taken captive, and its fortresses were opened. Among these forts was the fort of Ibn Abi al-Haqiq. When Bilal returned with the captives, he passed by some of their dead, and Safiyya’s cousin screamed and threw dirt on her face. The Messenger of God was upset by her action and ordered her to be kept away from him. He told Safiyya to stand behind him, and he covered her with his dress so that she would not see the dead. It was said that the Messenger chose her for himself.\n\nHe mentioned that the Messenger of God, may God’s prayers and peace be upon him, invaded Khaybar, and we then prayed the morning prayer in Ghalas, so the Prophet of God, may God’s prayers and peace be upon him, rode, and Abu Talha rode, and I was Abu Talha’s sidekick, so the Prophet of God, may God’s prayers and peace be upon him, ran in the alley of Khaybar, and my knees touched the thigh of the Prophet of God, may God’s prayers and peace be upon him. Then he removed the garment from his thigh, so that I can see the whiteness of the thigh of the Prophet of God, may God bless him and grant him peace. When he entered the town, he said: God is Great, Khaybar has been destroyed. When we camped in a people’s square, the morning of those who had warned us became bad. He said it three times, he said: And the people went out to their work, and they said: Muhammad - Abdul Aziz said: And some of our companions said: And Al-Khamis, meaning the army - he said: So we hit her by force, so he gathered the captives, so Dihya came and said: O Prophet of God, give me a slave girl from the captivity, he said: Go and take a slave girl. So he took Safiyya bint Huyay, and a man came to the Prophet, may God’s prayers and peace be upon him, and said: O Prophet of God, I gave Dihya to Safiyya bint Huyya, the mistress of Qurayza and al-Nadir, who is only fit for you. He said: Call him by her. So he brought her, and when the Prophet, may God bless him and grant him peace, looked at her, he said: Take another slave girl from captivity. He said: So the Prophet, may God bless him and grant him peace, freed her and married her. Thabit said to him: O Abu Hamza, how do I believe her? He said: Herself, so he freed her and married her, until when he was on the way, Umm Salim prepared her for him, so she gave her to him during the night. Then the Prophet, may God bless him and grant him peace, became a bride, and he said: Whoever has something, let him bring it. Nata spread out, and the man started bringing dates, and the man started bringing ghee. He said: And I think he mentioned the stalk. He said: So they felt a ghee, so it was the feast of the Messenger of God, may God bless him and grant him peace. Narrator: Anas bin Malik - Summary of grade: [Sahih] - Hadith: Al-Bukhari - Source: Al-Jami’ Al-Sahih - Page or number: 371 \nHer conversion to Islam:\n\nAs usual, the Messenger of God does not force anyone to convert to Islam unless he is convinced of what God has revealed of the Book and Sunnah. The Messenger, may God bless him and grant him peace, asked her about that, and gave her the choice between remaining in the religion of Judaism or converting to Islam. If she chooses Judaism, he will free her, and if she converts to Islam, he will keep her for himself. Her choice was Islam, which came from a sincere desire to repent and out of love for the guidance of Muhammad, may God bless him and grant him peace.\n\nWhen she came from Khaybar, she stayed in the house of Haritha bin Al-Numan, and women came to see her when they heard about her beauty. Among the women was Aisha - may God be pleased with her - it was mentioned that she was veiled. After she left, the Messenger of God asked her about Safiyya, and Aisha replied: I saw a Jew. The Messenger of God said: “She has converted to Islam and her Islam is good.”\n\nHer wedding day to Muhammad, peace be upon him:\n\nThe Messenger of God took her to a house in Khaybar, so that they could get married, but she refused, and this affected the soul of our honorable Messenger. So they continued their journey to Al-Sahba. There, Umm Salim bint Malhan combed Safiyya, decorated her, and perfumed her, until she appeared as a bride that caught attention. She was so happy that she forgot what happened to her family. A wedding feast was held for her, and her dowry was a maid named Razina. When the Messenger, peace and blessings be upon him, entered upon Safiyya, she told him that on the night of her wedding in Kinana, she saw in her dream a moon falling on her lap, so she told her husband about it, and he said angrily: It is as if you wished for the King of Hijaz, Muhammad, and slapped her in the face. Then the Messenger, peace and blessings be upon him, asked her why she refused the wedding when they were in Khaybar, and she told him that she feared for him if he was close to the Jews. Umayyah bint Abi Qais said: I heard that she was not seventeen years old on the day she was married to the Messenger of God, may God bless him and grant him peace. \nHer positions with the Prophet’s wives \nIt was reported to Safiya that Hafsa said, “The daughter of a Jew,” and she cried. Then the Prophet, may God’s prayers and peace be upon him, entered upon her while she was crying. He said, “What makes you cry?” She said, “Hafsa said to me, ‘I am the daughter of a Jew.’ Then the Prophet, may God’s prayers and peace be upon him, said, ‘You are the daughter of a prophet, and your paternal uncle is a prophet, and you are under a prophet. Why should she be proud of you?’ Then he said, ‘Fear God, Hafsa.’” Narrator: Anas bin Malik - Khalas Degree: Its chain of transmission is authentic - Hadith: Al-Albani - Source: Mishkat Al-Masabi - Page or number: 6143\n\nThe Prophet, may God’s prayers and peace be upon him, performed Hajj with his wives, until, along the way, a man came down and led them, so he hurried off, and the Prophet, may God’s prayers and peace be upon him, said, “That’s how he drove you with bottles,” meaning the women. While they were walking along Barak, with Safiyya, the daughter of Hayya, her camel, and she was one of the best among them at the back, so she cried. And the Messenger of God, may God’s prayers and peace be upon him, came until he was informed of this, so he began wiping her tears with his hand, and she began to cry even more as he forbade her. When she continued, he rebuked her, rebuked her, and ordered the people, so they dismounted. He did not want to go down. She said, “So they went down, and it was my day.” When they went down, He struck the hide of the Messenger of God, may God’s prayers and peace be upon him, and entered it. She said, “I did not know what had been attacked by the Messenger of God, may God’s prayers and peace be upon him, so I feared that something might be in his mind. So I went to Aisha and said to her, ‘You know that I would never sell my day to the Messenger of God, may God’s prayers and peace be upon him, and that I had given my day to you on the condition that you would please the Messenger of God, may God’s prayers and peace be upon him, on my behalf.’ She said, ‘Yes.’ He said, so Aisha took a veil for herself and had covered it with saffron.” She brushed it with water to sweeten its scent, then she put on her clothes, then went to the Messenger of God, may God bless him and grant him peace, and raised the edge of the tent. He said, “What is the matter with you, O Aisha, this is not your day.” She said, “This is the grace of God that He bestows.” Whoever he wants, he said with his family. When he was with Al-Rawah, she said to Zainab bint Jahsh, “Impoverish your sister Safiyya in camels.” She was one of the most generous among them. She said, “I impoverish your Jewishness.” The Prophet, may God bless him and grant him peace, became angry when he heard that from her, so he abandoned her and did not speak to her until he came to Mecca and a few days from Mina in his travel until he returned to Medina and Muharram. He whistled, but he did not come to her and did not swear to her until she gave up on him. When the month of Rabi’ al-Awwal came, he entered upon her, and she saw his shadow, and she said, “This is a shadow.” A man did not enter upon the Prophet, may God bless him and grant him peace. So the Prophet, may God bless him and grant him peace, entered, and when he entered, she said, “O Messenger of God, I do not know what to do when you entered upon me.” He said, “And she had a maid and a woman.” She was hiding it from the Messenger of God, may God bless him and grant him peace. She said, “So and so is yours.” The Prophet, may God bless him and grant him peace, walked to Zainab’s bed, which had been raised, so he placed it in his hand, then he went to his family and was satisfied with them.\n\nNarrator: Safiyya bint Huyay - Summary of the degree: [in it] Shamiya or Sumayyah [narrated on the authority of Safiyya] If they are the same, then the hadith is authentic - Hadith: Al-Albani - Source: Al-Silsilah Al-Sahih - Page or number: 7/621 \nThe death of the Prophet, peace and blessings be upon him:\n\nOn the authority of Zaid bin Aslam, he said: The wives of the Prophet, may God’s prayers and peace be upon him and his family, gathered during his illness in which he died, and his wives gathered to him. Safiya bint Huyay said: By God, O Prophet of God, I wish that the one who made you cry was on me. So his wives blinked their eyes, and he said: He rinsed his mouth, so say: From what? He said: Whoever flirts with you, by God, she is telling the truth \nNarrator: Zaid bin Aslam - Summary of the degree: Its chain of transmission is good - Narrator: Ibn Hajar Al-Asqalani - Source: Al-Isaba - Page or number: 4/347 \nAfter his death, may God bless him and grant him peace, it lost protection and security, so people continued to insult it for its origin. Other positions for Safia \nThe Messenger of God, may God bless him and grant him peace, was in seclusion, so I came to visit him at night, so I spoke to him and got up and turned around, so he stood up with me to turn me around. Her residence was in the house of Usama bin Zaid, so two Ansar men passed by, and when they saw the Prophet, may God bless him and grant him peace, they hurried, and the Prophet, may God’s prayers and peace be upon him, said to your messengers, “She is Safiyya bint Huyay.” They said: Glory be to God, O Messenger of God! ! He said: Satan flows from a person like blood, so I feared that he would throw something into your hearts - or he said: evil - \nNarrator: Safiya - Summary of grade: Sahih - Hadith: Al-Albani - Source: Sahih Abi Dawud - Page or number: 4994\n\nDuring the reign of Omar ibn al-Khattab - may God be pleased with him - a maid of Safiyya’s came to him and told him that Safiyya loved the Sabbath and was connected with the Jews. When he asked Safiyya about that, she replied, saying, “As for the Sabbath, I did not love it after God replaced it with Friday. As for the Jews, I am a relative of my family.” The maid asked the reason for what she did and she said: Satan. So Safiya freed her.\n\nHer death:\n\nShe has ten hadiths in hadith books. One agreed-upon hadith was extracted from her in the two Sahihs - narrated on her authority by her nephew and her client, Kinana, Yazid bin Mu’tab, Zain al-Abidin bin Ali bin al-Hussein, Ishaq bin Abdullah bin al-Harith, and Muslim bin Safwan.\n\nShe died in Medina, during the reign of Muawiyah, in the year 50 AH. She was buried in Al-Baqi with the Mothers of the Believers, may God be pleased with them all. \nConclusion:\n\nWhen he asked her about the Sabbath and her visit to the Jews. Even though she converted to Islam, she did not forget her family, and this is what our true religion urged"
  },
  {
    "number": "قصة أم حبيبة رَملة بنت أبى سفيان",
    "text": "",
    "label": "نسبها ونشأتها :\n\nأم المؤمنين، السيدة المحجبة، من بنات عم الرسول- صلى الله عليه وسلم- ، رملة بنت أبي سفيان صخر بن حرب بن أمية بن عبد شمس بن عبد مناف . صحابية جليلة، ابنة زعيم، وأخت خليفة، وزوجة خاتم النبيين محمد- عليه الصلاة والسلام\n\nفأبوها أبو سفيان، زعيم ورئيس قريش، والذي كان في بداية الدعوة العدو اللدود للرسول- عليه الصلاة والسلام- وأخوها معاوية بن أبي سفيان، أحد الخلفاء الأمويين، ولمكانة وجلالة منزلة أم حبيبة في دولة أخيها (في الشام)، قيل لمعاوية: \"خال المؤمنين\" . وأخيراً، فهي من زوجات الرسول-عليه الصلاة والسلام-، فليس هناك من هي أكثر كرماً وصداقاً منها، ولا في نسائه من هي نائية الدار أبعد منها. وهذا دليل على زهدها وتفضيلها لنعم الآخرة على نعيم الدنيا الزائل\n\nكانت أم حبيبة من ذوات رأي وفصاحة، تزوجها أولاً عبيد الله بن جحش، وعندما دعا الرسول- عليه الصلاة والسلام- الناس في مكة إلى الإسلام، أسلمت رملة مع زوجها في دار الأرقم بن أبي الأرقم، وحينما اشتد الأذى بالمسلمين في مكة؛ هاجرت رملة بصحبة زوجها فارة بدينها متمسكة بعقيدتها، متحملة الغربة والوحشة، تاركة الترف والنعيم التي كانت فيها، بعيدة عن مركز الدعوة والنبوة، متحملة مشاق السفر والهجرة، فأرض الحبشة بعيدة عن مكة، والطريق تتخلله العديد من الطرق الوعرة، والحرارة المرتفعة، وقلة المؤونة، كما أن رملة في ذلك الوقت كانت في شهور حملها الأولى، في حين نرى بأن سفر هذه الأيام سفر راحة ورفاهية، ووسائل النقل المتطورة ساعدت على قصر المسافة بين الدول. وبعد أشهر من بقاء رملة في الحبشة، أنجبت مولودتها \"حبيبة\"، فكنيت \"بأم حبيبة\".\n\nرؤية أم حبيبة :\n\nفي إحدى الليالي، رأت أم حبيبة في النوم أن زوجها عبيد الله في صورة سيئة، ففزعت من ذلك ، وحينما أصبحت، أخبرها زوجها بأنه وجد في دين النصرانية ما هو أفضل من الإسلام، فحاولت رملة أن ترده إلى الإسلام ولكنها وجدته قد رجع إلى شرب الخمر من جديد. وفي الليلة التالية، رأت في منامها أن هناك منادياً يناديها بأم المؤمنين، فأولت أم حبيبة بأن الرسول سوف يتزوجها. وبالفعل؛ مع مرور الأيام، توفي زوجها على دين النصرانية، فوجدت أم حبيبة نفسها غريبة في غير بلدها، وحيدة بلا زوج يحميها، أمًّا لطفلة يتيمة في سن الرضاع، وابنة لأب مشرك تخاف من بطشه ولا تستطيع الالتحاق به في مكة، فلم تجد هذه المرأة المؤمنة غير الصبر والاحتساب، فواجهت المحنة بإيمان وتوكلت على الله- سبحانه وتعالى\n\nزواج أم حبيبة :\n\nعلم الرسول- صلى الله عليه وسلم- بما جرى لأم حبيبة، فأرسل إلى النجاشي طالباً الزواج منها، ففرحت أم حبيبة ، وصدقت رؤياها، فعهدها وأصدقها النجاشي أربعمائة دينار، ووكلت هي ابن عمها خالد بن سعيد ابن العاص، وفي هذا دلالة على أنه يجوز عقد الزواج بالوكالة في الإسلام. وبهذا الزواج خفف الرسول من عداوته لبني أمية، فعندما علم أبو سفيان زواج الرسول من ابنته رملة، قال: ذاك الفحل، لا يقرع أنفه! ويقصد أن الرسول رجل كريم، وبهذه الطريقة خفت البغضاء التي كانت في نفس أبي سفيان على الرسول- صلى الله عليه وسلم-، كما أن في هذا الموقف دعوة إلى مقابلة السيئة بالحسنة، لأنها تؤدي إلى دفع وزوال الحقد والضغينة و صفاء النفوس بين المتخاصمين \nأبو سفيان في بيت أم حبيبة \nحينما نقض المشركون في مكة صلح الحديبية، خافوا من انتقام الرسول- صلى الله عليه وسلم-، فأرسلوا أبا سفيان إلى المدينة لعله ينجح في إقناع الرسول بتجديد الصلح، وفي طريقه إلى النبي- عليه الصلاة والسلام-، مر أبو سفيان على ابنته أم حبيبة في بيتها، وعندما هم بالجلوس على فراش الرسول- صلى الله عليه وسلم- سحبته أم حبيبة من تحته وطوته بعيداً عنه، فقال أبو سفيان: \"أراغبة بهذا الفراش يا بنية عني؟ أم بي عنه؟\" ، فأجابته: \"بل به عنك ، لأنه فراش الرسول- صلى الله عليه وسلم- وأنت رجل نجس غير مؤمن\"، فغضب منها، وقال: \"أصابك بعدي شر\"، فقالت: \"لا والله بل خير\". وهنا نجد بأن هذه المرأة المؤمنة أعطت أباها المشرك درساً في الإيمان، ألا وهو أن رابطة العقيدة أقوى من رابطة الدم والنسب، وأنه يجب علينا عدم مناصرة وموالاة الكفار مهما كانت صلة المسلم بهم، بل يجب علينا محاربتهم ومقاتلتهم من أجل نصرة الإسلام.\n\nلذلك ، جهز الرسول - صلى الله عليه وسلم- المسلمين لفتح مكة، وبالرغم من معرفة أم حبيبة لهذا السر، إلا أنها لم تخبر أباها، وحافظت على سر رسول الله - صلى الله عليه وسلم- وسر المسلمين. ففتح المسلمون مكة، ودخل العديد من المشركين في دين الله، وأسلم أبو سفيان، فتكاملت أفراح أم حبيبة وشكرت الله على هذا الفضل العظيم. وفي هذا الموقف إشارة إلى أنه يجب على المرأة المسلمة حفظ سر زوجها، وعدم البوح به حتى لأقرب الناس إليها، فهناك العديد من النساء اللاتي يشركن الأهل في حل المشاكل الزوجية، والكثير من هؤلاء النسوة يطلقن بسبب إفشائهن للسر وتدخل الأهل. لذلك يجب على الزوجة الصالحة المحافظة على بيت الزوجية وعدم البوح بالأسرار.\n\nدورها في رواية الحديث الشريف :\n\nروت أم حبيبة- رضي الله عنها- عدة أحاديث عن الرسول- صلى الله عليه وسلم-. بلغ مجموعها خمسة وستين حديثاً، وقد اتفق لها البخاري ومسلم على حديثين. فلأم حبيبة- رضي الله عنها- حديث مشهور في تحريم الربيبة وأخت المرأة،\" ‏فعن ‏ ‏زينب بنت أم سلمة ‏ ‏عن ‏ ‏أم حبيبة بنت أبي سفيان ‏ ‏قالت ‏ ‏دخل علي رسول الله ‏ ‏صلى الله عليه وسلم ‏ قلت : يارسول الله ، انكح أختي ابنة أبي سفيان ، قال : ( وتحبين ذلك ) . فقلت : نعم ، لست لك بمخلية ، وأحب من مشاركني في الخير أختي ، فقال : ( إن ذلك لا يحل لي ) . فقلت : يارسول الله ، فوالله إنا نتحدث أنك تريد أن تنكح درة بنت أبي سلمة ؟ قال : ( ابنة أم سلمة ) . فقلت : نعم ، فقال : ( فوالله لو لم تكن ربيبتي في حجري ما حلت لي ، إنها ابنة أخي من الرضاعة ، أرضعتني وأبا سلمة ثويبة ، فلا تعرضن علي بناتكن ولا أخواتكن ) \" . الراوي: أم حبيبة بنت أبي سفيان - خلاصة الدرجة: [صحيح] - المحدث: البخاري - المصدر: الجامع الصحيح - الصفحة أو الرقم: 5372\n\nكذلك حديثها في فضل السنن الراتبة قبل الفرائض وبعدهن. كما أنها ذكرت أحاديث في الحج، كاستحباب دفع الضعفة من النساء وغيرهن من المزدلفة إلى منى في أواخر الليل قبل زحمة الناس، كما أنها روت في وجوب الإحداد للمرأة المتوفى عنها زوجها، وفي أبواب الصوم: روت في الدعاء بعد الأذان، وفي العير التي فيها الجرس لا تصحبها الملائكة، وغيرها من الأحاديث التي كانت تصف أفعال الرسول- عليه الصلاة والسلام- وأقواله\n\nوفاتهــــا :\n\nتوفيت- رضي الله عنها- سنة 44 بعد الهجرة، ودفنت في البقيع، وكانت قد دعت عائشة- أم المؤمنين- قبل وفاتها، فقالت: قد يكون بيننا وبين الضرائر فغفر لي ولك ما كان من ذلك. . فقالت عائشة: غفر الله لك ذلك كله وتجاوز وحلك من ذلك ، فقالت أم حبيبة: سررتني سرك الله. وأرسلت إلى أم سلمة فقالت لهل: مثل ذلك ، وفي هذا إشارة إلى ما يجب على المسلمين أن يفعلوه قبل ساعة الموت، ألا وهو التسامح والمغفرة، كما فعلت أم حبيبة مع أمهات المؤمنين- رضوان الله عليهن أجمعين",
    "number-en": "The story of Umm Habiba Ramla bint Abi Sufyan",
    "label-en": "Her lineage and upbringing:\n\nThe Mother of the Believers, the veiled lady, is one of the cousins of the Messenger - may God bless him and grant him peace - Ramla bint Abi Sufyan Sakhr bin Harb bin Umayyah bin Abd Shams bin Abd Manaf. A great companion, the daughter of a leader, the sister of a caliph, and the wife of the Seal of the Prophets, Muhammad - peace and blessings be upon him\n\nHer father is Abu Sufyan, the leader and leader of the Quraysh, who at the beginning of the call was the arch enemy of the Messenger - peace and blessings be upon him - and her brother Muawiyah bin Abi Sufyan, one of the Umayyad caliphs, and because of the status and majesty of Umm Habibah’s status in her brother’s state (in the Levant), Muawiyah was called: “Uncle of the Believers.” Finally, she is one of the wives of the Messenger - peace and blessings be upon him - and there is no one more generous and loyal than her, nor is there anyone among his wives who is farther away from home than her. This is evidence of her asceticism and her preference for the blessings of the afterlife over the fleeting bliss of this world\n\nUmm Habiba was an opinionated and eloquent woman. Ubayd Allah ibn Jahsh first married her, and when the Messenger - may God bless him and grant him peace - called the people in Mecca to Islam, Ramla converted to Islam with her husband in the house of Al-Arqam ibn Abi Al-Arqam, and when the harm to Muslims intensified in Mecca; Ramla emigrated with her husband, fleeing her religion, clinging to her faith, and enduring exile and loneliness. Leaving the luxury and bliss that she was in, far from the center of call and prophecy, enduring the hardships of travel and migration, as the land of Abyssinia is far from Mecca, and the road is punctuated by many bumpy roads, high heat, and lack of provisions, and Ramla at that time was in the first months of her pregnancy, while we see that travel these days is a journey of comfort and luxury, and advanced means of transportation helped shorten the distance between countries. After a few months of Ramla's stay in Abyssinia, she gave birth to her baby girl, Habiba, and she was nicknamed Umm Habiba.\n\nSeeing Umm Habiba:\n\nOne night, Umm Habiba saw in her sleep that her husband, Ubayd Allah, was in a bad shape. She was terrified by that, and when she woke up, her husband told her that he found in the religion of Christianity something better than Islam. So Ramla tried to convert him to Islam, but she found that he had returned to drinking alcohol again. The next night, she saw in her dream that there was a caller calling her Mother of the Believers, so Umm Habiba interpreted that the Messenger would marry her. And indeed; As days passed, her husband died, following the religion of Christianity, and Umm Habiba found herself a stranger in another country, alone without a husband to protect her, the mother of an orphan girl at breastfeeding age, and the daughter of a polytheist father who fears his oppression and is unable to join him in Mecca. This believing woman found nothing but patience and hope, so she faced the ordeal with faith and relied on God - Glory be to Him.\n\nUmm Habiba’s marriage:\n\nThe Messenger - may God bless him and grant him peace - learned of what had happened to Umm Habiba, so he sent to the Negus asking to marry her. Umm Habiba was happy, and her vision came true, so he promised her and the Negus gave her four hundred dinars. She appointed her cousin, Khalid bin Saeed Ibn Al-Aas, to appoint her, and this indicates that it is permissible to contract a marriage by proxy in Islam. With this marriage, the Messenger reduced his hostility to the Umayyads. When Abu Sufyan learned of the Messenger’s marriage to his daughter Ramla, he said: That stallion does not peck his nose! What is meant is that the Messenger is a generous man, and in this way the hatred that was in Abu Sufyan’s soul towards the Messenger - may God bless him and grant him peace - was diminished. Also, in this situation there is a call to replace evil with good. Because it leads to the removal and elimination of hatred and grudges, and the purity of souls between the disputants \nAbu Sufyan in Umm Habiba’s house \nWhen the polytheists in Mecca broke the peace treaty of Hudaybiyyah, they feared the revenge of the Messenger - may God bless him and grant him peace - so they sent Abu Sufyan to Medina, perhaps he would succeed in convincing the Messenger to renew the peace treaty. On his way to the Prophet - peace and blessings be upon him - Abu Sufyan passed by his daughter Umm Habibah in her house, and when they were about to sit on the bed of the Messenger - may God bless him and grant him peace - Umm Habibah pulled him from under him and folded it away from him, so Abu Sufyan said: “Aragha.” With this bed, my daughter, about me? Or for me on his behalf?\" She replied: \"Rather, it is on your behalf, because it is the bed of the Messenger - may God bless him and grant him peace - and you are an unclean, unbeliever man.\" He became angry with her and said: \"Evil has befallen you after me.\" She said: \"No, by God, but rather good.\" Here we find that this believing woman gave her polytheist father a lesson in faith, which is that the bond of faith is stronger than the bond of blood and lineage, and that we must not support and be allied with the infidels, no matter how connected the Muslim is to them, but rather we must fight them. And fight them in order to support Islam. Therefore, the Messenger - may God bless him and grant him peace - prepared the Muslims to conquer Mecca, and although Umm Habibah knew this secret, she did not tell her father, and she kept the secret of the Messenger of God - may God bless him and grant him peace - and the secret of the Muslims. So the Muslims conquered Mecca, and many polytheists converted to the religion of God, and Abu Sufyan converted to Islam. Umm Habiba’s joy was complete and she thanked God for this great blessing. This position indicates that a Muslim woman must keep her husband’s secret, and not reveal it even to the people closest to her. There are many women who involve their families in solving marital problems, and many of these women are divorced because of their disclosure of the secret and the family’s interference. Therefore, a good wife must protect the marital home and not reveal secrets.\n\nHer role in the narration of the Noble Hadith:\n\nUmm Habiba - may God be pleased with her - narrated several hadiths on the authority of the Messenger - may God bless him and grant him peace. Their total amounted to sixty-five hadiths, and Al-Bukhari and Muslim agreed on two hadiths. Umm Habibah - may God be pleased with her - has a famous hadith in the prohibition of the stepdaughter and the woman’s sister, “On the authority of Zainab bint Umm Salamah, on the authority of Umm Habibah bint Abi Sufyan, she said: The Messenger of God, may God bless him and grant him peace, entered upon me. I said: O Messenger of God, marry my sister, the daughter of Abi Sufyan. He said: (And you would like that.) So I said. “Yes, I am not a concubine of yours, and the most beloved person who shares with me in good deeds is my sister.” He said: “That is not permissible for me.” So I said: O Messenger of God, by God, we are talking that you want to marry Durrat bint Abi Salamah. He said: “Umm Salamah’s daughter.” I said: Yes, and he said: (By God, if she had not been my stepdaughter under my guardianship, she would not have been lawful for me. She is the daughter of my foster brother. She breastfed me and Abu Salamah Thuwaybah, so do not present your daughters or your sisters to me.) Narrator: Umm Habibah bint Abi Sufyan - Summary of the degree: [Sahih] - Hadith: Al-Bukhari - Source: Al-Jami’ Al-Sahih - Page or number: 5372.\n\nLikewise her hadith on the virtue of the obligatory Sunnahs before and after the obligatory prayers. She also mentioned hadiths in Hajj, such as the recommendation to send weak women and others from Muzdalifah to Mina late at night before the crowd of people. She also narrated the obligation of mourning for a woman whose husband has died, and in the chapters on fasting: she narrated in supplication after the call to prayer, and in a caravan in which there is a bell without angels accompanying her, and other hadiths that described the actions and sayings of the Messenger - may God bless him and grant him peace.\n\nHer death:\n\nShe died - may God be pleased with her - in the year 44 after the Hijrah, and was buried in Al-Baqi’. She had prayed for Aisha - the Mother of the Believers - before her death. She said: It may be between us and the co-wives, so forgive me and you for any of that. . Aisha said: May God forgive you for all of that and remove your burden from that, and Umm Habibah said: I am pleased with your secret, may God make you happy. She sent a message to Umm Salamah and said to her: Like that, and this is an indication of what Muslims must do before the hour of death, which is tolerance and forgiveness, as Umm Habibah did with the mothers of the believers - may God be pleased with them all."
  },
  {
    "number": "قصة ماريا بنت شَمعون القبطيَة",
    "text": "",
    "label": "قدمت مارية إلى المدينة المنورة بعد صلح الحديبية في سنة سبع من الهجرة. وذكر المفسرون أن اسمها مارية بنت شمعون القبطية، بعد أن تم صلح الحديبية بين الرسول صلى الله عليه و سلم وبين المشركين في مكة، بدأ الرسول في الدعوة إلى الإسلام ، وكتب الرسول - صلى الله عليه وسلم - كتبا إلى ملوك العالم يدعوهم فيها إلى الإسلام، واهتم بذلك اهتماماً كبيراً، فاختار من أصحابه من لهم معرفة و خبرة، وأرسلهم إلى الملوك، ومن بين هؤلاء الملوك هرقل ملك الروم، كسرى أبرويز ملك فارس، المقوقس ملك مصر و النجاشي ملك الحبشة. تلقى هؤلاء الملوك الرسائل وردوا رداً جميلا، ما عدا كسرى .ملك فارس، الذي مزق الكتاب.\n\nلما أرسل الرسول كتاباً إلى المقوقس حاكم الإسكندرية والنائب العام للدولة البيزنطية في مصر، أرسله مع حاطب بن أبي بلتعة، وكان معروفاً بحكمته وبلاغته وفصاحته. فأخذ حاطب كتاب الرسول صلى الله عليه و سلم إلى مصر وبعد ان دخل على المقوقس الذي رحب به. واخذ يستمع إلى كلمات حاطب، فقال له \" يا هذا، إن لنا ديناً لن ندعه إلا لما هو خير منه\".\n\nواُعجب المقوقس بمقالة حاطب، فقال لحاطب: \" إني قد نظرت في أمر هذا النبي فوجدته لا يأمر بزهودٍ فيه، ولا ينهي عن مرغوب فيه، ولم أجدهُ بالساحر الضال، ولا الكاهن الكاذب، ووجدت معه آية النبوة بإخراج الخبء و الأخبار بالنجوى وسأنظر\" \nأخذ المقوقس كتاب النبي صلى الله عليه و سلم وختم عليه، وكتب إلى النبي صلى الله عليه و سلم \n\" بسم الله الرحمن الرحيم \nلمحمد بن عبدالله، من المقوقس عظيم القبط، سلام عليك، أما بعد \nفقد قرأت كتابك، وفهمت ما ذكرت فيه، وما تدعو إليه، وقد علمت أن نبياً بقي، \nوكنت أظن أنه سيخرج بالشام، وقد أكرمت رسولك، وبعثت إليك بجاريتين لهما \nمكان في القبط عظيم، وبكسوة، وأهديتُ إليك بغلة لتركبها والسلام عليك\". \nوكانت الهدية جاريتين هما: مارية بنت شمعون القبطية وأختها سيرين. وفي طريق عودة حاطب إلى المدينة، عرض على ماريه وأختها الإسلام ورغبهما فيه، فأكرمهما الله بالإسلام.\n\nوفي المدينة، أختار الرسول صلى الله عليه و سلم مارية لنفسه، ووهب أختها سيرين لشاعره الكبير حسان بن ثابت الأنصاري رضي الله عنه. كانت ماريه رضي الله عنها بيضاء جميلة الطلعة، وقد أثار قدومها الغيرة في نفس عائشة رضي الله عنها، فكانت تراقب مظاهر اهتمام رسول الله صلى الله عليه و سلم بها. وقالت عائشة رضي الله عنها:\" ما غرت على امرأة إلا دون ما غرت على مارية، وذلك أنها كانت جميلة جعدة-أو دعجة- فأعجب بها رسول الله صلى الله عليه و سلم وكان أنزلها أول ما قدم بها في بيتٍ لحارثة بن النعمان، فكانت جارتنا، فكان عامة الليل والنهار عندها، حتى فرغنا لها، فجزعت فحولها إلى العالية، وكان يختلف إليها هناك، فكان ذلك أشد علينا\" .\n\nولادة مارية لإبراهيم :\n\nوبعد مرور عام على قدوم مارية إلى المدينة، حملت مارية، وفرح النبي لسماع هذا الخبر فقد كان قد قارب الستين من عمره وفقد أولاده ما عدا فاطمـة الزهراء رضوان الله عليها. ولدت مـارية في \"شهر ذي الحجة من السنة الثامنة للهجرة النبوية الشريفة\"، طفلاً جميلاً يشبه الرسول صلى الله عليه وسلم، وقد سماه إبراهيم، \" تيمناً بأبيه إبراهيم خليل الرحمن عليه السلام\" وبهذه الولادة أصبحت مـارية حرة .\n\nوعاش إبراهيم ابن الرسول صلى الله عليه و سلم سنة وبضع شهور يحظى برعاية رسول الله صلى الله عليه و سلم ولكنه مرض قبل أن يكمل عامه الثاني، وذات يوم اشتد مرضه، ومات إبراهيم وهو ابن ثمانية عشر شهراً، \" وكانت وفاته يوم الثلاثاء لعشر ليال خلت من ربيع الأول سنة عشر من الهجرة النبوية المباركة\"، وحزنت مارية حزناً شديداً على موت إبراهيم. \nمكانة مارية في القرآن الكريم :\n\nلمـارية رضي الله عنها شأن كبير في الآيات المباركة وفي أحداث السيرة النبوية. \"أنزل الله عز وجل صدر سورة التحريم بسبب مارية القبطية، وقد أوردها العلماء والفقهاء والمحدثون والمفسرون في أحاديثهم وتصانيفهم\". وقد توفي الرسول عنها صلى الله عليه و سلم وهو راض عن مـارية، التي تشرفت بالبيت النبوي الطاهر، وعدت من أهله، وكانت مـارية شديدة الحرص على اكتساب مرضاة الرسول صلى الله علية وسلم، كما عرفت بدينها وورعها وعبادتها. \nوفاة مارية :\n\nعاشت مـارية ما يقارب الخمس سنوات في ظلال الخلافة الراشدة، وتوفيت في السنة السادسة عشر من محرم. دعا عمر الناس وجمعهم للصلاة عليها . فاجتمع عدد كبير من الصحابة من الهاجرين والأنصار ليشهدوا جنازة مـارية القبطية، وصلى عليها سيدنا عمر رضي الله عنه في البقيع، ودفنت إلى جانب نساء أهل البيت النبوي، وإلى جانب ابنها إبراهيم. \nالخــــاتمة :\n\nفي نهاية المطاف أتمنى من المولى عز و جل أن أكون قد وفقت في كتابة هذا الموضوع . حيث إني دونت فيه عن الهدية الرائعة التي وهبها المقوقس إلى النبي صلى الله عليه و سلم . ومكانة هذه السيدة العظيمة في القرآن الكريم ولحظة ولادتها لإبراهيم الذي كان مثار محبة النبي صلى الله عليه و سلم ، وكلي أمل في أن يحقق عرض هذا الموضوع الفائدة المرجوة منه .                       ",
    "number-en": "The Coptic story of Maria, daughter of Shimon",
    "label-en": "Maria came to Medina after the Treaty of Hudaybiyyah in the seventh year of the Hijra. The commentators mentioned that her name was Mariah, daughter of Shimon al-Qibtiyyah. After the treaty of Hudaybiyyah was concluded between the Messenger, may God bless him and grant him peace, and the polytheists in Mecca, the Messenger began calling to Islam, and the Messenger, may God bless him and grant him peace, wrote letters to the kings of the world calling on them to Islam. He paid great attention to that, so he chose from among his companions those who had knowledge and experience, and sent them to the kings. Among these kings were Heraclius, King of the Romans, Chosroes of Persia, King of Persia. Al-Muqawqis, king of Egypt, and Al-Najashi, king of Abyssinia. These kings received the letters and received a beautiful response, except for Chosroes, King of Persia, who tore the book.\n\nWhen the Messenger sent a letter to Al-Muqawqis, the governor of Alexandria and the Attorney General of the Byzantine state in Egypt, he sent it with Hatib bin Abi Balta’a, who was known for his wisdom, eloquence, and eloquence. So Hatib took the letter of the Messenger, may God bless him and grant him peace, to Egypt and after he entered upon Al-Muqawqis, who welcomed him. He began to listen to Hatib's words, and he said to him, \"Oh, we have a religion that we will not abandon except for what is better than it.\"\n\nAl-Muqawqis was impressed by Hatib’s article, and he said to Hatib: “I looked into the matter of this Prophet and found that he does not command asceticism, nor does he forbid what is desired, and I did not find him to be a misguided sorcerer or a lying soothsayer, and I found in him the sign of prophecy in bringing out hidden things and news of secret secrets, and I will look.” \nAl-Muqawqis took the letter of the Prophet, may God bless him and grant him peace, sealed it, and wrote to the Prophet, may God bless him and grant him peace \n“In the name of God, the Most Gracious, the Most Merciful \nTo Muhammad bin Abdullah, from Al-Muqawqis, the great Copt, peace be upon you, As for after \nI have read your book, and I understand what you mentioned in it, and what you call for, and I learned that a prophet remained. \nI thought that he would leave the Levant, but I honored your messenger and sent you two of their maids \nA great place among the Copts, with clothing, and I gave you a mule to ride, and peace be upon you.” \nThe gift included two maids: Maria, daughter of Shimon the Copt, and her sister, Sirin. On Hatib’s way back to Medina, he offered Mary and her sister Islam and they wanted it, so God honored them with Islam.\n\nIn Medina, the Messenger, may God bless him and grant him peace, chose Maria for himself, and gave her sister Sirin to his great poet Hassan bin Thabit Al Ansari, may God be pleased with him. Maryah, may God be pleased with her, was white and beautiful, and her arrival sparked jealousy in the soul of Aisha, may God be pleased with her, and she was observing the manifestations of the interest of the Messenger of God, may God bless him and grant him peace, towards her. Aisha, may God be pleased with her, said: “I have never been more jealous of a woman than I was of Mariah, and that is because she was beautiful and curly - so the Messenger of God, may God’s prayers and peace be upon him, admired her. The first time he brought her, he placed her in the house of Haritha bin Al-Nu’man, and she was our neighbour, so he spent most of the night and day with her, until we finished for her. Maria gives birth to Abraham:\n\nA year after Mariah came to Medina, Mariah became pregnant, and the Prophet was happy to hear this news, as he was nearly sixty years old and had lost his children except Fatima Al-Zahra, may God be pleased with her. In “the month of Dhul-Hijjah of the eighth year of the noble Prophet’s migration,” Maria gave birth to a beautiful child who resembled the Messenger, may God bless him and grant him peace. He named him Abraham, “after his father Abraham, Khalil al-Rahman, peace be upon him.” With this birth, Maria became free. Ibrahim, the son of the Messenger, may God’s prayers and peace be upon him, lived for a year and a few months, enjoying the care of the Messenger of God, may God’s prayers and peace be upon him, but he fell ill before he completed his second year, and one day his illness became severe, and Ibrahim died when he was eighteen months old. “His death occurred on Tuesday, ten nights before Rabi’ al-Awwal, in the tenth year of the blessed Prophet’s migration,” and Maria was deeply saddened by the death of Ibrahim. \nMaria’s position in the Holy Quran:\n\nMaria, may God be pleased with her, has a great importance in the blessed verses and in the events of the Prophet’s biography. “God Almighty revealed the beginning of Surat Al-Tahrim because of Maria the Copt, and scholars, jurists, hadith scholars, and commentators have mentioned it in their hadiths and writings.” The Messenger, may God’s prayers and peace be upon him, died while he was satisfied with Maria, who was honored by the pure Prophet’s house and was counted among its family. Maria was very keen on gaining the approval of the Messenger, may God’s prayers and peace be upon him, and she was also known for her religion, piety, and worship. \nMaria's death:\n\nMaria lived for nearly five years under the shadow of the Rightly Guided Caliphate, and died in the sixteenth year of Muharram. Omar called people and gathered them to pray over her. A large number of companions, including the immigrants and supporters, gathered to witness the funeral of Maria the Coptic, and our master Omar, may God be pleased with him, prayed over her in Al-Baqi’, and she was buried next to the women of the Prophet’s household, and next to her son Ibrahim. \nConclusion:\n\nIn the end, I hope to God Almighty that I have succeeded in writing this topic. In it, I wrote about the wonderful gift that Al-Muqawqis gave to the Prophet, may God bless him and grant him peace. The position of this great woman in the Holy Qur’an and the moment of her birth to Abraham, which was the object of love of the Prophet, may God bless him and grant him peace, and I have every hope that presenting this topic will achieve the desired benefit from it."
  },
  {
    "number": "قصة ميمونة بنت الحارث",
    "text": "",
    "label": "آخر أمهات المؤمنين - رضي الله عنها \nاسمها ونسبها :\n\nهي ميمونة بنت الحارث بن حزن بن جبير بن الهزم بن روبية بن عبدالله بن هلال بن عامر بن صعصعة الهلالية. فأما أمها كانت تدعى هند بنت عوف بن زهير بن الحرث، وأخواتها: أم الفضل (لبابة الكبرى) زوج العباس رضي الله عنهما، و لبابة الصغرى زوج الوليد بن المغيرة المخزومي وأم خالد بن الوليد، وعصماء بني الحارث زوج أُبي بن الخلف، وغرة بنت الحرث زوج زياد بن عبدالله بن مالك الهلالي .. وهؤلاء هن أخواتها من أمها وأبيها. أما أخواتها لأمها فهن: أسماء بنت عميس زوج جعفر رضي الله عنه، ثم مات فخلف عليها أبو بكر الصديق رضي الله عنه، ثم مات فخلف عليها علي كرم الله وجه. وسلمى بنت عميس زوج حمزة بن عبدالمطلب رضي الله عنه، ثم مات فخلف عليها شداد بن أسامة بن الهاد. وسلامة بنت عميس زوج عبدالله بن كعب بن عنبة الخثعمي.\n\nولهذا عُرفت أمها هند بنت عوف بأكرم عجوز في الأرض أصهاراً، فأصهارها: أشرف الخلق رسول الله صلى الله عليه وسلم، وصاحبه الصديق، وعميه حمزة والعباس ابنا عبدالمطلب، وجعفر وعلي أبناء عمه أبي طالب، وشداد بن الهاد رضي الله عنهم أجمعين. وتلك فضائل حسان، فهل فوق ذلك من أسمى وأفخر من هذا النسب الأصيل والمقام الرفيع...؟؟!! \nأزواجها قبل الرسول صلى الله عليه وسلم :\n\nكان زواجها رضي الله عنها أولاً بمسعود بن عمرو الثقفي قبيل الإسلام، ففارقها وتزوجها أبو رهم بن عبدالعزى. فتوفي عنها وهي في ريعان الشباب. ثم ملأ نور الإيمان قلبها، وأضاء جوانب نفسها حتى شهد الله تعالى لها بالإيمان، وكيف لا وهي كانت من السابقين في سجل الإيمان. فحظيت بشرف الزواج من رسول الله صلى الله عليه وسلم في وقت فراغه من عمرة القضاء سنة 7 للهجرة. \nهمس القلوب وحديث النفس :\n\nوفي السنة السابعة للهجرة النبوية، دخل رسول الله صلى الله عليه وسلم وأصحابه مكة معتمرين، وطاف الحبيب المصطفى بالبيت العتيق بيت الله الحرام. وكانت ميمونة بمكة أيضاً ورأت رسول الله وهو يعتمر فملأت ناظريها به حتى استحوذت عليها فكرة أن تنال شرف الزواج من رسول الله صلى الله عليه وسلم وأن تصبح أماً للمؤمنين، وما الذي يمنعها من تحقيق حلم لطالما راودتها في اليقظة والمنام وهي التي كانت من السابقين في سجل الإيمان وقائمة المؤمنين؟ وفي تلك اللحظات التي خالجت نفسها همسات قلبها المفعم بالإيمان، أفضت ميمونة بأمنيتها إلى أختها أم الفضل، وحدثتها عن حبها وأمنيتها في أن تكون زوجاً للرسول الله صلى الله عليه وسلم وأماً للمؤمنين، وأما أم الفضل فلم تكتم الأمر عن زوجها العباس فأفضت إليه بأمنية أختها ميمونة، ويبدو أن العباس أيضاً لم يكتم الأمر عن ابن أخيه فأفضى إليه بأمنية ميمونة بنت الحارث. فبعث رسول الله ابن عمه جعفر بن أبي طالب ليخطبها له، وما أن خرج جعفر رضي الله عنه من عندها، حتى ركبت بعيرها وانطلقت إلى رسول الله صلى الله عليه وسلم، وما أن وقعت عيناها عليه صلى الله عليه وسلم حتى قالت: \"البعير وما عليه لله ورسوله\".\n\nميمــونة في القرآن الكريـم :\n\nوهكذا وهبت ميمونة نفسها للنبي صلى الله عليه وسلم وفيها نزل قوله تعالى: (( وامرأة مؤمنة إن وهبت نفسها للنبي إن أراد النبي أن يستنكحها خالصة لك من دون المؤمنين)). \nلقد جعلت ميمونة أمرها إلى العباس بن عبد المطلب فزوجها لرسول الله صلى الله عليه وسلم، وقيل أيضاً أن العباس قال لرسول الله صلى الله عليه وسلم: \"إن ميمونة بنت الحارث قد تأيمت من أبي رهم بن عبدالعزى،هل لك أن تتزوجها؟\" ، فتزوجها رسول الله صلى الله عليه وسلم. \nميمونة والزواج الميمون :\n\nأقام رسول الله صلى الله عليه وسلم وأصحابه بمكة ثلاثة أيام، فلما أصبح اليوم الرابع، أتى إليه صلى الله عليه وسلم نفر من كفار قريش ومعهم حويطب بن عبدالعزى - الذي أسلم فيما بعد- فأمروا الرسول صلى الله عليه وسلم أن يخرج بعد أن انقضى الأجل وأتم عمرة القضاء والتي كانت عن عمرة الحديبية .فخرج رسول الله صلى الله عليه وسلم وخلف مولاه أن يحمل ميمونة إليه حين يمسي. \nفلحقت به ميمونة إلى سَرِف، وفي ذلك الموضع بنى بها الرسول صلى الله عليه وسلم في هذه البقعة المباركة، ويومئذ سماها الرسول صلى الله عليه وسلم ميمونة بعد أن كان اسمها برة. فعقد عليها بسرف بعد تحلله من عمرته لما روي عنها: \"تزوجني رسول الله صلى الله عليه وسلم ونحن حلالان بسرف\". \nالراوي: ميمونة - خلاصة الدرجة: صحيح - المحدث: الألباني - المصدر: صحيح أبي داود - الصفحة أو الرقم: 1843 \nميمونة والرحلة المباركة إلى المدينة المنورة \nودخلت ميمونة رضي الله عنها البيت النبوي وهي لم تتجاوز بعد السادسة والعشرين. وإنه لشرف لا يضاهيه شرف لميمونة، فقد أحست بالغبطة تغمرها والفرحة تعمها، عندما أضحت في عداد أمهات المؤمنين الطاهرات رضي الله عنهن جميعاً. وعند وصولها إلى المدينة استقبلتها نسوة دار الهجرة بالترحيب والتهاني والتبريكات، وأكرمنها خير إكرام، إكراماً للرسول صلى الله عليه وسلم وطلباً لمرضاة الله عز وجل. \nودخلت أم المؤمنين الحجرة التي أعد لها الرسول الكريم صلى الله عليه وسلم لتكون بيتاً لها أسوة بباقي أمها المؤمنين ونساء رسول الله صلى الله عليه وسلم. وهكذا بقيت ميمونة تحظى بالقرب من رسول الله صلى الله عليه وسلم وتتفقه بكتاب الله وتستمع الأحاديث النبوية من الرسول الكريم صلى الله عليه وسلم، وتهتدي بما يقوله، فكانت تكثر من الصلاة في المسجد النبوي لأنها سمعت النبي صلى الله عليه وسلم يقول: \"صلاة في مسجدي هذا أفضل من ألف صلاة فيما سواه إلى المسجد الحرام\". \nوظلت ميمونة في البيت النبوي وظلت مكانتها رفيعة عند رسول الله حتى إذا اشتد به المرض عليه الصلاة والسلام نزل في بيتها.. ثم استأذنتها عائشة بإذن النبي صلى الله عليه وسلم لينتقل إلى بيتها ليمرض حيث أحب في بيت عائشة. \nحفظها للأحاديث النبوية :\n\nوبعد انتقال الرسول صلى الله عليه وسلم إلى الرفيق الأعلى، عاشت ميمونة رضي الله عنها حياتها بعد النبي صلى الله عليه وسلم في نشر سنة النبي صلى الله عليه وسلم بين الصحابة والتابعين؛ لأنها كانت ممن وعين الحديث الشريف وتلقينه عن رسول الله صلى الله عليه وسلم، ولأنها شديدة التمسك بالهدي النبوي والخصال المحمدية، ومنها حفظ الحديث النبوي الشريف وروايته ونقله إلى كبار الصحابة والتابعين وأئمة العلماء. و كانت أم المؤمنين ميمونة رضي الله عنها من المكثرات لرواية الحديث النبوي الشريف والحافظات له، حيث أنها روت عن رسول الله صلى الله عليه وسلم ستاً وسبعين حديثاً. \nميمونة وشهادة الإيمان والتقوى :\n\nوعكفت أم المؤمنين على العبادة والصلاة في البيت النبوي وراحت تهتدي بهدي رسول الله صلى الله عليه وسلم - وتقتبس من أخلاقه الحسنة، وكانت حريصة أشد الحرص على تطبيق حدود الله، ولا يثنيها عن ذلك شيء من رحمة أو شفقة أو صلة قرابة، فيحكى أن ذا قرابة لميمونة دخل عليها، فوجدت منه ريح شراب، فقالت: \"لئن لم تخرج إلى المسلمين، فيجلدونك، لا تدخل علي أبدا\". وهذا الموقف خير دليل على تمسك ميمونة رضي الله عنها بأوامر الله عز وجل وتطبيق السنة المطهرة فلا يمكن أن تحابي قرابتها في تعطيل حد من حدود الله. وقد زكى الرسول صلى الله عليه وسلم إيمان ميمونة رضي الله عنها وشهد لها ولأخوتها بالإيمان لما روى عن ابن عباس رضي الله عنه قال: \"قال رسول الله صلى الله عليه وسلم: الأخوات المؤمنات ميمونة زوج النبي صلى الله عليه وسلم وأم الفضل امرأة العباس وأسماء بنت عميس امرأة جعفر وامرأة حمزة وهي أختهن لأمهن \" \nالراوي: عبدالله بن عباس - خلاصة الدرجة: [روي] بإسنادين ورجال أحدهما رجال الصحيح‏‏ ‏‏ - المحدث: الهيثمي - المصدر: مجمع الزوائد - الصفحة أو الرقم: 9/263 \nرضي الله عنهم جميعاً. \nالأيام الأخيرة والذكريات العزيزة :\n\nكانت أم المؤمنين ميمونة رضي الله عنها، قد عاشت الخلافة الراشدة وهي عزيزة كريمة تحظى باحترام الخلفاء والعلماء، وامتدت بها الحياة إلى خلافة معاوية رضي الله عنه. وقيل: إنها توفيت سنة إحدى وخمسين بسرف ولها ثمانون سنة، ودفنت في موضع قبتها الذي كان فيه عرسها رضي الله عنها، وهكذا جعل الله عز وجل المكان الذي تزوجت به ميمونة هو مثواها الأخير. قال يزيد بن الأصم: \"دفنا ميمونة بسرف في الظلة التي بنى فيها رسول الله صلى الله عليه وسلم\". \nوتلك هي أمنا وأم المؤمنين أجمعين ميمونة بنت الحارث الهلالية رضي الله عنها، آخر حبات العقد الفريد، العقد النبوي الطاهر المطهر، وإحدى أمهات المؤمنين اللواتي ينضوين تحت قول الله تعالى (( إنما يريد الله ليذهب عنكم الرجس أهل البيت ويطهركم تطهيرا )). \nوصدق الله العظيم. \nفضائل وأسباب شهرة ميمونة :\n\nوكانت لأم المؤمنين ميمونة رضي الله عنها شهرة شهد لها التاريخ بعظمتها، ومن أسباب شهرتها نذكر: \nإن أم ميمونة هند بنت عوف كانت تعرف بأنها أكرم عجوز في الأرض أصهاراً - كما ذكرت سابقاً- فأصهارها: أشرف الخلق رسول الله صلى الله عليه وسلم، وصاحبه الصديق، وعميه حمزة والعباس ابنا عبدالمطلب، وجعفر وعلي أبناء عمه أبي طالب، وشداد بن الهاد رضي الله عنهم أجمعين. \nومن أسباب عظمتها كذلك شهادة الرسول صلى الله عليه وسلم لها ولأخواتها بالإيمان، لما روى عن ابن عباس رضي الله عنه قال: \"قال رسول الله صلى الله عليه وسلم: الأخوات المؤمنات: ميمونة زوج النبي صلى الله عليه وسلم، وأم الفضل زوج العباس، وسلمى امرأة حمزة، وأسماء بنت عميس أختهن لأمهن\" رضي الله عنهن جميعاً. \nومنه تكريم الله عز وجل لها عندما نزل القرآن يحكي قصتها وكيف أنها وهبت نفسها لرسول الله صلى الله عليه وسلم، في قول الله تعالى: (( وامرأة مؤمنة إن وهبت نفسها للنبي إن أراد النبي أن يستنكحها خالصة لك من دون المؤمنين )). \nومن ذلك أنها كانت آخر من تزوجها رسول الله صلى الله عليه وسلم، وبها ختمت أمهات المؤمنين، وكانت نعم الختام . وقد كانت تقيه تصل الرحم لشهادة أم المؤمنين عائشة رضي الله عنها لها عندما قالت: \" إنها والله كانت من أتقانا لله وأوصلنا للرحم\". \nومما يذكر لميمونة رضي الله عنها أنها كانت أم المؤمنين ميمونة رضي الله عنها من الحافظات المكثرات لرواية الحديث النبوي الشريف، ولم يسبقها في ذلك سوى أم المؤمنين السيدة عائشة رضي الله عنها، وأم سلمة أم المؤمنين رضي الله عنها",
    "number-en": "The story of Maimuna bint Al-Harith",
    "label-en": "The last of the mothers of the believers - may God be pleased with her \nHer name and lineage:\n\nShe is Maimuna bint Al-Harith bin Hazn bin Jubair bin Al-Hazm bin Rubia bin Abdullah bin Hilal bin Amer bin Sasa'ah Al-Hilaliyya. As for her mother, her name was Hind bint Awf bin Zuhair bin Al-Harith, and her sisters were: Umm Al-Fadl (Lubaba Al-Kubra), the wife of Al-Abbas, may God be pleased with them both, and Lubabah Al-Sughra, the wife of Al-Walid bin Al-Mugheerah Al-Makhzoumi and Umm Khaled bin Al-Walid, and Asmaa Bani Al-Harith, the wife of Ubai bin Al-Khalaf, and Ghurra bint Al-Harith, the husband of Ziyad bin Abdullah bin Malik Al-Hilali...and these are her sisters from her mother and father. As for her maternal sisters, they are: Asma bint Umays, the husband of Jaafar, may God be pleased with him. Then he died, and Abu Bakr al-Siddiq, may God be pleased with him, succeeded her. Then he died, and Ali, may God bless him, succeeded her. Salma bint Umays, the husband of Hamza bin Abdul Muttalib, may God be pleased with him, then he died and Shaddad bin Osama bin Al Had succeeded her. Salama bint Umays, husband of Abdullah bin Kaab bin Anabah Al Khathami. For this reason, her mother, Hind bint Awf, was known as the most generous old woman on earth in terms of her in-laws. Her in-laws were: the most honorable of creation, the Messenger of God, may God bless him and grant him peace, and his friend, his two uncles, Hamza and Al-Abbas, the sons of Abdul Muttalib, and Jaafar and Ali, the sons of his uncle Abu Talib, and Shaddad bin Al-Had, may God be pleased with them all. These are the virtues of Hassan, so is there anyone higher and prouder than this pure lineage and high status...??!! \nHer husbands before the Messenger, may God bless him and grant him peace:\n\nHer marriage, may God be pleased with her, was first to Masoud bin Amr Al-Thaqafi before Islam, so he separated from her and married her to Abu Rahm bin Abdul-Uzza. He died while she was still young. Then the light of faith filled her heart and illuminated all aspects of her soul until God Almighty testified to her faith, and how could it not be since she was one of the first in the record of faith. So I had the honor of marrying the Messenger of God, may God bless him and grant him peace, during his free time from the Umrah al-Qadha in the year 7 AH. \nWhispering hearts and self-talk:\n\nIn the seventh year of the Prophet’s migration, the Messenger of God, may God bless him and grant him peace, and his companions entered Mecca performing Umrah, and the Beloved Chosen One circumambulated the Ancient House, the Sacred House of God. Maymunah was also in Mecca and saw the Messenger of God performing Umrah, so she filled her eyes with him until she was obsessed with the idea of ​​obtaining the honor of marrying the Messenger of God, may God bless him and grant him peace, and becoming a mother to the believers. What prevented her from fulfilling a dream that she had always had in wakefulness and sleep, since she was one of the first in the record of faith and the list of believers? In those moments when she was filled with the whispers of her heart full of faith, Maimunah confided her wish to her sister, Umm al-Fadl, and told her about her love and wish to be a wife to the Messenger of God, may God bless him and grant him peace, and a mother to the believers. As for Umm al-Fadl, she did not conceal the matter from her husband, Al-Abbas, so she revealed to him the wish of her sister Maimunah. It seems that Al-Abbas also did not conceal the matter from his nephew, so she revealed the wish of Maimunah bint Al-Harith. So the Messenger of God sent his cousin Ja’far bin Abi Talib to propose to her, and as soon as Ja’far, may God be pleased with him, left her, she mounted her camel and went to the Messenger of God, may God’s prayers and peace be upon him, and as soon as her eyes fell on him, may God’s prayers and peace be upon him, she said: “The camel and what is on it are for God and His Messenger.”\n\nMaymunah in the Holy Quran:\n\nThus, Maimunah gave herself to the Prophet, may God bless him and grant him peace, and about it was revealed the Almighty’s saying: ((And a believing woman, if she gives herself to the Prophet, if the Prophet wants to marry her purely for you and not for the believers)). Maymunah made her affairs in the hands of Al-Abbas bin Abdul Muttalib, who married her to the Messenger of God, may God bless him and grant him peace. It was also said that Al-Abbas said to the Messenger of God, may God bless him and grant him peace: “Maymuna bint Al-Harith has married Abu Rahm bin Abdul Uzza. Can you marry her?” So the Messenger of God, may God bless him and grant him peace, married her. Auspicious and auspicious marriage:\n\nThe Messenger of God, may God bless him and grant him peace, and his companions stayed in Mecca for three days, and when the fourth day came, a group of the infidels of Quraysh came to him, may God bless him and grant him peace, and with them was Huwaytab bin Abdul Uzza - who later converted to Islam. They ordered the Messenger, may God bless him and grant him peace, to go out after the deadline had passed and he completed the Umrah of Judiciary, which was the Umrah of Hudaybiyyah. So the Messenger of God, may God bless him and grant him peace, went out and left behind his master to carry Maymunah to him in the evening. So Maimuna followed him to Saraf, and in that place the Messenger, may God bless him and grant him peace, built there in this blessed spot, and on that day the Messenger, may God bless him and grant him peace, named her Maimuna after her name was Barrah. So he contracted a marriage with her extravagantly after his exit from his Umrah, according to what was narrated from her: “The Messenger of God, may God’s prayers and peace be upon him, married me and we were lawful in an extravagant manner.” \nNarrator: Maymunah - Summary of grade: Sahih - Hadith: Al-Albani - Source: Sahih Abi Dawud - Page or number: 1843 \nAuspicious and blessed journey to Medina \nMaimuna, may God be pleased with her, entered the Prophet’s house when she was not yet twenty-six years old. It is an unparalleled honor for Maimouna, as she felt joy overwhelming her and joy when she became among the pure mothers of the believers, may God be pleased with them all. Upon her arrival in Medina, the women of Dar al-Hijra received her with a warm welcome, congratulations, and congratulations, and they honored her with the best of honor, out of honor for the Messenger, may God bless him and grant him peace, and seeking the pleasure of God Almighty. \nThe Mother of the Believers entered the room that the Noble Messenger, may God’s prayers and peace be upon him, had prepared for her to be a home for her, like the rest of her mother of believers and the wives of the Messenger of God, may God’s prayers and peace be upon him. Thus, Maimuna continued to enjoy closeness to the Messenger of God, may God bless him and grant him peace, learn to understand the Book of God, listen to the Prophetic hadiths from the Holy Messenger, may God bless him and grant him peace, and be guided by what he said. She used to pray a lot in the Prophet’s Mosque because she heard the Prophet, may God bless him and grant him peace, say: “A prayer in this mosque of mine is better than a thousand prayers in any other place in the Sacred Mosque.” \nMaimunah remained in the Prophet’s house and her position remained high with the Messenger of God, until when his illness became severe, may God’s prayers and peace be upon him, he stayed at her house. Then Aisha asked her permission, with the permission of the Prophet, may God bless him and grant him peace, so that he could move to her house to get sick, where he loved, in Aisha’s house. \nPreserving the Prophet’s hadiths:\n\nAfter the Messenger, may God bless him and grant him peace, moved to the highest companion, Maymunah, may God be pleased with her, lived her life after the Prophet, may God bless him and grant him peace, spreading the Sunnah of the Prophet, may God bless him and grant him peace, among the companions and followers. Because she was among those who studied the noble hadith and taught it on the authority of the Messenger of God, may God bless him and grant him peace, and because she strongly adhered to the Prophet’s guidance and the qualities of Muhammad. Among them is memorizing the noble Prophet’s hadith, narrating it, and transmitting it to the major companions, followers, and imams of scholars. The Mother of the Believers, Maymunah, may God be pleased with her, was one of the many narrators of the noble Prophet’s hadith and memorizers of it, as she narrated seventy-six hadiths on the authority of the Messenger of God, may God bless him and grant him peace. \nAuspicious and testimony of faith and piety:\n\nThe Mother of the Believers devoted herself to worship and prayer in the Prophet’s House, and she began to be guided by the guidance of the Messenger of God, may God bless him and grant him peace, and she imitated his good morals. She was extremely keen to implement God’s limits. And nothing of mercy, compassion, or kinship would stop her from doing so. It is said that a relative of Maimuna entered upon her, and she smelled of alcohol on his breath, so she said: “If you do not go out to the Muslims and they flog you, do not enter upon me again.” This position is the best evidence of Maimuna, may God be pleased with her, adhering to the commands of God Almighty and the application of the purified Sunnah. She cannot favor her relatives in disrupting one of God’s limits. The Messenger, may God’s prayers and peace be upon him, praised the faith of Maimuna, may God be pleased with her, and testified to her and her brothers’ faith when he narrated on the authority of Ibn Abbas, may God be pleased with him, who said: “The Messenger of God, may God’s prayers and peace be upon him, said: The believing sisters are Maimuna, the wife of the Prophet, may God’s prayers and peace be upon him, Umm al-Fadl, the wife of al-Abbas, and Asma bint Umays, the wife of Ja’far, and the wife of Hamza, who is their sister to their mother.” \nNarrator: Abdullah bin Abbas - Summary of the degree: [narrated] with two chains of narration and men, one of which is the men of Sahih - Hadith: Al-Haythami - Source: Majma’ al-Zawa’id - Page or number: 9/263 \nMay God be pleased with them all. Last days and fond memories:\n\nThe Mother of the Believers, Maymunah, may God be pleased with her, lived the Rightly Guided Caliphate and was a dear, generous woman, respected by the caliphs and scholars, and her life extended until the Caliphate of Muawiyah, may God be pleased with him. It was said: She died in the year fifty-one in Saraf, and she was eighty years old, and was buried in the place of her dome where her wedding took place, may God be pleased with her. Thus, God Almighty made the place where Maimunah married her final resting place. Yazid bin Al-Asam said: “We buried Maimuna with Saraf in the canopy in which the Messenger of God, may God bless him and grant him peace, built.” And that is our mother and the mother of all believers, Maimuna bint Al-Harith Al-Hilaliyya, may God be pleased with her, the last bead of the unique contract, the pure and purifying Prophetic contract, and one of the mothers of the believers who fall under the words of God Almighty ((God only desires to remove impurity from you, O People of the House, and purify you with a thorough purification)). \nAnd God Almighty is true. Virtues and reasons for Maimuna’s fame:\n\nThe Mother of the Believers, Maymunah, may God be pleased with her, had a fame whose greatness was witnessed by history. Among the reasons for her fame we mention: \nUmm Maimunah Hind bint Awf was known to be the most generous old woman on earth in terms of her in-laws - as I mentioned previously - and her in-laws were: the most honorable of creation, the Messenger of God, may God bless him and grant him peace, and his friend, his friend, and his two uncles Hamza and Al-Abbas, the sons of Abdul Muttalib, and Ja’far and Ali, the sons of his uncle Abu Talib, and Shaddad bin Al-Hahad, may God be pleased with them all. Among the reasons for her greatness is also the testimony of the Messenger, may God bless him and grant him peace, to her and her sisters’ faith, as narrated on the authority of Ibn Abbas, may God be pleased with him, who said: “The Messenger of God, may God bless him and grant him peace, said: The believing sisters: Maymuna, the wife of the Prophet, may God bless him and grant him peace, Umm al-Fadl, the wife of Abbas, Salma, the wife of Hamzah, and Asma bint Umays, their sister on their mother,” may God be pleased with them all. Among them is God Almighty’s honoring of her when the Qur’an was revealed telling her story and how she gave herself to the Messenger of God, may God bless him and grant him peace, in the words of God Almighty: ((And a believing woman if she gives herself to the Prophet if the Prophet wants to marry her purely for you and not for the believers)). \nIncluding that, she was the last person whom the Messenger of God, may God bless him and grant him peace, married, and with her the Mothers of the Believers were sealed, and she was the best seal. She was pious and connected to the family, according to the testimony of the Mother of the Believers, Aisha, may God be pleased with her, when she said: “By God, she was one of the most pious of God and the most connected to the family.” What is mentioned about Maimunah, may God be pleased with her, is that she was the Mother of the Believers, Maimunah, may God be pleased with her, was one of the many memorizers of the narration of the noble Prophet’s hadith, and no one preceded her in that except the Mother of the Believers, Mrs. Aisha, may God be pleased with her, and Umm Salamah, the Mother of the Believers, may God be pleased with her."
  },
  {
    "number": "قصة الخنساء أم الشهداء",
    "text": "",
    "label": "هي : تماضر بنت عمرو ، بن الحارث ، بن الشريد ، بن ثعلبة بن عصية بن خفاف بن امرئ آلاف بن بهثة بن سليم السلمية .\nقال ابن حجر : الشاعرة المشهورة عدا تماضر بمثناة فوقانية أوله وضاد معجمة ، وفي ذلك يقول دريد بن الصمة حين رآها تهنأ إبلا لها ثم تجردت واغتسلت فأعجبته ، فخطبها فأبت ، فقال فيها :    \nحيوا تماضر واربعوا صحبي     وقفوا فإن وقوفكم حسبي\nما إن رأيت ولا سمعت به     كاليوم طالي أينق جرب\nمتبذلا تبدو محاسنه     يضع الهناء مواضع النقب\nأخناس قد هام الفؤاد بكم     واعتاده داء من الحب\nفبلغتها خطبته ، فقالت : لا أدع بني عمي الطوال مثل عوالي الرماح وأتزوج شيخا ، فلما بلغه ذلك قال من أبيات :\nوقاك الله يا ابنة آل عمرو     من الفتيان أمثالي ونفسي\nوقالت إنه شيخ كبير    وهل خبرتها أني بن أمس\nوقد علم المراضع في جمادي     إذا استعجلن عن حز بنهس\nإلى أن قال :    \nوأني لا أبيت بغير نحر     وأبدأ بالأرامل حين أمسي\nوأني لا يهر الكلب ضيفي     ولا جاري يبيت خبيث نفس\nفأجابته بأبيات .\nقال أبو عمر : قدمت على النبي    مع قومها من بني سليم ، فأسلمت معهم ، فذكروا أن رسول الله   كان يستنشدها ويعجبه شعرها ، وكانت تنشده وهو يقول : \"هيه يا خناس ويومىء بيده\" .\n قالوا : وكانت الخنساء تقول في أول أمرها البيتين أو الثلاثة ، حتى قتل أخوها شقيقها معاوية بن عمرو ، وقتل أخوها لأبيها صخر ، وكان أحبهما إليها لأنه كان حليما جوادا محبوبا في العشيرة كان غزا بني أسد فطعنه أبو ثور الأسدي طعنة مرض منها حولا ، ثم مات فلما قتل أخواها أكثرت من الشعر فمن قولها في صخر  :   \nأعيني جوادا ولا تجمدا     ألا تبكيان لصخر الندى\nألا تبكيان الجريء الجميل     ألا تبكيان الفتى السيدا\nالنجاد عظيم الرماد     ساد عشيرته أمردا\nقال وأجمع أهل العلم بالشعر أن لم تكن امرأة قبلها ولا بعدها أشعر منها.( )  \nوفي معركة القادسية كانت الخنساء بنت عمرو السلمية ومعها بنوها أربعة رجال ، فذكر موعظتها لهم وتحريضهم على القتال وعدم الفرار ، وفيها : إنكم أسلمتم طائعين ، وهاجرتم مختارين وإنكم لبنوا أب واحد وأم واحدة ما هجنت آباءكم ولا فضحت أخوالكم ، فلما أصبحوا باشروا القتال واحدا بعد واحد حتى قتلوا ، وكان منهم أنشد قبل أن يستشهد رجزا فأنشد الأول :    \nيا إخوتي إن العجوز الناصحه     قد نصحتنا إذ دعتنا البارحه\nبمقالة ذات بيان واضحه     وإنما تلقون ثم الصائحه\nمن آل ساسان كلابا نابحه .\nوأنشد الثاني :    \nإن العجوز ذات حزم وجلد     قد أمرتنا بالسداد والرشد\nنصيحة منها وبرا بالولد     فباكروا الحرب حماة في العدد\nوأنشد الثالث :    \nوالله لا نعصي العجوز حرفا     نصحا وبرا صادقا ولطفا\nفبادروا الحرب الضروس زحفا     حتى تلفوا آل كسرى لفا\nوأنشد الرابع  :   \nلست لخنساء ولا للأخرم     ولا لعمرو ذي السناء الأقدم\nإن لم أرد في الجيش جيش الأعجم     ماض على الهول خضم حضرمي \nثم تقدم فقاتل حتى قتل :\nقال : فبلغها الخبر ، فقالت الحمد لله الذي شرفني بقتلهم ، وأرجو من ربي أن يجمعني بهم في مستقر رحمته .\nوكان عمر بن الخطاب يعطي الخنساء أرزاق أولادها الأربعة ، لكل واحد مائتا درهم ، حتى قبض .\n          وتوفيت الخنساء بالبادية في أول خلافة عثمان بن عفان  سنة 24هـ .                       ",
    "number-en": "The story of Al-Khansa, the mother of martyrs",
    "label-en": "She is: Tamadur bint Amr, bin Al-Harith, bin Al-Sharid, bin Tha’labah bin Asiya bin Khafaf bin Imru’ Alaf bin Bahtha bin Salim Al-Salamiyah.\nIbn Hajar said: The famous poet, Aad Tamadhar, with a dual vowel form, the beginning of which is a vocative dhaad, and about that, Duraid bin Al-Samah says, when he saw her having her camels congratulated, then she stripped and washed, and she liked it, so he proposed to her, but she refused, and he said about her:    \nHail Tamadur and be four of my companions and stand, for your standing is sufficient for me\nI have never seen or heard of it like today, Tali Ayang Jarb\nDressed up, his virtues appear. He places contentment in places of ugliness\nAhnas, his heart is longing for you and has become accustomed to a disease of love\nSo she heard his proposal, and she said: I will not leave my cousins who are as tall as those who carry spears, and I will marry an old man. When he heard that, he said some of the verses:\nMay God protect you, daughter of the Amr family, from boys like me and myself\nShe said that he is a great sheikh. Did you tell her that I was a son yesterday?\nHe taught the wet nurses in Jumada that if they were in a hurry to do so, it would be enough\nUntil he said:    \nAnd I never spend the night without slaughtering, and I start with the widows in the evening\nAnd I will not let a dog attack my guest or my neighbor who has an evil mind\nShe answered him with verses.\nAbu Omar said: She came to the Prophet, may God bless him and grant him peace, with her people from Banu Salim, and she converted to Islam with them. They mentioned that the Messenger of God, may God bless him and grant him peace, used to seek her out and admire her poetry, and she used to recite to him while he said: “Here, O Khanas,” and he gestured with his hand.\n They said: Al-Khansa’ used to say two or three verses at the beginning of her command, until her brother killed her brother Muawiyah bin Amr, and her brother killed her father Sakhr, and he was the most beloved of them both because he was a patient, generous, and beloved horse in the clan. He had fought against Banu Asad, and Abu Thawr Al-Asadi stabbed him once, from which he became ill with a strabismus, then he died. When her brothers were killed, she wrote a lot of poetry, so from what she said about Sakhr:   \nMy eyes are cold and do not freeze, do they not cry for the rocks of dew\nDon't you cry for the bold and beautiful boy? Don't you cry for the gentleman boy\nAl-Najjad, the Great Ash, ruled over his clan Amrda\nHe said, “The scholars of poetry are unanimously agreed that no woman before or after her was hairier than her.”()  \nIn the battle of Al-Qadisiyah, Al-Khansa' bint Amr Al-Salamiyah was with her four men, her sons. He mentioned her admonition to them and her urging them to fight and not flee, in which it was: You accepted Islam willingly, and you emigrated by choice, and you were born of one father and one mother. Your fathers did not intermarry nor did your maternal uncles disgrace. So when the morning dawned, they began fighting one after one until they were killed, and one of them recited a rage before he was martyred, so the first recited:    \nMy brothers, the old woman advised us when she called us yesterday\nWith an article with a clear statement, but then you receive the shoutout\nFrom the Sassanian family there are barking dogs.\nAnd the second chant:    \nThe old woman, who is firm and firm, has commanded us to repay and be wise\nAdvice from her and be kind to the son, so they went early to war, strong in numbers\nThe third chant:    \nBy God, we do not disobey the old woman in the slightest bit of advice, honesty, honesty, or kindness\nSo they began the fierce war, marching until they completely surrounded the family of Khosrau\nThe fourth chant:   \nI am not from Khansa, nor from Al-Akhram, nor from Amr, the oldest\nIf I do not want to join the army, the Persian army will march on the sphinx in the midst of the Hadrami \nThen he advanced and fought until he was killed:\nHe said: Then the news reached her, and she said, “Praise be to God who honored me by killing them, and I hope that my Lord will gather me with them in the abode of His mercy.”\nOmar bin Al-Khattab used to give Al-Khansa’ the livelihood of her four children, two hundred dirhams for each one, until he received the money.\n          Al-Khansa died in the desert at the beginning of the caliphate of Othman bin Affan, peace be upon him, in the year 24 AH."
  },
  {
    "number": "قصة كبشة بنت رافع - أم الأبطال",
    "text": "",
    "label": "هي : كبشة بنت رافع بن عبيد بن الأبجر – وهو خدرة – بن عوف بن الخزرج الأنصارية الخدرية .\nأمها : أم الربيع بنت مالك بن عامر بن فهيرة بن بياضة .\nكانت من المسلمات الأوائل منذ دخول الإسلام في المدينة .\nهي أم الصحابي الجليل البطل سعد بن معاذ  ، الذي اهتز عرش الرحمن لموته .\nابنها الذي حكم بحكم الله من فوق سبع سموات .\nزوجها معاذ بن النعمان من بني عبد الأشهل ، وقد ولدت له سعداً وعَمراً وإياساً وأوساً وعقربَ وأم حزام .\nكانت أم سعد رضي الله عنها من السابقات في الخير ، حيث كانت أول من بايع النبي  مع أم عامر بنت يزيد بن السكن ، وحواء بنت يزيد بن السكن .( )\nلها مواقف تدل على إيمانها وجهادها وصبرها ، فقد خرجت في غزوة أحد مع من خرجن من النساء تطمئن على سلامة رسول الله  ، وقد وصلها خبر استشهاد ولدها عمرو بن معاذ  ، ومع هذا فقد كانت تريد الاطمئنان على سلامة رسول الله  .\nوعندما وصلت أرض المعركة وعلمت بسلامة رسول الله  حمدت الله تعالى واعتبرت مصيبتها هينة .\nوكان ابنها عمرو بن معاذ  يقاتل في المعركة ، حتى لقيه ضرار بن الخطاب فقتله ، وكان يومئذٍ ما يزال على شركه .\nومن مواقفها الإيمانية رضي الله عنها التي تدل على صبرها وجهادها وشجاعتها أيضاً .\nحين كانت مع أم المؤمنين عائشة رضي الله عنها في غزوة الخندق في حصن بني حارثة ، وقد كان رسول الله  وأصحابه حين خرجوا إلى الخندق قد رفعوا الذراري والنساء في الحصون مخافة العدو عليهم .\nقالت عائشة رضي الله عنها : كنت في حصن بني حارثة وأم سعد بن معاذ معي ، فمر سعد بن معاذ ، وهو يقول :    \nلبث قليلاً يلحق   الهيجا  حَمَل     ما أحسن الموت إذا حان الأجل\nفقالت له أمه رضي الله عنها : الحق يا بني فقد تأخرت ، \nفقلت : يا أم سعد لوددت أن درع سعد أسبغ مما هي ، \nقال : فأصابه السهم حيث خافت عليه ، \nوقال الذي رماه : خذها وأنا بن العرقة ، \nفقال : عرق الله وجهك في النار. \nوابن العرقة  ، اسمه حبان بن عبد مناف من بني عامر بن لؤي .\nوالعرقة ، أمه ، وقيل إن الذي أصاب سعد أبو أمامة الجشمي.( )\nانظر كم هي شجاعتها رضي الله عنها ، وأرضاها وأكرمها في جنات الخلد مثواها .\nيا حبذا لو تسلك نسائنا وبناتنا طريق هؤلاء الصحابيات الجليلات ، وأن يقتدن بهن .  ",
    "number-en": "The story of Kabsha bint Rafi’ - the mother of heroes",
    "label-en": "She is: Kabsha bint Rafi’ bin Ubaid bin Al-Abjar - who is Khudra - bin Awf bin Al-Khazraj Al-Ansariyya Al-Khudriyah.\nHer mother: Umm Al-Rabi’ bint Malik bin Amer bin Fuhaira bin Bayadah.\nShe was one of the first Muslims since the introduction of Islam in Medina.\nShe is the mother of the honorable and heroic companion Saad bin Muadh, peace be upon him, whose death shook the throne of the Most Gracious.\nHer son who ruled with God’s rule from above seven heavens.\nHer husband, Moaz bin Al-Numan, is from the clan of Abdul-Ashhal, and she bore him Saad, Omar, Iyas, Awsa, Scorpio, and Umm Hizam.\nUmm Saad, may God be pleased with her, was one of the first to do good deeds, as she was the first to pledge allegiance to the Prophet, may God bless him and grant him peace, along with Umm Amer, the daughter of Yazid ibn al-Sakan, and Eve, the daughter of Yazid ibn al-Sakan.()\nShe had positions that indicated her faith, jihad, and patience. She went out on the Battle of Uhud with the women who went out to reassure the safety of the Messenger of God, may God bless him and grant him peace. She received news of the martyrdom of her son Amr bin Muadh, and despite this, she wanted to reassure herself of the safety of the Messenger of God, may God bless him and grant him peace.\nWhen she reached the battlefield and learned of the safety of the Messenger of God, may God bless him and grant him peace, she thanked God Almighty and considered her calamity easy.\nHer son Amr bin Muadh, may God bless him and grant him peace, was fighting in the battle, until Dirar bin Al-Khattab met him and killed him, and at that time he was still in his trap.\nAmong her stances of faith, may God be pleased with her, are evidence of her patience, effort, and courage as well.\nWhen she was with the Mother of the Believers, Aisha, may God be pleased with her, in the Battle of the Trench in the fort of Banu Haritha. When the Messenger of God, peace and blessings of God be upon him, and his companions went out to the Trench, they had raised the women and children in the forts for fear of the enemy.\nAisha, may God be pleased with her, said: I was in the fort of Banu Haritha, and Umm Saad bin Muadh was with me, when Saad bin Muadh passed by, and he said:    \nHe stayed for a little while, and the burden of death came upon him. How good it is to die when the time has come\nHis mother, may God be pleased with her, said to him: Right, my son, you are late. \nI said: O Umm Saad, I wish Saad’s armor was more elegant than hers. \nHe said: The arrow hit him where it was afraid. \nThe one who threw it said: Take it while I am Bin Al-Arqah. \nHe said: May God sweat your face in Hell. \nIbn al-Irqah, whose name is Hibban bin Abd Manaf, is from Bani Amir bin Luay.\nAl-Irqah, his mother, and it was said that the one who struck Saad was Abu Umamah Al-Jashmi.()\nSee how brave she is, may God be pleased with her, and please her and honor her in the Gardens of eternity, her abode.\nOh, it would be better if our women and girls followed the path of these venerable female companions and imitated them."
  },
  {
    "number": "قصة حبيبة بنت خارجة",
    "text": "",
    "label": "الزوجة الرابعة لأبي بكر\nحبيبة بنت خارجة بن زيد الخزرجية\nأبوها : هو خارجة بن زيد بن أبي زهير الأنصاري الخزرجي ، استشهد في معركة أحد .\nأمها :هزيلة بنت عتبة بن عمرو بن  خديج .\nإسلامها : أسلمت حبيبة وبايعت الرسول  .\nزواجها : تزوجها أبو بكر الصديق في المدينة بعد الهجرة . وبعد وفاة أبي بكر تزوجها خبيب بن أساف بن عتبة بن عمرو .\nقال ابن الجوزي: وكان أبو بكر لما هاجر إلى المدينة نزل على خارجة فتزوج ابنته .( )\nعن جابر بن عبد الله قال : دخل أبو بكر يستأذن على رسول الله  ، فوجد الناس جلوساً ببابه لم يؤذن لأحد منهم ، قال : فأذن لأبي بكر ، فدخل ، ثم أقبل عمر ، فستأذن ، فأذن له ، فوجد النبي  جالساً حوله نساؤه واجماً ساكتاً ، قال : فقال : لأقولن شيئاً أضحك النبي  فقال : يا رسول الله ، لو رأيت بنت خارجة سألتني النفقة ، فقمت إليها فوجأت عنقها ، فضحك رسول الله  وقال :\"هن حولي كما ترى ، يسألنني النفقة \" .\n\nعن عائشة رضي الله عنها ، أن رسول الله  مات وأبو بكر بالسنح ، قال إسماعيل يعني العالية .\nقال ابن حجر في شرح الحديث: مسكنه بالسنح : وتقدم ضبطه في الجنائز ، وأنه مسكن زوجة أبي بكر الصديق .\nفتح الباري .\nوقال أيضاً : بالسنح ... وضبطه أبو عبيد البكري بضمها وقال : إنه منازل بني الحارث من الخزرج بالعوالي ، وبينه وبين المسجد النبوي ميل .                      ",
    "number-en": "The story of Habiba, an outgoing girl",
    "label-en": "The fourth wife of Abu Bakr\nHabiba bint Kharijah bin Zaid Al Khazrajiya\nHer father: Kharijah bin Zaid bin Abi Zuhair Al-Ansari Al-Khazraji, was martyred in the Battle of Uhud.\nHer mother: Huzaila bint Utbah bin Amr bin Khadij.\nHer conversion to Islam: Habibah converted to Islam and pledged allegiance to the Messenger, peace and blessings be upon him.\nHer marriage: Abu Bakr Al-Siddiq married her in Medina after the migration. After the death of Abu Bakr, Khabib bin Asaf bin Utbah bin Amr married her.\nIbn al-Jawzi said: When Abu Bakr migrated to Medina, he went to Kharijah and married his daughter.()\nOn the authority of Jabir bin Abdullah, he said: Abu Bakr entered asking permission to come to the Messenger of God, may God bless him and grant him peace, and he found people sitting at his door, and none of them were given permission. He said: So he gave permission for Abu Bakr, so he entered. Then Omar came and he would give permission, so he gave him permission, and he found the Prophet, may God bless him and grant him peace, sitting around him with his wives sitting silently. He said: So he said: I will say something that will make the Prophet, may God bless him and grant him peace, laugh. He said: O Messenger of God, if I saw a girl She went out and asked me for money, so I went up to her and touched her neck, and the Messenger of God, may God bless him and grant him peace, laughed and said: “They are around me, as you can see, and they are asking me for money.”\n\nOn the authority of Aisha, may God be pleased with her, that the Messenger of God, may God bless him and grant him peace, died while Abu Bakr died, Ismail said, meaning Al-Aliya.\nIbn Hajar said in his explanation of the hadith: His residence is in the Sunnah, and it was previously mentioned in funerals, and that it is the residence of the wife of Abu Bakr al-Siddiq.\nOpen the bar.\nHe also said: With an annex... Abu Ubaid al-Bakri clarified it with its inclusion and said: It is the homes of Banu al-Harith from Al-Khazraj in al-Awali, and between it and the Prophet’s Mosque is a mile."
  }
]