[
  {
    "number": "معجزة آدم عليه السلام ",
    "text": "",
    "label": "قصة خلق الله سيّدنا آدم هي قصة خلق البشرية أجمع، فقد كان أول خلق للبشر هو خلق آدم عليه السلام من طين، بصنع يدي الله عز وجل، فبشر الله سبحانه وتعالى الملائكة قائلاً أنه سوف يخلق آدم ويسكنه بالأرض، وتحدث القرآن الكريم عن قصة خلق سيدنا آدم في سورة البقرة، حيث أن الله بشر الملائكة بأنه سوف يخلق البشر ويستخلفهم في الأرض من أجل اعمار الأرض، ولكن الملائكة إستغربت ذلك، وقالت كيف سوف تستخلف في الأرض من يفسد فيها، ويقتل ويسفك الدماء، ألا يكفيك تسبيحنا، فأخبرهم الله أنه يعرف أشياء كثيرة هم لا يعرفونها .\n\nوقد توصل العلماء إلى أن هناك من كان يعيش في الأرض قبل سيدنا آدم، وهو مخلوق شبيه بسيّدنا آدم، ولكنه عاش بطريقة همجية ووحشية، وأكثر الفساد والقتل، لذلك عندما إستغربت الملائكة أن يستخلف الله أناس في الأرض قال لهم أن سيدنا آدم عاقل وقادر، خلق الله سبحانه وتعالى سيدنا آدم في آخر ساعات من يوم الجمعة، فأرسل جبريل إلى الأرض ليجلب الطين وخلق سيدنا آدم من طين الأرض، نفخ فيه الله من روحه ودبت فيه الحياة، وعندما فتح آدم عينيه عطس فقالت له الملائكة قل الحمدلله، فقال الحمدلله، فقال له الله رحمك الله، ليجد الملائكة جميعها ساجدة له، ما عدا مخلوق واحد فقط ولم يكن آدم يعرف من هذا المخلوق الذي لم يسجد له، وذكر الله فيما بعد قصة رفض إبليس السجود لآدم وكيف صب عليه الله غضبه نتيجة لذلك .\n\nعلم الله سيدنا آدم جميع الأسماء، وكانت الملائكة تسأله عن أسماء الأشياء ويجيب، وعاش سيّدنا آدم في الجنة، وخلق السيدة حواء من ضلع آدم وأسكنهما الجنة ليعيشا فيها، وكما سترهم الله بلباس يواري عورتهما، ولكن أغرهم الشيطان ونزع عنهم سترهم، حتى يصبحوا همجيين مثل من سبقوهم، ولا ينعموا بسكن الجنة، وهنا كانت قصة نزول آدم وحواء من الجنة، عندما أسكنهم الله في الجنة أخبرهم بالابتعاد عن شجرة في الجنة، وألا يأكلا منها، ولكن الشيطان وسوس إليهما أن يأكلا منها، لعلهما يبقيان خالدين على قيد الحياة إلى الأبد، ولكن عندما أكلا منها غضب الله عليهما غضباً شديداً، وأنزلهما إلى الأرض، وأنزل معهم الشيطان إلى الأرض، ليوسوس لهم حتى يحرمهم من دخول الجنة مرة أخرى، فتوعد الله سبحانه وتعالى بعذاب أليم لمن يستمع إلى الشيطان، كما توعد بأن يملأ بهم جهنم هم والشياطين . العبرة المستفادة من قصة خلق سيدنا آدم هي معرفة السبب الحقيقي وراء خروج سيدنا آدم وزوجته من الجنة ونزولهم إلى الأرض، كما معرفة موقف الشيطان من خلق بني آدم وإستخلافهم في الأرض .                      ",
    "number-en": "The miracle of Adam, peace be upon him",
    "label-en": "The story of the creation of God, our Master Adam, is the story of the creation of all humanity. The first creation of humans was the creation of Adam, peace be upon him, from clay, by the handiwork of God Almighty. God Almighty gave good news to the angels, saying that He would create Adam and settle him on the earth. The Holy Qur’an spoke about the story of the creation of our Master Adam in Surah Al-Baqarah, where God gave the angels good news that He would create humans and appoint them as successors on the earth in order to populate the earth. But the angels were surprised by this, and said, “How will they be succeeded in the earth by He wreaks havoc, kills, and sheds blood. Isn’t our praise sufficient for you? So God told them that He knows many things that they do not know.\n\nScientists have concluded that there was someone who lived on earth before our master Adam, and he is a creature similar to our master Adam, but he lived in a barbaric and brutal way, and was most corrupt and murderous. Therefore, when the angels were surprised that God would appoint people on earth as successors, he told them that our master Adam was rational and capable. God Almighty created our master Adam in the last hours of Friday, so he sent Gabriel to the earth to bring clay and created our master Adam from the clay of the earth. God breathed into him from his soul and it moved. In it is life, and when Adam opened his eyes, he sneezed, and the angels said to him, “Say, ‘Praise be to God,’” so he said, “Praise be to God,” and he said to him, “May God have mercy on you.” He found all of the angels prostrating to him, except for one creature only, and Adam did not know who this creature was that did not prostrate to him. God later mentioned the story of Satan’s refusal to prostrate to Adam and how God poured out His wrath upon him as a result of that.\n\nGod taught our master Adam all the names, and the angels would ask him about the names of things and he would answer. Our master Adam lived in Paradise, and created Lady Eve from Adam’s rib and placed them in Paradise to live in. Just as God covered them with clothes that covered their private parts, but Satan tempted them and removed their cover from them, until they became barbaric like those who came before them, and did not enjoy the residence of Paradise. Here was the story of Adam and Eve’s descent from Paradise. When God placed them in Paradise, he told them. By staying away from a tree in Paradise, and not to eat from it, but Satan whispered to them to eat from it, so that they might remain alive forever, but when they ate from it, God became angry with them with extreme anger, and brought them down to earth, and Satan sent down with them to earth, to whisper to them to prevent them from entering Paradise again, so God Almighty threatened a painful punishment for whoever listens to Satan, just as he threatened to fill Hell with them and the devils. The lesson learned from the story of the creation of our Master Adam is to know the real reason behind the departure of our Master Adam and his wife from Paradise and their descent to Earth, as well as knowing Satan’s position on the creation of the sons of Adam and his succession on Earth."
  },
  {
    "number": "معجزات رسول الله محمد صلى الله عليه وسلم ",
    "text": "",
    "label": "\n\nبعث الله محمداً صلى الله عليه وسلم وختم به النبوات والرسالات، وجعل نبوته لأهل الأرض جميعاً، وبعثه بشريعة شاملة لجميع جوانب الحياة، فلا نبي بعد محمد صلى الله عليه وسلم، ولا كتاب بعد القرآن الكريم، وأيده بالمعجزات الكثيرة مثل القرآن الكريم، وانشقاق القمر، والإسراء والمعراج، وتكثير الطعام القليل، ونبع الماء من بين أصابعه، وإجابة دعوته، ونزول الملائكة لنصرته، وأيده بعلاج المرضى، والإخبار بالأمور الغيبية التي وقعت في الماضي، وما يقع في المستقبل، وغير ذلك من المعجزات الكثيرة، ويمكنكم الإطلاع على سيرة الرسول عليه الصلاة عبر التطبيق كاملة ً -إن شاء الله تعالى- في باب التعريف بقصص الانبياء.                      ",
    "number-en": "Miracles of the Messenger of God, Muhammad, may God bless him and grant him peace",
    "label-en": "God sent Muhammad, may God bless him and grant him peace, and sealed the prophecies and messages with him, and made his prophecy for all the people of the earth, and sent him with a comprehensive law for all aspects of life. There is no prophet after Muhammad, may God bless him and grant him peace, and no book after the Holy Qur’an. He supported him with many miracles such as the Holy Qur’an, the splitting of the moon, the night journey and ascension, the multiplication of little food, the spring of water from between his fingers, the answer to his prayers, the descent of angels to support him, and he supported him by treating the sick. And informing about unseen things that happened in the past, and what will happen in the future, and many other miracles, and you can view the entire biography of the Messenger, peace and blessings be upon him, through the application - God Almighty willing - in the chapter on introducing the stories of the prophets."
  },
  {
    "number": "معجزة يوسف عليه السلام ",
    "text": "",
    "label": "الفترة التي أقام فيها بنو إسرائيل في مصر هي فترة حساسة من تاريخهم الطويل، ومن التاريخ المصري على امتداده، فالداخل هو نبي كريم جاء من الأراضي المقدسة بقصة عجيبة، حيث دخل بنو إسرائيل أو بنو يعقوب –عليه السلام- بقصة رائعة أظهرت الإعجاز القصصي القرآني في قصة كاملة استعرضتها سورة النبي يوسف واحدة من أعظم سور القرآن الكريم. ومما زاد هذه الفترة أهمية هي الدرس الذي قدمته للبشرية، فعندما دخل أبناء يعقوب إلى مصر دخلوا والعزة تجللهم، ولكن الزمن غير الامور وقلبها رأساً على عقب، فلقد بدأ الذل والضعف يسيطر عليهم يوماً بعد يوم وشهراً بعد شهر وسنة بعد سنة، إلى أن أصبحوا عبيداً عند الفارعنة المصريين، وبلغت هذه المصيبة أوجها في آخر الفترة، حيث كان المخرج الوحيد هو المخلص موسى الرسول العظيم – عليه السلام – الذي جاء بالتشريع اليهودي.\n\n وحرر بني إسرائيل من الطغيان الفرعوني الذي جثم على قلوبهم، في قصة تحرير عالمية توارثتها الديانات ديناً بعد دين وخلدتها الكتب السماوية جميعها. ولكن الأجمل أن الداخل والمخلص، من كتب الصفحة الأولى في الرواية ومن ختمها هما شخصيتان عظيمتان عالميتان، فيوسف الداخل استطاع أن يأسر قلوب الجميع ليس بجماله خلقته بل بجمال خلفه، فلقد أعجب به المصريون ورفعوه إلى الأعالي كما أعجب به أبناء قومه، فهو شخصية توافقية توافق عليها الجميع بلا تردد، أما المخلص موسى العظيم فهو شخصية ناضلت وصارعت من أجل قومها وخلاص شعبها، فهو رمز التحرر حتى يومنا هذا وإلى الأبد. وهما أبناء السلالة الإبراهيمية التي هزت البشرية بأفعالها السامية. النبي يوسف هو ابن النبي يعقوب بن النبي إسحق بن إبراهيم –عليهم الصلاة والسلام أجمعين-، فهو من سلالة نبوية ليس لها مثيل، بدأ حياته برؤيا رآها تفاصيلها مذكورة بالتفصيل في القرآن الحكيم في سورة يوسف، وانتهت بتوليه المناصب العليا في الدولة المصرية وتحقق رؤياه في صغره، فلقد اشتهر هذا النبي الكريم بقدرته العظيمة على تفسير الرؤى الحقة التي تعتبر إلهاماً من الله –عز وجل- إلى الناس، فالرؤى في حياة النبي يوسف، مرتبطة في حياته منذ الصغر وفي كبره حينما فسر الرؤيا لرفقائه في السجن والذين تعرضوا لنفس المواقف التي فسرها لهم النبي يوسف مما أشاع عنه هذه الصفة ورفع من مراتبه عند المسؤولين في الدولة، في تكريم واضح ومكافأة له من الله تعالى على ما لاقاه من صعوبات وتحديات جسام خلال حياته الطاهرة.                      ",
    "number-en": "The miracle of Joseph, peace be upon him",
    "label-en": "The period in which the Children of Israel resided in Egypt was a sensitive period in their long history, and in Egyptian history throughout it. The one who entered was a noble prophet who came from the Holy Lands with a wondrous story, as the Children of Israel or the Children of Jacob - peace be upon him - entered with a wonderful story that showed the miracle of the Qur’anic narrative in a complete story reviewed by Surah Prophet Yusuf, one of the greatest surahs of the Holy Qur’an. What made this period more important was the lesson it provided to humanity. When the sons of Jacob entered Egypt, they entered with glory adorning them, but time changed things and turned them upside down. Humiliation and weakness began to dominate them day after day, month after month, and year after year, until they became slaves to the Egyptian Pharaohs. This calamity reached its climax at the end of the period, when the only way out was the Savior Moses, the great Messenger - peace be upon him - who brought in Jewish legislation.\n\n He liberated the children of Israel from the Pharaonic tyranny that perched on their hearts, in a global story of liberation that was passed down by religion after religion and immortalized in all the heavenly books. But the most beautiful thing is that Al-Dakhil and the Savior, the one who wrote the first page of the novel and the one who sealed it, are two great, universal personalities. Youssef Al-Dakhil was able to captivate everyone’s hearts not with the beauty of his creation, but with the beauty behind him. The Egyptians admired him and raised him to the heights, just as his people admired him. He is a consensual character that everyone agrees upon without hesitation. As for the great Savior Moses, he is a character who struggled and fought for his people and the salvation of his people. He is a symbol of liberation to this day and forever. They are sons of the Abrahamic lineage that shook humanity with its lofty deeds. The Prophet Joseph is the son of the Prophet Jacob, the son of the Prophet Ishaq, the son of Abraham - may peace and blessings be upon them all. He is from an unparalleled prophetic lineage. He began his life with a vision that he saw, the details of which are mentioned in detail in the Wise Qur’an in Surat Yusuf, and it ended with him assuming the highest positions in the Egyptian state, and his visions were fulfilled when he was young. This noble Prophet was famous for his great ability to interpret true visions that are considered an inspiration from God Almighty to the people. The visions in the life of the Prophet Joseph are linked. In his life since childhood and in his old age, when he interpreted the vision to his companions in prison who were exposed to the same situations that the Prophet Joseph explained to them, which spread this trait about him and raised his ranks among state officials, in a clear honor and reward for him from God Almighty for the great difficulties and challenges he faced during his pure life."
  },
  {
    "number": "معجزة نوح عليه السلام ",
    "text": "",
    "label": "لقد بعث الله عز وجل الأنبياء للبشر داعين إلى الله عز وجل وإلى الصراط المستقيم، ليعيد الناس إلى فطرتهم التي فطر الناس عليها والتي تتلوث بعد التفاعل في الحياة ونتيجة للمجتمعات المظلمة التي يعيش فيها الإنسان ولوساوس الشيطان، فقام الأنبياء بحمل الرسالات إلى أقوامهم وقاموا بدعوتهم بالحُسنى داعين ومبشرين إلى الله عز وجل، ولكن ولكي يؤمن الأقوام بالأنبياء والرسل الذين بعثهم الله عز وجل قام الله عز وجل بتأييدهم بالمعجزات الواضحات على صدق رسالتهم لكي يقيموا الحجة على الأقوام الذين بُعثوا إليهم، فكانت من المعجزات ما يؤيد الله عزّ وجلّ بها الإنسان ليؤيد الأقوام ومنها ما أيّد بها الله عزّ وجلّ الأنبياء والرسل ليعذب الأقوام الذين كفروا بالله بعد الدعوة الطويلة من الأنبياء والرسل عليهم صلوات الله وسلامه.\n\n ومن الأنبياء الذين صبروا صبراً طويلاً على الدعوة والذين قاموا بدعاء أقوامهم بالحسنى والموعظة الحسنة هو نبي الله نوح عليه السلام الذي قام بدعوة قومه إلى الإيمان بالله تعالى ل950 عاماً وهو يحتسب ذلك عند الله تعالى ويصبر على أذى قومه ويتحمّل عذابهم واستهزاءهم به عليه السلام فهو عليه السلام من أولي العزم الخمسة من الرسل إلى جانب سيدنا محمد وإبراهيم وعيسى وموسى عليهم السلام، وبعد انقطاع الأمل منهم أمر الله عزّ وجلّ نوحاً عليه السلام بأن يقوم ببناء سفينة يحمل عليها جميع من آمن من الناس وأهله إلّا من كفر منهم، وأمره الله عزّ وجلّ أن يقوم بحمل زوجين من كل جنس من الأجناس الموجودة على الأرض، فقام عليه السلام ببناء هذه السفينة كما أمره الله تعالى وحمل على هذه السفينة ما أمره الله عز وجل به ليبدأ الحياة من جديد.\n\nوأمر الله عزّ وجلّ نوحاً عليه السلام بذلك لأنّه سيبعث الطوفان الذي يعمّ الأرض بأكملها وسيهلك به جميع من كفروا بالله عز وجل وبنوحٍ عليه السلام ومن آذوه خلال دعوته لهم التي استمرت فترةً طويلة جداً وهو صابرٌ عليهم، فكانت هذه كبدايةٍ لحياةٍ جديدةٍ بدأها نوحٌ عليه السلام وذريته بعد الحياة التي ابتدأها آدم عليه السلام، وبعد انتهاء الطوفان أمر الله عز وجل الأرض بأن تبتلع الماء والسماء أن تُقلع عن المطر، واستوت السفينة على الجودي لتبقى آية للبشر جميعاً على صدق نبوة نوحٍ عليه السلام الذي ترجع إليه ذرية البشر جميعاً قبل سيدنا آدم عليه السلام، وقام الباحثون والمفسرون بمحاولة تحديد مكان السفينة وجلّ المفسرين ذهبوا إلى أنّه جبل يوجد في ناحية الموصل كما توجد بعض صور الأقمار الصناعية التي بينت مكان سفينة نوحٍ عليه السلام.                      ",
    "number-en": "The miracle of Noah, peace be upon him",
    "label-en": "God Almighty has sent prophets to mankind, calling people to God Almighty and to the straight path, to return people to their natural nature with which people were created and which becomes polluted after interaction in life and as a result of the dark societies in which man lives and the insinuations of Satan. So the prophets carried the messages to their people and called them to do good things, calling and giving good tidings to God Almighty, but in order for the people to believe in the prophets and messengers whom God Almighty sent, He God Almighty supported them with miracles that clearly demonstrated the truth of their message in order to establish evidence against the people to whom they were sent. Among the miracles were those with which God Almighty supported man to support the people, and among them were those with which God Almighty supported the prophets and messengers to punish the people who disbelieved in God after the long call from the prophets and messengers, may God’s prayers and peace be upon them.\n\n Among the prophets who had long patience with the call and who called upon their people with goodness and beautiful preaching was the Prophet of God Noah, peace be upon him, who called on his people to believe in God Almighty for 950 years. He considered that to be God Almighty, and he was patient with the harm of his people and endured their torment and their mockery of him, peace be upon him. He, peace be upon him, was one of the five most powerful messengers, along with our master Muhammad, Abraham, Jesus, and Moses, peace be upon them. The loss of hope among them. God Almighty commanded Noah, peace be upon him, to build a ship to carry all of the people and his family who believed, except for those who disbelieved among them. God Almighty commanded him to carry two pairs from each of the races that exist on earth. So he, peace be upon him, built this ship as God Almighty commanded him, and carried on this ship what God Almighty commanded him to begin life anew.\n\nGod Almighty commanded Noah, peace be upon him, to do so because he would send a flood that would cover the entire earth and with it would destroy all those who disbelieved in God Almighty and Noah, peace be upon him, and those who harmed him during his call to them, which lasted for a very long time, and he was patient with them. This was the beginning of a new life that Noah, peace be upon him, and his descendants began after the life that Adam, peace be upon him, had begun. After the flood ended, God Almighty commanded the earth to swallow water. The sky is to give up the rain, and the Ark rests on the mountain to remain a sign to all mankind of the truth of the prophecy of Noah, peace be upon him, to whom all the descendants of mankind will return before our master Adam, peace be upon him. Researchers and interpreters have tried to determine the location of the Ark, and most of the interpreters have said that it is a mountain located in the area of Mosul. There are also some satellite images that showed the location of Noah’s Ark, peace be upon him."
  },
  {
    "number": "معجزة يحيي عليه السلام ",
    "text": "",
    "label": "كان النّبيّ الصّالح زكريا عليه السّلام يحبّ الأطفال والذّريّة، فقد حرم لسنواتٍ من ذلك، فمرأته عاقرٌ لا تلد وهو شيخٌ كبيرٌ، وعندما نذرت امرأة عمران ما في بطنها لله سبحانه فولدت مريم، تشوّق زكريا عليه السّلام لكفالة هذه البنت فقد كان زوج أختها الكبرى، فهو محتاجٌ لضمّ هذه البنت إليه وأن تكون تحت رعايته وحمايته، فقد كان قلبه مليءٌ بالحنان والعطف الذي لم يجد له مكاناً يفرغه فيه لأنّه لم يرزق بولد، فكفل زكريا مريم وكانت نعم الخادمة لبيت الله، قائمةً صائمةً تعبد الله آناء اللّيل والنّهار، وقد كفاها الله هم التّفكير بالمادّة والطّعام والشّراب فكان يأتيها رزقها عند محرابها إكراماً من عند الله لها، فالله هو الذي يرزق من يشاء بغير بحساب، وعندما رأى سيّدنا زكريا تلك الكرامات وأحسّ بفيض الكرم الربّاني مدّ يديه ليدعو ربّه بأن يهبه ذريةً طيبةً ترث ما عنده من العلم والنّبوّة فاستجاب له ربّه ذلك فأكرمه بغلامٍ اسمه يحيى.\n\nو قد جعل الله سبحانه هذا الطّفل مميزاً عن أقرانه، فهو عطيّة الله سبحانه وهو ثمرة استجابة الدّعاء من نبيٍّ صالحٍّ صبر كثيراً حتى نالها، فكان يحيى معجزةً في ولادته من أبٍ شيخٍ كبيرٍ وأمٍّ عاقرٍ لا تلد، وكذلك قد تكلّم الله عنه بأنّه لم يكن له سميّا أي شبيه، فقد أمر سيّدنا يحيى عليه السّلام بأن يتمسّك بكتاب الله التّوراة وأن يأخذها بقوةٍ، وقد آتاه الله الحكم صبياً فكان لا ينشغل كغيره من الفتيان باللّعب بل كان همّه الانعكاف على دراسة التّوراة ودعوة النّاس إلى دين الله والأمر بالمعروف والنّهي عن المنكر.\n\nو قد كان في عصر سيّدنا يحيى عليه السّلام ملكٌ فاجرٌ لا يخاف الله، وقد حدث أن رغب هذا الملك بأن يتزوّج بنت أخيه وكان هذا الأمر مخالفٌ في شريعتهم كما في كلّ الشّرائع التي أنزلها الله، فذهبوا إلى يحيى ليجيز لهم ذلك بفتوىً باطلةٍ، فأبى سيّدنا يحيى ذلك فظلّ الملك حانقاً عليه حتى حانت له الفرصة في أحد اللّيالي وقد كانت بنت أخيه وهي راقصةٌ فاجرة تغنّي وتحيي اللّيل بالرّقص والغناء، فإذا بالملك يراودها عن نفسها فتأبى إلّا أن يكون ذلك بعد الزّواج وتطلب رأس يحيى مهراً لها، فيلبّي الملك الفاجر طلبها لتقطع الرّأس الطّاهرة وتقدّم للبغيّ على طبقٍ من ذهبٍ.                      ",
    "number-en": "The miracle of Yahya, peace be upon him",
    "label-en": "The righteous Prophet Zechariah, peace be upon him, loved children and offspring. He was deprived of that for years, as his wife was barren and could not give birth, and he was very old. When the woman of Imran vowed what was in her womb to God Almighty, and Mary was born, Zechariah, peace be upon him, longed to sponsor this girl, as he was her older sister’s husband. He needed this girl to be with him and for her to be under his care and protection, for his heart was full of tenderness. And the kindness that he could not find a place to spend it on because he was not blessed with a child, so Zechariah sponsored Mary, and she was the best servant of the House of God, standing, fasting, and worshiping God night and day. God sufficed her with the worry of thinking about matter, food, and drink, so her sustenance came to her at her sanctuary out of God’s honor for her. It is God who provides for whomever He wills without reckoning, and when our master Zechariah saw those blessings. He felt the abundance of divine generosity and extended his hands to pray to his Lord to grant him good offspring who would inherit what he had of knowledge and prophecy. His Lord responded to that and honored him with a boy named Yahya.\n\nGod Almighty has made this child distinct from his peers. He is the gift of God Almighty and the fruit of the response to prayers from a righteous prophet who was very patient until he received it. Yahya was a miracle in his birth from an old father and a barren mother who could not give birth. Likewise, God spoke about him that he did not have any similarity to Semiya. He commanded our master Yahya, peace be upon him, to adhere to the Book of God. The Torah and to take it with strength, and God gave him wisdom as a boy, so he was not busy playing like other boys, but rather his concern was to devote himself to studying the Torah and inviting people to the religion of God and enjoining what is right and forbidding what is wrong.\n\nIn the era of our master Yahya, peace be upon him, there was an immoral king who did not fear God. It happened that this king wanted to marry his brother’s daughter, and this matter was contrary to their law, as in all the laws that God revealed. So they went to Yahya to allow them to do so with a false fatwa. Our master Yahya refused, so the king remained angry with him until he had the opportunity one night, and she was a girl. His brother, while she was an immoral dancer, sang and livened the night with dancing and singing, then the king kept her away from herself, so she refused to do so unless it was after marriage and she asked for Yahya’s head as her dowry, so the immoral king fulfilled her request, so she cut off the pure head and presented it to the prostitute on a golden platter."
  },
  {
    "number": "معجزة عيسى عليه السلام ",
    "text": "",
    "label": "عيسى بن مريم عليه السلام ، سيدنا المسيح ، ويعرف أيضا بـ (يسوع) ، أنزل على بني إسرائيل ، وجائهم بالإنجيل ، عيسى ابن مريم تعتبر ولادته معجزته الأولى ، حيث حملته أمه السيدة مريم العذراء ، ولم يكن قد مسها رجل من قبل ، تكلم سيدنا عيسى وهو في المهد . قيل أن السيدة مريم كانت تدفع سيدنا عيسى للعمل دوماً ، وعمل في ذات المرات عند صائغ ثياب ، في يوم أراد رب العمل السفر ، فأخبر سيدنا عيسى بأن هناك الكثير من الثياب تحتاج لصباغ ، وقد علمتك كيفية الصباغ ، ووضعت على كل ثوب خيطاً يحدد اللون المطلوب ، فقام سيدنا عيسى بتسخين وعاءٍ كبير ووضع فيه عدة الوان ، ووضع جميع الثياب في الوعاء ، وأخذ يردد :- \"كوني بإذن الله على ما أريده منكِ\" ، وعند عودة رب العمل من سفره ، استشاط غضبا عندما رأى جميع الثياب في وعاءٍ واحدٍ ، فقام عيسى عليه السلام بإخراج الثياب واحداً أحمر والآخر أصفر ، وآخر أخضر وهكذا ، وكل ثوب بلون الخيط المحدد عليه ، عجب رب العمل من الأمر ، وعلم بأن هذا من عند الله فآمن برسالة عيسى عليه السلام ، ودعا الناس للأمر فآمنوا به ، فكان من جملة الحواريين الذين آزروا عيسى عليه السلام في نشر رسالته . وحدث في يوم بأنه قد مر بمجموعةٍ من صيادي الأسماك ، يدعى كبيرهم \"شمعون\" ، فسألهم عيسى عن عملهم ، فقالوا له نصطاد الأسماك ، فطلب منهم بالمضي معه لدعوة الناس لرسالته ، فسألوه عن نفسه ليجيبهم أنا عيسى بن مريم رسول الله ، فطلبوا منه دليلاً على ما قال.\n\nفأمر سيدنا عيسى شمعون بإلقاء شبكة الصيد في الماء ، وقام سيدنا في تلك اللحظة بالتضرع والدعاء إلى الله ، وما هي إلى لحظات حتى اجتمعت الأسماك في الشبكة حتى كادت أن تتمزق لكثرتها ، فاستعانوا بسفينةٍ أخرى لوضع صيدهم ، وامتلأت السفينتين بصيدٍ وفيرٍ من الأسماك ، وآمن من كان حاضراً بأن هذا من عند الله ، وآمنوا بصدق رسالة عيسى عليه السلام ، وأنطلقوا معه في دعوته . لم سيدنا عيسى ليسلم من مكر اليهود وغدرهم لو لم يكن الله معه ، ففي يومٍ طلب منه اليهود بأن يصنع من الطين خفاشاً ، وبعدها ليجعله يطير إن كان صادقاً ، فقام عيسى بعد أن أوكل أمره لله بصنع خفاشٍ من الطين ، ونفخ فيه ليطير بعدها بين السماء والأرض ، وسط ذهول ودهشة الناظرين . ومن معجزاته عليه السلام إبراء ( الأكمه ) والأبرص ، وكان يحيي الموتى بإذن الله ، شعر اليهود بالبساط يسحب من تحت أقدامهم ، وكذبوا سيدنا عيسى في معجزته بقدرته على إحياء الموتى ، مدعين بأن من أحياهم كان موتهم قريبا ، أي بعد يوم أو يومين من موتهم ، أو ربما بضع ساعات ، ولعلهم لم يموتوا ، ربما أصابهم خطب ما ظهروا به على شكل أموات ، فإن كنت صادقاً أعد لنا \"سام بن نوح\" على قيد الحياة ، فطلب منهم بأن يدلوه على قبره ، فساروا به إلى هناك ، فدعا الله بأن يعيد سام إلى الحياة ، وكان سام عند موته قد ناهز من العمر 4000 عام ، وخرج من قبره ، والتفت إلى الناس قائلاً وهو يشير إلى المسيح عليه السلام :\" صدقوه ، فإنه نبي \" ، ومات من جديد ، آمن البعض بعيسى عليه السلام ، ومن لم يؤمن أتهم سيدنا المسيح بأنه ساحر .                      ",
    "number-en": "The miracle of Jesus, peace be upon him",
    "label-en": "Jesus, son of Mary, peace be upon him, our Lord Christ, also known as (Jesus), was revealed to the children of Israel, and he brought them the Gospel. Jesus, son of Mary, is considered his birth as his first miracle, as his mother, the Virgin Mary, carried him, and no man had touched her before. Our Lord Jesus spoke while he was in the cradle. It was said that Lady Mary was always pushing our Lord Jesus to work, and one time he worked for a clothes jeweler. One day the employer wanted to travel, so he told our Lord Jesus that there were a lot of clothes that needed a dyer. She taught you how to dye, and she put a thread on each garment that determined the desired color. So our Lord Jesus heated a large pot and put several colors in it, and put all the clothes in the pot, and he began repeating: “Be.” God willing, I will do what I want from you.” When the employer returned from his trip, he became angry when he saw all the clothes in one container, so Jesus, peace be upon him, took out the clothes, one red, one yellow, another green, and so on, and each garment was the color of the thread specified on it. The employer was amazed at the matter, and knew that this was from God, so he believed in the message of Jesus, peace be upon him, and he called the people to the matter and they believed in him. He was among the disciples who Support Jesus, peace be upon him, in spreading his message. It happened one day that he passed by a group of fishermen, the chief of whom was called “Shimon.” Jesus asked them about their work. They told him, “We catch fish.” So he asked them to go with him to invite people to his message. They asked him about himself so that he might answer them, “I am Jesus, son of Mary, the Messenger of God.” They asked him for proof of what he said.\n\nSo our Master Jesus ordered Shimon to throw the fishing net into the water, and our Master at that moment supplicated and supplicated to God. After a few moments, the fish gathered in the net until it was almost torn due to its large number. So they sought the help of another ship to place their catch, and the two ships were filled with an abundant catch of fish. Those who were present believed that this was from God, and they believed in the sincerity of the message of Jesus, peace be upon him, and they set out with him in his call. Our Lord Jesus would not have been spared from the deception and treachery of the Jews if God had not been with him. One day, the Jews asked him to make a bat out of clay, and then to make it fly if he was truthful. So Jesus, after entrusting his command to God, made a bat out of clay, and blew on it so that it would then fly between heaven and earth, amidst the astonishment and astonishment of the onlookers. Among his miracles, peace be upon him, was the healing of the blind and the lepers, and he revived the dead, God willing. The Jews felt the rug being pulled from under their feet, and they denied our Lord Jesus in his miracle of his ability to revive the dead, claiming that whoever revived them, their death was near, that is, a day or two after their death, or perhaps a few hours, and perhaps they did not die, perhaps something happened to them that caused them to appear in the form of dead, so if you Honest, he prepared for us \"Shem the son of Noah\" alive. He asked them to guide him to his grave, so they walked him there, so he prayed to God to bring Shem back to life. When Shem died, he was nearly 4,000 years old. He came out of his grave and turned to the people, saying while pointing to Christ, peace be upon him: \"Believe him, for he is a prophet.\" And he died again. Some believed in Jesus, peace be upon him, and whoever did not believe accused our Lord. Christ is a magician."
  },
  {
    "number": "معجزة عزيز عليه السلام ",
    "text": "",
    "label": "يقال عنه عزير ويقال أنه نبي من أنبياء الله انزله الله على بني اسرائيل وهناك رأي آخر يقول انه رجل صالح وهو حبر من أحبار بني اسرائيل . ويقال ا، نسبة يعود إلى لاوي بن يعقول بن اسحاق بن ابراهيم عليهم السلام . حيث قال تعالى: (أَوْ كَالَّذِي مَرَّ عَلَى قَرْيَةٍ وَهِيَ خَاوِيَةٌ عَلَى عُرُوشِهَا قَالَ أَنَّى يُحْيِي هَذِهِ اللَّهُ بَعْدَ مَوْتِهَا فَأَمَاتَهُ اللَّهُ مِائَةَ عَامٍ ثُمَّ بَعَثَهُ قَالَ كَمْ لَبِثْتَ قَالَ لَبِثْتُ يَوْماً أَوْ بَعْضَ يَوْمٍ قَالَ بَلْ لَبِثْتَ مِائَةَ عَامٍ فَانْظُرْ إِلَى طَعَامِكَ وَشَرَابِكَ لَمْ يَتَسَنَّهْ وَانْظُرْ إِلَى حِمَارِكَ وَلِنَجْعَلَكَ آيَةً لِلنَّاسِ وَانْظُرْ إِلَى الْعِظَامِ كَيْفَ نُنْشِزُهَا ثُمَّ نَكْسُوهَا لَحْماً فَلَمَّا تَبَيَّنَ لَهُ قَالَ أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ) وقد ورد ذكره في القرا، في موضع آخر حيث قال الله تعالى (( وقالت اليهود عزير ابن الله) . وهنا نود أن نوضح قصة العزير ذلك النبي أو الرجل الصالح الذي اماته الله وهو كان من بني اسرائيل وأعطاه الله من العلم والحفظ الشيء الكثير والقصة هنا تقول أن ذلك الرجل الصالح كان ماشياً وهو على ظهر حماره وبعد أن سار فترةً من الزمن مر على قرية ولكن هذه القرية كانت خاوية لا يوجد أحد فيها وهنا توقف وتعجب وقال هل من الممكن أن يحيي الله القرية وهي خاوية على عروشها كما ورد في سورة البقرة حيث قال الله تعالى على لسانه ((أَنَّى يُحْيِي هَذِهِ اللَّهُ بَعْدَ مَوْتِهَا) . عندها أماته الله وهو نائم وقبض روحة لمائة عام ثم بعثه الله مرةً أخرى من جديد وعندها استيقظ العزير من نومه فأرسل الله من يسأله وكان ذلك الذي يسأله هو ملك من الملائكة على هيئة بشر.\n\nوقام بسؤال عزير كم المدة التي مكثها نائماً كما قال الله تعالى في محكم كتابه (قَالَ كَمْ لَبِثْتَ) فرد العزير الإجابة إلى من قام بسؤاله انه لبث مائماً يوم أو جزءاً من اليوم كما قال الله تعالى في سورة البقرة (قَالَ لَبِثْتُ يَوْمًا أَوْ بَعْضَ يَوْمٍ) اذاً الجواب كان أنه لبث مدة قصيرة . ولكم الملك الذي سأله رد عليه انه لبث ميتأً مائة عام كاملة حيث قال الله تعالى في كتابه (قَالَ بَل لَّبِثْتَ مِئَةَ عَامٍ) (وَانظُرْ إِلَى العِظَامِ كَيْفَ نُنشِزُهَا ثُمَّ نَكْسُوهَا لَحْمًا) إذاً من الأيات السابقه نعرف أنه مات مائة عام وبعثه الله من جديد ليجعله اية للناس حيث قال الله تعالى في القرأن الكريم (وَلِنَجْعَلَكَ آيَةً لِّلنَّاسِ). عندئذٍ عرف عزير أن الله قادر أن يميته ويحيه ويحيي القرية التي كانت خاوية على عروشها (فَلَمَّا تَبَيَّنَ لَهُ قَالَ أَعْلَمُ أَنَّ اللّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ) وعندها خرج إلى القرية فوجدها قد عمرها الإنسان وبدأ يتجول فيها . وهو يتجول في القرية قام بالسؤال عن عزير فقال له الناس نعم نعرفه لقد أماته الله منذ مائة عام وعندها قال لهم أنا عزير قد أحياني الله مرةً أخرى وعندها بدأ يعلم الناس التوراة مرةً أخرى ويجددها لهم وعندها قدسوه وأدعوا باطلاً أنه ابن الله كما قال الله تعالى في محكم كتابه (وَقَالَتِ الْيَهُودُ عُزَيْرٌ ابْنُ اللّهِ) وهذا مخالف لديننا الحنيف الذي وصف عزير أنه رجل صالح أماته الله مائة عام كي يكون آيةً للناس عن قدرة الله سبحانه وتعالى (أَوْ كَالَّذِي مَرَّ عَلَى قَرْيَةٍ وَهِيَ خَاوِيَةٌ عَلَى عُرُوشِهَا قَالَ أَنَّى يُحْيِي هَذِهِ اللَّهُ بَعْدَ مَوْتِهَا فَأَمَاتَهُ اللَّهُ مِائَةَ عَامٍ ثُمَّ بَعَثَهُ قَالَ كَمْ لَبِثْتَ قَالَ لَبِثْتُ يَوْمًا أَوْ بَعْضَ يَوْمٍ قَالَ بَلْ لَبِثْتَ مِائَةَ عَامٍ فَانْظُرْ إِلَى طَعَامِكَ وَشَرَابِكَ لَمْ يَتَسَنَّهْ وَانْظُرْ إِلَى حِمَارِكَ وَلِنَجْعَلَكَ آيَةً لِلنَّاسِ وَانْظُرْ إِلَى الْعِظَامِ كَيْفَ نُنْشِزُهَا ثُمَّ نَكْسُوهَا لَحْمًا فَلَمَّا تَبَيَّنَ لَهُ قَالَ أَعْلَمُ أَنَّ اللَّهَ عَلَى كُلِّ شَيْءٍ قَدِيرٌ ) . وفي مدينة القدس يوجد قبر يعتقد أنه للعزير .                      ",
    "number-en": "The miracle of Aziz, peace be upon him",
    "label-en": "It is said about him, Uzair, and it is said that he is one of the prophets of God, whom God sent down to the children of Israel. There is another opinion that says that he is a righteous man, and he is one of the rabbis of the children of Israel. It is said that it refers to Levi bin Yaqoul bin Ishaq bin Ibrahim, peace be upon them. Where God Almighty said: (Or like one who passed by a town while it was empty of its thrones. He said, “How can God revive this after its death?” So God caused him to die for a hundred years, then He resurrected him. He said, “How long did you stay?” He said, “You stayed for a day or part of a day.” He said, “Rather, you stayed for a hundred years. So look. And look at your donkey, and let us make you a sign to the people. And look at the bones, how We sharpen them and then clothe them. Flesh, and when it became clear to him, he said, “I know that God has power over all things.” It was mentioned in the Qur’an, in another place, where God Almighty said, “And the Jews said, ‘Uzair is the son of God.’” Here we would like to explain the story of Al-Uzair, that prophet or righteous man who was killed by God. He was one of the children of Israel and God gave him a great deal of knowledge and memorization. The story here says that this righteous man was walking on the back of his donkey, and after he had walked for a period of time, he passed by a village, but this village was empty and there was no one in it. Here he stopped and wondered and said, “Is it possible for God to revive the village while it is empty of its thrones, as stated in Surah Al-Baqarah, where God Almighty said on His tongue ((How)? Allah will revive this woman after her death.) Then God killed him while he was asleep, and he took his soul for a hundred years, then God resurrected him again, and then Al-Uzair woke up from his sleep, so God sent someone to ask him, and the one asking him was an angel of the angels in human form.\n\nHe asked Uzair how long he had stayed asleep, as God Almighty said in His decisive Book (He said, “How long have you stayed?”) Uzair replied to the one who asked him that he stayed for a full day or part of a day, as God Almighty said in Surah Al-Baqarah (He said, “I stayed a day or part of a day.”) So the answer was that he stayed for a short period. To you, the angel who asked him replied that he remained dead for a full hundred years, as God Almighty said in His Book (He said, “Rather, you remained dead for a hundred years”) (And look at the bones, how We raise them up, then cover them with flesh.) So from the previous verses we know that he died for a hundred years, and God resurrected him again. To make him a sign for the people, as God Almighty said in the Holy Qur’an (And We will make you a sign for the people). Then Uzair knew that God was able to cause him to die, revive him, and revive the village that was empty of its thrones (when it became clear to him, he said, “I know that God has power over all things”). Then he went out to the village and found it old enough for man, and he began to wander around it. While he was walking around the village, he asked about Uzair, and the people said to him, “Yes, we know him. God put him to death a hundred years ago.” Then he said to them, “I am Uzair. God has given me life again.” Then he began to teach the people the Torah again and renew it for them. Then they sanctified him and claimed in vain that he was the Son of God, as God Almighty said in His decisive Book (And The Jews swore to Uzair, the son of God.) This is contrary to our true religion, which described Uzair as a righteous man whom God caused to die for a hundred years so that he would be a sign to the people of the power of God Almighty. God will revive this woman after her death. So God caused him to die for a hundred years, then resurrected him. He said, “How long did you stay?” He said, “I stayed for a day or part of a day.” He said, “Rather.” You lived for a hundred years, and look at your food and drink, they have not aged, and look at how Mark, and let us make you a sign to the people, and look at the bones, how We splinter them, then cover them with flesh. When it became clear to him, he said, “I know that God is over all things.” A mighty thing.) In the city of Jerusalem there is a grave believed to be that of Uzair."
  },
  {
    "number": "معجزة صالح عليه السلام ",
    "text": "",
    "label": "أيّد الله سبحانه و تعالى أنبياءه بالآيات و المعجزات و هي أمورٌ خارقةٌ للعادة ، فكانت معجزة النّبيّ موسى عليه السّلام العصا التي تحولت إلى ثعبانٍ مبينٍ و اليد التي تصبح بيضاء منيرةً ، و كانت معجزة سيّدنا عيسى علاج المرضى و ذوي الأسقام و إحياء الموتى بإذن الله تعالى ، و كانت معجزة سيّدنا محمّد عليه الصّلاة و السّلام وحياً و هو كتاب الله القرآن الكريم ، المعجز ببيانه و ألفاظه و تحدّى الله فيه الإنس و الجنّ أن يأتوا بسورةٍ من مثله . ومن بين الأنبياء الذين أكرمهم الله و أيّدهم بالمعجزات النّبيّ صالح عليه السّلام ، فقد بعثه الله إلى قومٍ كفروا بالله و عبدوا الأصنام و اغترّوا بقوتهم و ما منحهم الله إياه من العافية و القوّة في الجسم ، فقد كانوا من شدّتهم ينحتون في الجبال بيوتاً يتّخذونها سكنٌ لهم ، فجاءهم سيّدنا صالح يذكّرهم بالله و أن يعبدوه وحده و لا يشركوا به شيئاً.\n\nفالله هو الذي استخلفهم في الأرض و أكرمهم بنعمه الجمّة فكيف يعبدوا غيره و كيف يجحدوا نعمه ، و لم ييأس سيّدنا صالح من دعوتهم ليلاً و نهاراً و هم يجادلونه بالباطل و يجاهرون بالمعاصي و يظهرون له الشّكّ في دين التّوحيد الذي أتى به ، حجّتهم الدّاحضة كيف نترك ما كان يعبد آباؤنا ، و قد حاولوا استمالته إليهم بقولهم إنّك كنت ذو شأنٍ و مكانةٍ عندنا فلا تضيّع مكانتك بما تدعون إليه ، و طلبوا من سيّدنا صالح عليه السّلام أن يأتيهم بمعجزةٍ من عند الله إمعاناً في الضلال و استكبارا ، خشي سيّدنا صالح من ذلك فهو يعلم أنّه إذا نزلت معجزة الله و لم يؤمنوا بها عذّبهم الله ، لكن أمام إلحاحهم لبّى طلبهم و دعا الله أن ينزّل معجزةً من عنده ، فأخرج الله سبحانه ناقةً من صخرةٍ صماءٍ في جبل فكانت آيةً عجباً ، و عندما رأوها لم يزيدهم ذلك إلا ضلالاً و تكذيباً ، فجمع سيّدنا صالح من آمن معه و عزم على الرّحيل فقد حان أمر الله ، و هتف في القوم أن تمتّعوا في دياركم ثلاثة أيّام بوعدٍ غير مكذوبٍ ، و عند انقضاء المهلة أتى عذاب الله فحلّت الصّيحة بهم فإذا هم خامدون هالكون .                      ",
    "number-en": "The miracle of Saleh, peace be upon him",
    "label-en": "God Almighty supported His prophets with signs and miracles, which are extraordinary things. The miracle of the Prophet Moses, peace be upon him, was the stick that turned into a visible snake and the hand that became luminous white. The miracle of our Master Jesus was treating the sick and those with diseases and reviving the dead, God Almighty willing. The miracle of our Master Muhammad, may God’s prayers and peace be upon him, was that he was alive and alive. It is the Book of God, the Noble Qur’an, which is miraculous in its clarification and words, and in it God challenged mankind and the jinn to produce a surah like it. Among the prophets whom God honored and supported with miracles was the Prophet Saleh, peace be upon him. God sent him to a people who disbelieved in God and worshiped idols and were deceived by their own strength and what God had granted them in terms of health and strength in the body. Because of their distress, they were carving houses in the mountains to take as their residence, so our Master Saleh came to them reminding them of God and that they should worship Him alone and not They associate something with Him.\n\nIt is God who appointed them as successors on earth and honored them with His great blessings, so how can they worship other than Him and how can they deny His blessings? And our Master Salih did not despair of their supplication day and night while they argued with him in falsehood and openly committed sins and showed him doubt in the religion of monotheism that he brought. Their refuting argument is how can we abandon what our fathers worshiped, and they tried to win him over to them by saying: You were of great importance and status with us, so do not waste your position with what you are calling for. They asked our Master Saleh, peace be upon him, to bring them a miracle from God out of further misguidance and arrogance. Our Master Saleh was afraid of that, as he knew that if God’s miracle descended and they did not believe in it, God would punish them. But in the face of their insistence, he granted their request and called on God to send down a miracle from Him, so God brought it out. Glory be to Him, a she-camel from a solid rock in a mountain was a wondrous sign, and when they saw it, it only increased their misguidance and denial. So our master Salih gathered those who believed with him and decided to leave, for God’s command had come, and he shouted to the people to enjoy three days in your homes with a promise that is not false, and when the deadline had passed, the punishment of God came, so the cry came upon them, and they were silent. Perished."
  },
  {
    "number": "معجزة سليمان عليه السلام ",
    "text": "",
    "label": "سليمان –عليه السلام- هو نبي كريم، وحو أحد الملوك العظماء على مر الزمان والمكان، فما كان منه –عليه السلام- وما وهبه الله إياه أعظم من أن يوصف في بضع كلمات، هو ابن النبي الكريم دواد –عليه السلام-، هو من بني اسرائيل، وهو ملكهم، تواجد في التراثين المسيحي واليهودي على أنه ملك عظيم له من الحكمة والعقل الراجح والملك ما ليس لأحد، وقد ذكر في القرآن الكريم والتراث الإسلامي في عدة مواضع، بأنه كان واحداً من أعظم الملوك والأنبياء الذين مروا على تاريخ البشرية، ولقد ذكر القرآن أباه النبي الكريم دواد –عليه السلام- في قصص ومواضع تدل على عظمة هؤلاء الأشخاص، ومدى الحكمة والعمق الذين كانوا يتمتعون بهم، فقد استحقوا بصفاتهم هذه أن يكونوا من أعظم الناس، وقدوة للبشر من بعدهم.\n\n وفي الحقيقة فإن أهم ما يميز الرسالات السماوية هو ارتباطها الوثيق في الأنبياء والرسل، فهم يمثلون بالنسبة لأتباعهم الطريق الذي يجب أن يسلكونه لأنهم بشر أقرب إلى الكمال، وما قاموا به يستطيع البشر العاديون إن وجدت النية القيام به، ما عدا الأشياء والإمكانيات التي تفوق القدرات البشرية والتي هي خصائص ميزهم الله بها عن سائر بني آدم. ومن جهة أخرى فأتباع الديانات السماوية يمثلون السواد الأعظم اليوم، وهم مجبرون عقدياً بالتصديق بوجود هؤلاء العظام، وبالتالي فحتى لو اختلفت العقائد والشعائر بين الديانات، تبقى القواسم المشتركة بين الناس أكبر من أن تعد أو أن تحصى.\n\nأما فيما يتعلق بسليمان –عليه السلام-، فلقد عاش في فلسطين في القدس الشريف، وحكم دولته من هناك، وإذا أردنا أن نحدد معجزة معينة اختص بها، فنستيطع القول بأن حياته كلها معجزة، لأن قدراته وإماكنياته أكبر وأعظم من أن توصف، فلقد علمه الله عز وجل منطق الطير والحيوانات وسخرها له، فقصته من النملة وسماعه لتحذيراتها لباقي النمل لا تخلو من الإعجاز، وقصته مع الهدهد أيضاً، بالإضافة إلى أن الله سخر له الجن لأمره، فهو قد كان يدير أعظم مملكة وأضخم جيش، جيش لا يوجد له مثيل إطلاقاً، وقصته أيضاً مع ملكة سبأ بلقيس معروفة، وكيف نقل لها عرشها عبر الجن من مملكتها في سبأ إلى مملكته. إن سليمان هو مثال حي على قدرة الله عز وجل، فهو المعطي بلا حدود، فالعطاء الذي أعطيه سليمان لا يمكن لعقل بشري استيعابها خصوصاً إذا عاش بعده بآلاف السنين، مما دفع البعض بالقول إن قصته هي قصة من نسج الخيال.                      ",
    "number-en": "The miracle of Solomon, peace be upon him",
    "label-en": "Solomon - peace be upon him - is a noble prophet, and one of the great kings throughout time and space. What he - peace be upon him - and what God gave him was too great to be described in a few words. He is the son of the honorable Prophet Dawad - peace be upon him. He is one of the children of Israel, and he is their king. He was present in the Christian and Jewish heritage as a great king with wisdom, a sound mind, and a king like no one else. He was mentioned in the Holy Qur’an and the Islamic heritage in several places, that he was one of the greatest. The kings and prophets who passed through the history of humanity. The Qur’an mentioned his father, the Noble Prophet Dawad - peace be upon him - in stories and places that indicate the greatness of these people, and the extent of wisdom and depth that they possessed. With these qualities, they deserved to be among the greatest people and role models for humans after them.\n\n In fact, the most important thing that distinguishes the heavenly messages is their close connection with the prophets and messengers. For their followers, they represent the path that they must follow because they are human beings closer to perfection, and what they have done can be done by ordinary human beings if there is the intention to do, with the exception of the things and capabilities that exceed human capabilities and which are characteristics by which God distinguished them from the rest of the sons of Adam. On the other hand, the followers of the heavenly religions represent the great majority today, and they are ideologically obliged to believe in the existence of these great people. Therefore, even if the beliefs and rituals differ between the religions, the commonalities between the people remain too great to enumerate.\n\nAs for Solomon - peace be upon him - he lived in Palestine in Al-Quds Al-Sharif, and ruled his state from there, and if we want to identify a specific miracle that was unique to him, we can say that his entire life is a miracle, because his abilities and capabilities are greater and greater than they can be described. God Almighty taught him the logic of birds and animals and subjected them to him. His story of the ant and his listening to its warnings to the other ants is not devoid of miracles, and his story With the hoopoe as well, in addition to the fact that God subjected the jinn to his command, he ran the greatest kingdom and the largest army, an army that had no equal at all, and his story with the Queen of Sheba, Bilqis, is well known, and how he transferred her throne to her through the jinn from her kingdom in Sheba to his kingdom. Solomon is a living example of the power of God Almighty, as he is a giver without limits. The gifts that Solomon gave cannot be comprehended by the human mind, especially if he lived thousands of years after him, which prompted some to say that his story is a story of imagination."
  },
  {
    "number": "معجزة موسى عليه السلام ",
    "text": "",
    "label": "أيد الله-سبحانه وتعالى- النبي موسى بالعديد من المعجزات التي قام بها؛ ليثبت لفرعون وبني إسرائيل أن رسالته لم تكن لأجل نفسه، أو كانت أحد أنواع السحر والشعوذة، كما أراد أن يثبت فرعون لقومه وبني إسرائيل، واختلف العلماء في عدد هذه المعجزات ولكن الراجح أنها تسع معجزات كما أخبر ابن كثير، وهذه المعجزات كالآتي: المعجزة الأولى: معجزة اليد البيضاء، حينما أمر الله النبي موسى بالتوجه إلى فرعون وإخراجه من عبادة الضلال والعباد إلى النور وعبادة رب العباد، أراد فرعون بعض المعجزات التي تدل على أن هذه الدعوة من الله وليست أحد أنواع السحر والشعوذة، فأخرج موسى يده من جيبه وكانت بيضاء فاقعة البياض من غير وجود نوع من أنواع الأمراض الجلدية المنتشرة في ذلك الوقت مثل (البرص).\n\nالمعجزة الثانية:(معجزة العصا)، عندما أخرج النبي موسى يده البيضاء من جيبه أمام فرعون مصر، أراد فرعون المزيد من الدلائل على صدق هذه النبوة التي جاء بها موسى، فقام النبي بإلقاء العصا التي كانت في يده، فتحولت إلى حية عظيمة هائجة، مما زاد من تعجب الفرعون، ولكن العناد والغرور الذي كان أحد الصفات الرئيسية في قلب فرعون تملكه وقام باتهام النبي موسى بالشعوذة والسحر من جديد. المعجزة الثالثة:(معجزة الطوفان)، حينما كفر فرعون بالهداية التي جاء بها موسى، أمر الله نهر النيل أن يفيض على فرعون وقومه الذين كفروا معه، وقد أصاب هذا الطوفان فرعون وجنوده بالكثير من العذاب والألم. المعجزة الرابعة:(معجزة سنين القحط)، حيث أصاب فرعون وقومه الكثير من سنين القحط الشديدة، بسبب انحباس ماء الأمطار عن النزول مما أدى إلى قلة المياه في نهر النيل. المعجزة الخامسة:(معجزة الجراد)، حيث أرسل الله -سبحانه وتعالى- الجراد على فرعون وقومه، حيث قام هذا الجراد بإتلاف المزروعات والأشجار الخضراء التي كان يزرعها فرعون وقومه. المعجزة السادسة:(معجزة الُقمّل)، حيث أرسل الله هذه الحشرة الصغيرة على فرعون وقومه الكافرين، مما أدى إلى حدوث الكثير من الأمور السيئة لهؤلاء الكافرين فقد كانوا يجدون هذه الحشرة في ملابسهم وفراشهم وحتى في الطعام الذي يتناولونه.\n\nالمعجزة السابعة:(معجزة الدم)، حيث كان فرعون وقومه الكافرون يجدون الدم في كل شيءٍ يشربونه، بحيث كان الرجل يسكب الماء في الكأس، يكون صافياً نقيًاً، وحينما يرفعه ليشربه يصبح مليئاً بالدماء ذات اللون الأحمر. المعجزة الثامنة:(معجزة الضفادع)، كانوا يجدونها في ملابسهم وفراشهم، في شوارعهم وبيوتهم، ولم يستطيعوا أن يذوقوا طعم النوم المريح؛ بسبب أصواتها المرتفعة التي كانت تؤرقهم وتبث الرعب في نفوسهم. المعجزة التاسعة:(معجزة فلق البحر إلى نصفين)، وكانت هذه هي أحد المعجزات العظيمة في حياة النبي موسى، وهناك بعض العلماء يعتبرها المعجزة الثانية بعد القراّن الكريم، حيث حينما هرب بنو إسرائيل من فرعون وجنوده، لحِقَ بهم فرعون مع جيشه الجرار، حتى يقتلهم وينكل فيهم، وحينما وصلوا إلى البحر الأحمر أمر الله -سبحانه وتعالى- موسى بأن يضرب البحر بعصاه، مما أدى إلى فلق البحر إلى نصفين، وحينما حاول فرعون وجيشه اللَّحاق بهم أمر الله البحر أن يرجع لسابق عهده، وغرق فرعون وجنوده في هذا البحر العظيم.                      ",
    "number-en": "The miracle of Moses, peace be upon him",
    "label-en": "God Almighty supported the Prophet Moses with many of the miracles he performed. To prove to Pharaoh and the Children of Israel that his message was not for himself, or was one of the types of magic and sorcery, as Pharaoh wanted to prove to his people and the Children of Israel. Scholars differed in the number of these miracles, but the most likely is that they are nine miracles as told by Ibn Kathir, and these miracles are as follows: The first miracle: The miracle of the white hand, when God commanded the Prophet Moses to turn to Pharaoh and bring him out of the worship of misguidance and servants to the light and the worship of the Lord of servants. Pharaoh wanted some miracles that This indicates that this call is from God and is not one of the types of magic and sorcery, so Moses took his hand out of his pocket and it was bright white without the presence of any type of skin disease widespread at that time such as (leprosy).\n\nThe second miracle: (The miracle of the stick), when the Prophet Moses took his white hand out of his pocket in front of the Pharaoh of Egypt. Pharaoh wanted more evidence of the truth of this prophecy that Moses had brought, so the Prophet threw the stick that was in his hand, and it turned into a great raging serpent, which increased the Pharaoh’s astonishment, but stubbornness and arrogance, which was one of the main characteristics in Pharaoh’s heart, took possession of him and he accused the Prophet Moses of sorcery and magic again. The third miracle: (The miracle of the flood), when Pharaoh disbelieved in the guidance that Moses brought, God commanded the Nile River to overflow on Pharaoh and his people who disbelieved with him, and this flood afflicted Pharaoh and his soldiers with a lot of torment and pain. The fourth miracle: (The miracle of the years of drought), where Pharaoh and his people suffered many years of severe drought, due to the retention of rain water from falling, which led to a scarcity of water in the Nile River. The fifth miracle: (the miracle of the locusts), where God - Glory be to Him - sent locusts to Pharaoh and his people, as these locusts destroyed the crops and green trees that Pharaoh and his people were planting. The sixth miracle: (The miracle of lice), where God sent this small insect to Pharaoh and his unbelieving people, which led to many bad things happening to these unbelievers. They used to find this insect in their clothes, their bedding, and even in the food they ate.\n\nThe seventh miracle: (The miracle of blood), where Pharaoh and his unbelieving people found blood in everything they drank, so that a man would pour water into a cup, it would be clear and pure, and when he raised it to drink it it would become full of red blood. The eighth miracle: (The miracle of frogs), they used to find them in their clothes and beds, in their streets and homes, and they were not able to taste comfortable sleep; Because of its loud voices, which were disturbing them and terrifying them. The ninth miracle: (The miracle of splitting the sea into two halves), and this was one of the great miracles in the life of the Prophet Moses, and some scholars consider it the second miracle after the Holy Qur’an, as when the children of Israel fled from Pharaoh and his soldiers, Pharaoh followed them with his mighty army, until he killed them and tortured them, and when they reached the Red Sea, God - Glory be to Him - commanded Moses to strike the sea with his staff, which led to the sea splitting into two halves, and when Pharaoh and his army tried to catch up with them. God commanded the sea to return to its previous state, and Pharaoh and his soldiers drowned in this great sea."
  },
  {
    "number": "معجزة أيوب عليه السلام ",
    "text": "",
    "label": "لقد أنعم الله سبحانه وتعالى على أيوب عليه السلام بالعديد من النعم ، فقد أتاه الله مالاً كثيراً إذ كانت له تجارة كبيرة ، وكان يمتلك العديد من المواشي ، كما رزقه الله الكثير من الأهل والأولاد. وكان أيوب يحب الناس ويحب التصدق لهم فأحبه الناس إلا أن الله ابتلاه بلاءاً شديداً\nفمات كل أولاده وضاع كل ماله كما أصيب في كل أعضاء جسده ولم يبقى سوى قلبه ولسانه ليذكر الله بهما. وعلى الرغم من كل هذا البلاء إلا أنه كان صابراً محتسباً مداوماً على ذكر الله ليلاً ونهاراً ، ” نعم العبد إنه أواب”.\n \nظل أيوب عليه السلام فترة طويلة يعاني من المرض ولم يكن بجانبه أحد فقد تخلى عنه الناس إلا زوجته التي ظلت بجانبه ترعاه و تساعده على قضاء حوائجه. وعندما قل المال معها اضطرت لأن تقوم بخدمة الناس مقابل الأجر، ولكن الناس لم يتركوها و شأنها فطلبت من زوجها \nأن يدعو ربه. هنا دعا أيوب ربه أن يزيل عنه البلاء فقال : ” أني مسني الضر وأنت أرحم الراحمين “. فاستجاب له الله وأمره أن يضرب الأرض بقدمه فما كان من أيوب إلا طاعة ربه.\n\nو عندما مس الأرض بقدمه ، انبثق منها ماءاً عذباً. و بمجرد أن شرب أيوب من الماء برىء ما كان في جسده من مرض و استعاد أيوب صحته وعافيته و أصبح أفضل مما كان عليه قبل ذلك و كأنه لم يكن به مرض. عندما عاد أيوب إلى زوجته وهو ملىء بالنشاط والحيوية لم \nتعرفه و سألته عن زوجها فقص لها أيوب عليه السلام ما حدث له. وعندما عرفت ما حدث في هذه الفترة الوجيزة كانت فرحتها شديدة حيث رأت نعمة الله على زوجها الذي رد الله إليه صحته وعافيته.                      ",
    "number-en": "The miracle of Job, peace be upon him",
    "label-en": "God Almighty blessed Job, peace be upon him, with many blessings. God gave him a lot of money, as he had a large trade, and he owned many livestock, and God also blessed him with many family and children. Ayoub loved people and loved to give charity to them, so the people loved him, but God tested him with a severe trial\nAll his children died, all his money was lost, and all parts of his body were injured, leaving only his heart and tongue to remember God with. Despite all this affliction, he was patient and sought reward, constantly remembering God day and night. “How good a servant he is, he is steadfast.”\n \nAyoub, peace be upon him, suffered from illness for a long time, and no one was by his side. People abandoned him except his wife, who remained by his side, taking care of him and helping him meet his needs. When she had little money, she was forced to serve people in exchange for wages, but the people did not leave her alone, so she asked her husband \nTo call upon his Lord. Here Job prayed to his Lord to remove the calamity from him, saying: “Harm has befallen me, and You are the Most Merciful of those who show mercy.” So God responded to him and commanded him to strike the ground with his foot, so Job had no choice but to obey his Lord.\n\nWhen he touched the ground with his foot, fresh water emerged from it. As soon as Ayoub drank the water, the disease in his body was cured, and Ayoub regained his health and well-being, and he became better than he was before, as if he had no disease. When Job returned to his wife, full of energy and vitality, he did not... \nShe knew him and asked him about her husband, so Ayoub, peace be upon him, told her what happened to him. When she learned what had happened in this short period, her joy was intense, as she saw God’s blessing on her husband, to whom God restored his health and well-being."
  },
  {
    "number": "معجزة إبراهيم عليه السلام ",
    "text": "",
    "label": "لا يخلو التاريخ من الأشخاص الذين أسهموا في الإنسانية وتركوا البصمات بطريقة عبقرية إيمانية توحيدية أممية مخلصة فيها اليقين والمحبة والعطف والحنان ومجابهة الباطل وإحقاق الحق، فلقد أسهم كل شخص بتاريخ جماعته وأفراده بطريقة ما، ولكن الصعب بل المستحيل إيجاد شخص أسهم وغير في تاريخ الإنسانية حتى غدا متوافقاً عليه بين غالبية سكان البسيطة إلى عصرنا الحالي. هو بالمقام الأول خليل الرحمن الرسول النبي، هو الموحد ذو القلب الرحيم، هو من يساوي أمة بكاملها، والعجيب أن حياته كلها كانت عبارة عن مواقف لا تخلو من الإبتلاءات والامتحانات التي إن خضع لها شخص آخر لن يستطيع الصمود أمامها، فسوف ينحني وينكسر مباشرة، هو إبراهيم أمة قائمة بذاتها – عليه أفضل الصلاة والسلام -. لا يمكن وصف حياة إبراهيم بأنها حياة عادية بسيطة، وهي ليست قطعاً كحياة الأنبياء، فما تعرض له إبراهيم خلال حياته لم يوجد له مثيل حتى بين خير البرية والأنام الرسل – عليهم الصلاة والسلام-، ولهذا فمن الصعب أيضاً بل من الإجحاف في شخصه الكريم وجنابه العالي المطهر الرفيع، وصفه بأنه صاحب المعجزات الخارقات، لأن مفاصل حياته هي معجزات بحد ذاتها، تسلب ألباب العقلاء كما سلبتهم إلى يومنا هذا.\n\nولو استعرضنا ما مر به هذا النبي من حوارات نفسية عميقة المدلول والمعنى سنجد أنه إلى جانب كونه نبي فهو فيلسوف بعناية إلهية فريدة ذو حجة قاطعة، فحواره مع عباد الآلهة المزيفة بين عباد الشمس والقمر وما فعله بعبدة الأوثان يوصلنا إلى أن شبابه كان معجزة وإسلامه كان معجزة، فأي شاب يستطيع التفوه بمثل ما تفوه به إذا ما أخذنا الظروف التي كانت تحيط به بعين الاعتبار من سلطة قومه وقوتهم، ووحدته هو ومعتقداته بينهم، إلى أن أوصلته هذه المعتقدات إلى معجزة مادية عجيبة وهي عدم جريان خاصية النار الإحراقية عليه عندما ألقوه بها. ولقد أظهر أيضاً تصرفات إعجازية في مواقف أخرى فصبره على عدم الإنجاب وهو بهذه العظمة والشأن هو معجزة، وصبره على ترك الطفل الرضيع وأمه في وسط الصحراء اللاهبة امتثالاً لأمر الله هو معجزة، وخضوعه التام لأمر خالقه عندما أمره بذبح ابنه هو معجزة لا يستطيع العقل البشري استيعابها، فإبراهيم لم يكن بشراً عادياً البتة، إنما كان بشراً من نوع آخر، لا يمكن الإتيان بشبيه له حتى بين أعظم العظماء، ولن نغفل الإعجاز في رحمته وعطفه حتى على المجرمين وهو قوم نبي الله لوط –عليه السلام- وما قد كان منهم من مخالفات صارخة للفطرة الإنسانية.                      ",
    "number-en": "The miracle of Abraham, peace be upon him",
    "label-en": "History is not devoid of people who have contributed to humanity and left their mark in a way of genius, faith, monotheism, sincere internationalism, in which there is certainty, love, kindness, tenderness, confronting falsehood, and achieving truth. Every person has contributed to the history of his group and individuals in some way, but it is difficult or even impossible to find a person who has contributed and changed the history of humanity until it became agreed upon among the majority of the inhabitants of the earth until our present era. He is, in the first place, the friend of the Most Merciful, the Messenger, the Prophet, he is the monotheist with a merciful heart, he is the one who is equal to an entire nation, and what is strange is that his entire life was made up of situations that were not devoid of trials and tests that if another person were subjected to, he would not be able to withstand them, and he would immediately bend and break. He is Abraham, a nation that exists on its own - the best prayers and peace be upon him -. The life of Abraham cannot be described as a simple, ordinary life, and it is certainly not like the life of the prophets. What Abraham was exposed to during his life was not found like it even among the best of creation and the most human of the Messengers - peace and blessings be upon them - and for this reason it is also difficult and even unfair to his honorable person and his exalted, purified and sublime dignity, to describe him as the owner of extraordinary miracles, because the details of his life are miracles in and of themselves, stealing away the hearts of rational people just as they have robbed them to this day.\n\nIf we review the deep psychological conversations that this Prophet went through, we will find that in addition to being a prophet, he is a philosopher with unique divine care and a decisive argument. His dialogue with the worshipers of false gods between the sunflowers and the moon, and what he did to the idol worshipers, brings us to the conclusion that his youth was a miracle and his Islam was a miracle. Any young man could utter something like what he uttered if we take into account the circumstances that surrounded him, including the authority and strength of his people, and his unity. He and his beliefs were among them, until these beliefs led him to a strange physical miracle, which was that the burning property of fire did not flow on him when they threw it at him. He also showed miraculous behavior in other situations. His patience in not having children while he was of such greatness and status is a miracle, and his patience in leaving the infant and his mother in the middle of the burning desert in compliance with God’s command is a miracle, and his complete submission to the command of his Creator when he commanded him to slaughter his son is a miracle that the human mind cannot comprehend. Abraham was not an ordinary human being at all, but rather a human being of another kind, whose likeness cannot be created even among the greatest of greats. We will not ignore the miraculous nature of his mercy and compassion, even toward criminals, the people of God’s Prophet Lot - peace be upon him - and the blatant violations of human nature that some of them committed."
  },
  {
    "number": "معجزة هود عليه السلام ",
    "text": "",
    "label": "بعث الله سبحانه و تعالى رسلاً إلى خلقه ليبلّغوا النّاس دين التّوحيد فيكون ذلك حجّة على الخلق حين يقفون بين يدي الله ليحاسبهم على أعمالهم ، و قد أنزل الله سبحانه على رسله كتباً و شرائع تبيّن للنّاس طريقهم و تهديهم سبيلهم ، و قد ذكر الله سبحانه و تعالى في محكم التّنزيل قصصاً عن الأقوام السّابقة الذين رفضوا دين التّوحيد و أصّروا على الباطل فعبدوا الأصنام و أرتكبوا المنكرات و جحدوا الرّسل ، و كان من بين هؤلاء قوم عادٍ الذين أرسل الله سبحانه و تعالى لهم نبيّه هوداً ليدعوهم إلى دين الله و عدم الإشراك به ، فما هي صفة هؤلاء القوم ؟ و ما كان موقفهم اتجاه رسولهم ؟ و ما هو العذاب الذي حلّ بهم ؟ .\n\nكان قوم عاد من القبائل العربيّة البائدة التي سكنت منطقة سمّيت بالأحقاف في جنوب شبه الجزيرة العربيّة ، و قد استوطنوا تلك المنطقة و بنوا فيها المباني الشّاهقة مستغلّين ما منحهم الله إيّاه من القوّة الجسديّة ، و بدل أن يستخدموها في طاعة الله سبحانه و إعمار الأرض راحوا يعبثون في غيّهم و ضلالهم و يتنافسون في البنيان و صنعته و في ظنّهم أنّهم خالدون على وجه الأرض و مادروا أنّه لو دامت الدّنيا لغيرهم ما وصلت إليهم ، و قد وصف الله مدينتهم إرم ذات العماد الشّاهقة التي لم يخلق لها مثيل و لا شبيه في بلاد الله آنذاك ، و لمّا جاءهم هودٌ يدعوهم إلى عبادة الله وحده من بعد أن اتخذوا الأصنام ما كان جواب قومه إلا قولهم أنّا وجدنا آباءنا على ما نحن عليه و إنّا على آثارهم مقتدون ، فأصرّ القوم على الكفر و استكبروا و رفضوا دعوة نبيّهم للتّوحيد ، فخوّفهم هودٌ بالله تعالى و بطشه و ذكّرهم بنعمه عليهم و ما منحهم إيّاه من الخير و القوّة في الجسد و الاستخلاف في الأرض من بعد قوم نوح ، فما زادهم هذا التّذكير إلا تكذيباً و عتوّاً ، فتولّى عنهم هوداً متأسّفاً لما سيحلّ بهم من عذاب الله و بطشه بالظّالمين ، و بينما كان القوم يتقلّبون في ضلالاتهم و متعهم الزّائفة إذا هم يرون سحاباً يأتي من بعيدٍ مقبلٍ عليهم فيتوهّمون أنّه خيرٌ قد ساقه الله لهم ، و ما علم القوم بأنّ هذه الرّيح العقيم ما هي إلا عذابٌ شديدٌ قد أعدّه الله لهم عقاباً على كفرهم ، و نجى الله هوداً و الذين آمنوا معه من خزي ذلك اليوم و شملهم برحمته .                      ",
    "number-en": "The miracle of Hood, peace be upon him",
    "label-en": "God Almighty sent messengers to His creation to convey to the people the religion of monotheism, so that would be a proof for the creation when they stand before God to hold them accountable for their deeds. God Almighty sent down to His messengers books and laws that made clear to the people their path and guided them to their path. God Almighty mentioned in the decisive revelation stories about the previous peoples who refused. The religion of monotheism, and they insisted on falsehood, so they worshiped idols, committed evil deeds, and denied the messengers. Among these were the people of Aad, to whom God Almighty sent His Prophet Hud to call them to the religion of God and not to associate partners with it. What is the character of these people? What was their position towards their Messenger? What was the torment that befell them? .\n\nThe people of Aad were one of the defunct Arab tribes that inhabited an area called Al-Ahqaf in the south of the Arabian Peninsula. They settled in that area and built high-rise buildings there, taking advantage of the physical strength that God had given them. Instead of using it to obey God Almighty and populate the earth, they began to mess around in their error and misguidance, competing in construction, its workmanship, and their assumptions. That they would live forever on the face of the earth, and they did not realize that if the world had lasted for others, it would not have reached them. And God described their city of Iram with its towering pillars, the likes of which had not been created in the lands of God at that time. And when the Jews came to them calling on them to worship God alone after they had adopted idols, the answer of his people was nothing but their saying, “We found our fathers as we are, and we are following in their footsteps,” so the people insisted on disbelief. They were arrogant and rejected their Prophet’s call for monotheism, so Hud frightened them of God Almighty and His oppression, and reminded them of His blessings upon them and the goodness and strength He had bestowed on them in the body and succession in the land after the people of Noah. This reminder only increased their denial and arrogance, so Hud turned away from them, regretting what would befall them of God’s punishment and oppression. With the oppressors, and while the people were tossing and turning in their misguidance and false pleasures, they saw a cloud coming from afar approaching them, and they imagined that it was good that God had bestowed on them. And the people did not know that this sterile wind was nothing but a severe torment that God had prepared for them as a punishment for their disbelief, and God saved Hud and those who believed with him from the shame of that day and included them in His mercy. ."
  },
  {
    "number": "معجزة لوط عليه السلام ",
    "text": "",
    "label": "لقد اشتهر قوم لوط بصفةٍ ذميمة وعادات سيّئة عدلوا فيها عن فطرة الله سبحانه وتعالى للبشر حيث كانوا يأتون الذّكران من العالمين ويدعون نساءهم، كما كانوا يفعلون المنكر والفواحش في نواديهم ويجهرون بها ويتفاخرون، وقد وقف نبي الله لوط عليه السّلام فيهم ناصحاً ومذكّراً، وقد أنذرهم عذاب الله وغضبه على من يعمل مثل عملهم، وعلى الرّغم من النّداءات المتكرّرة للوط عليه السّلام إلاّ أنّها لم تجد آذاناً صاغية لدى قومه بل كان جوابهم أن أخرجوا آل لوط من قريتكم إنّهم أناس يتطهّرون، وقد كان لوط عليه السّلام ضعيفاً فيهم وبدون رهط يحمونه حتّى أنّه تمنّى لو أنّ له قوّة يحتمي بها من قومه. لقد شاء الله سبحانه أن يرسل الملائكة رسلاً إلى إبراهيم ولوط عليه السّلام، فمرّوا أولاً على إبراهيم وبشّروه باسحق ولداً من امرأته العقيم.\n\nكما بشّروه بهلاك قوم لوط المجرمين، فقال لهم إبراهيم أنّ القرية فيها لوطاً ومن آمن معه فأخبرته الملائكة أنّها سوف تنجّيهم بأمر الله تعالى، وقد جاءت الملائكة إلى لوط عليه السّلام وأخبرته بأنّ يخرج بأهله ومن آمن معه ليلاً وأن لا يلتفت منهم أحد إلا امرأته فإنّه سوف يحلّ عليها العذاب مع قومها لخيانتها زوجها حين دلّت قومها على خبر ضيف لوط، وعندما خرج لوط وأهله ومن آمن معه من القرية أمر الله سبحانه جبريل عليه السّلام أن يحمل تلك القرية فيرفعه،ا ثمّ يقلبها رأساً على عقب فجعل الله عاليها سافلها، ثمّ أمطر عليهم حجارةٍ من سجيل منضود زيادةً في العذاب والنّكال لما أتوه من الكفر والعصيان.                      ",
    "number-en": "The miracle of Lot, peace be upon him",
    "label-en": "The people of Lot were known for their reprehensible character and bad customs in which they deviated from the nature of God Almighty for human beings. They used to bring males from among the worlds and invite their women, just as they used to do evil and indecency in their clubs and openly do so and brag about it. The Prophet of God Lot, peace be upon him, stood among them advising and reminding them, and he warned them of the punishment and wrath of God against those who did the same as they did, and despite The repeated calls of Lot, peace be upon him, did not find deaf ears among his people. Rather, their answer was to expel the family of Lot from your village. They are people who purify themselves. Lot, peace be upon him, was weak among them and without a group to protect him, to the point that he wished he had strength to protect him from his people. God Almighty wanted to send the angels as messengers to Abraham and Lot, peace be upon him, so they first passed by Abraham and gave him the good news that Isaac would be born from his barren wife.\n\nThey also gave him the good news of the destruction of the criminal people of Lot, so Abraham told them that the town contained Lot and those who believed with him, so the angels told him that they would save them by the command of God Almighty. The angels came to Lot, peace be upon him, and told him to go out with his family and those who believed with him at night and that none of them should turn around except his wife, for torment would befall her along with her people for betraying her husband when she informed her people of the news of Lot’s guest, and when Lot went out And his family and those who believed with him from the village. God Almighty commanded Gabriel, peace be upon him, to carry that village and raise it up, then turn it upside down, so God made its high part its lowest, then rained down on them stones of compressed clay, adding to the torment and punishment for the disbelief and disobedience they had inflicted on them."
  }
]