[
  {
    "number": "ثلاثون نصيحة في رمضان ",
    "text": "",
    "label": "1 - احرص على أن يكون هذا الشهر المبارك نقطة محاسبة وتقويم لأعمالك ومراجعة وتصحيح لحياتك. \n 2 - احرص على المحافظة على صلاة التراويح جماعة، فقد قال صلى الله عليه وسلم: « من صلى مع الإمام حتى ينصرف كتب له قيام ليلة». \n 3 - احذر من الإسراف في المال وغيره فالإسراف محرم ويقلل من حظك في الصدقات التي تؤجر عليها. \n 4 - اعقد العزم على الاستمرار بعد رمضان على ما اعتدت عليه فيه \n 5 - اعتبر بمضي الزمان وتتابع الأحوال على انقضاء العمر. \n 6 - إن هذا الشهر هو شهر عبادة وعمل وليس نوم وكسل. \n 7 - عود لسانك على دوام الذكر ولا تكن من الذين لا يذكرون الله إلا قليلا. \n 8 - عند شعورك بالجوع تذكر أنك ضعيف ولا تستغني عن الطعام وغيره من نعم الله. \n 9 - انتهز فرصة هذا الشهر للامتناع الدائم عن تعاطي مالا ينفعك بل يضرك. \n 10 - اعلم أن العمل أمانة فحاسب نفسك هل أداءه كما ينبغي. \n 11 - سارع إلى طلب العفو ممن ظلمته قبل أن يأخذ من حسناتك. \n 12 - احرص على أن تفطر صائما فيصير لك مثل أجره. \n 13 - اعلم أن الله أكرم الأكرمين وأرحم الراحمين ويقبل التوبة من التائبين وهو سبحانه شديد العقاب يمهل ولا يهمل. \n 14 - إذا فعلت معصية وسترك الله سبحانه وتعالى فأعلم أنه إنذار لك لتتوب فسارع للتوبة واعقد العزم على عدم العودة لتلك المعصية. \n 15 - اعلم أن الله سبحانه تعالى أباح لنا الترويح عن النفس بغير الحرام ولكن التمادي وجعل الوقت كله ترويحا يفوت فرصة الاستزادة من الخير. \n 16 - احرص على الاستزادة من معرفة تفسير القرآن، وأحاديث الرسول صلى الله عليه وسلم، والسيرة العطرة، وعلوم الدين. فطلب العلم عبادة. \n 17 - ابتعد عن جلساء السوء واحرص على مصاحبة الأخيار الصالحين. \n 18 - إن الاعتياد على التبكير إلى المساجد يدل على عظيم الشوق والأنس بالعبادة ومناجاة الخالق. \n 19 - احرص على توجيه من تحت إدارتك إلى ما ينفعهم في دينهم فإنهم يقبلون منك أكثر من غيرك. \n 20 - لا تكثر من أصناف الطعام في وجبة الإفطار فهذا يشغل أهل البيت عن الاستفادة من نهار رمضان في قراءة القرآن وغيره من العبادات. \n 21 - قلل من الذهاب إلى الأسواق في ليالي رمضان وخصوصا في آخر الشهر لئلا تضيع عليك تلك الأوقات الثمينة. \n 22 - اعلم أن هذا الشهر المبارك ضيف راحل فأحسن ضيافته فما أسرع ما تذكره إذا ولى. \n 23 - احرص على قيام ليالي العشر الأواخر فهي ليالي فاضلة وفيها ليلة القدر التي هي خير من ألف شهر. \n 24 - اعلم أن يوم العيد يوم شكر للرب فلا تجعله يوم انطلاق مما حبست عنه نفسك في هذا الشهر. \n 25 - تذكر وأنت فرح مسرور بيوم العيد إخوانك اليتامى والثكالى والمعدمين واعلم أن من فضلك عليهم قادر على أن يبدل هذا الحال فسارع إلى شكر النعم ومواساتهم. \n 26 - احذر من الفطر دون عذر فإن من أفطر يوما من رمضان لم يقضه صوم الدهر كله ولو صامه. \n 27 - اجعل لنفسك نصيبا ولو يسيرا من الاعتكاف. \n 28 - يحسن الجهر بالتكبير ليلة العيد ويومه إلى أداء الصلاة. \n 29 - اجعل لنفسك نصيبا من صوم التطوع ولا يكن عهدك بالصيام في رمضان فقط. \n 30 - حاسب نفسك في جميع أمورك ومنها : المحافظة على الصلاة جماعة - الزكاة - صلة الأرحام - بر الو الدين - تفقد الجيران - الصفح عمن بينك وبينه شحناء - عدم الإسراف - تربية من تحت يديك - الاهتمام بأمور إخوانك المسلمين - عدم صرف شيء مما وليت عليه لفائدة نفسك - استجابتك وفرحك بالنصح - الحذر من الرياء - حبك لأخيك ما تحب لنفسك - سعيك بالإصلاح - عدم غيبة إخوانك - تلاوة القرآن وتدبر معانيه - الخشوع عند سماعه. \n\n هذا وصلى الله وسلم على نبينا محمد وآله وصحبه أجمعين.",
    "number-en": "Thirty tips for Ramadan",
    "label-en": "1 - Make sure that this blessed month is a point of accountability, evaluation of your actions, and review and correction of your life. \n 2 - Make sure to perform the Tarawih prayer in congregation, as the Prophet, peace and blessings of God be upon him, said: “Whoever prays with the imam until he finishes, it will be recorded for him that he spent the night in prayer.” \n 3 - Beware of extravagance in money and other things, as extravagance is forbidden and reduces your share in the charity that you are rewarded for. \n 4 - Resolve to continue after Ramadan with what you are accustomed to during it \n 5 - The passage of time and the progression of circumstances take into account the expiration of life. \n 6 - This month is a month of worship and work, not sleep and laziness. \n 7 - Accustom your tongue to constant remembrance, and do not be among those who do not remember God except a little. \n 8 - When you feel hungry, remember that you are weak and do not do without food and other blessings from God. \n 9 - Take advantage of this month to permanently abstain from using what does not benefit you, but rather harms you. \n 10 - Know that work is a trust, so hold yourself accountable for performing it as it should. \n 11 - Be quick to ask for forgiveness from those you wronged before they take away your good deeds. \n 12 - Make sure that you break the fast of a fasting person, so that you will receive his reward. \n 13 - Know that God is the most generous of the generous, the most merciful of the merciful, and accepts repentance from those who repent, and He, Glory be to Him, is severe in punishment, granting respite and not neglecting. \n 14 - If you commit a sin and God Almighty protects you, know that it is a warning to you to repent, so hasten to repent and resolve not to return to that sin. \n 15 - Know that God Almighty has permitted us to entertain ourselves in ways other than what is forbidden, but going too far and making the whole time recreational misses the opportunity to gain more goodness. \n 16 - Strive to increase your knowledge of the interpretation of the Qur’an, the hadiths of the Messenger, may God bless him and grant him peace, the fragrant biography, and religious sciences. Seeking knowledge is worship. \n 17- Stay away from bad people and be sure to keep company with good people. \n 18 - Getting used to arriving early to the mosques indicates great longing and familiarity with worship and monologue with the Creator. \n 19 - Make sure to direct those under your management to what will benefit them in their religion, as they accept you more than others. \n 20 - Do not eat too many types of food at breakfast, as this will distract the family from benefiting from the day in Ramadan by reading the Qur’an and other acts of worship. \n 21 - Reduce going to the markets during the nights of Ramadan, especially at the end of the month, so as not to waste those precious times. \n 22 - Know that this blessed month is a departing guest, so give him good hospitality, so how quickly will you remember him when he passes. \n 23 - Make sure to pray the last ten nights, for they are virtuous nights, and in them is Laylat al-Qadr, which is better than a thousand months. \n 24 - Know that the day of Eid is a day of thanksgiving to the Lord, so do not make it a day of release from what you have locked yourself away from this month. \n 25 - Remember, as you rejoice and rejoice on the day of Eid, your brothers, the orphans, the bereaved, and the destitute, and know that your kindness to them is capable of changing this situation, so hasten to thank them for the blessings and console them. \n 26 - Beware of breaking the fast without an excuse, because whoever breaks the fast on a day in Ramadan will not make up for it by fasting for the entire year, even if he fasts it. \n 27 - Make a portion of itikaf for yourself, even if it is a small one. \n 28 - It is recommended to recite the takbir loudly on the night of Eid and on its day until the performance of prayer. \n 29 - Make a share of voluntary fasting for yourself, and do not make a commitment to fast only in Ramadan. \n 30 - Hold yourself accountable in all your affairs, including: maintaining prayer in congregation - zakat - maintaining family ties - honoring one’s religion - checking on neighbors - forgiving those with whom you are hostile - not being extravagant - raising those under your control - taking care of the affairs of your Muslim brothers - not spending anything of what you have been entrusted with for the benefit of yourself - responding and being happy with advice - beingware of hypocrisy - loving your brother what you love for yourself - striving to make amends - not backbiting your brothers - reciting the Qur’an and contemplating it. Its meanings - humility when hearing it. \n\n May God’s blessings and peace be upon our Prophet Muhammad, his family and all his companions."
  },
  {
    "number": "كيف تفوز بليلة القدر؟",
    "text": "",
    "label": "كم سنة تعدل ليلة القدر؟ أكثر من ثلاث وثمانين سنة!! فلو حرصت كل الحرص على هذه الليلة فلا تفوتك، وذلك بقيام كل ليالي العشر الأخيرة، واستغلال كل ليلة منها كأحسن ما يكون الاستغلال كقدوتنا وحبيبنا محمد -صلى الله عليه وسلم- كما روت عنه عائشة رضي الله عنها:أنه إذا دخل العشر شد المئزر وأحيا ليله وأيقظ أهله. \n الحمد لله الذي فرض صيام هذا الشهر وسنَّ لنا قيامه، والصلاة على خيرة خلقه محمد صلى الله عليه وسلم والذي لم يترك خيراً إلا ودل أمته عليه، فروى عنه أبو هريرة -رضي الله تعالى عنه- أنه صلى الله عليه وسلم قال:من صام رمضان إيماناً واحتساباً غُفر له ما تقدم من ذنبه، ومن قام ليلة القدر إيماناً واحتساباً غُفر له ما تقدم من ذنبه وروي عنه أيضاً أنه قال:من قام رمضان إيماناً واحتساباً غُفر له ما تقدم من ذنبه وإن من الحرمان أن نرى كثيراً من المسلمين يقضون هذه اللحظات والفرص النادرة فيما لا ينفعهم، فإذا جاء وقت القيام كانت أحوالهم ما بين: \n (أ) نائمون. \n (ب) يتسامرون ويقعون في غيبة إخوانهم المسلمين. \n (ج) يقضون أوقاتهم في المعاصي من مشاهدة القنوات الفضائية الهابطة، ومشاهدة الأفلام والمسلسلات الرمضانية – كما يسمونها- وحاشا رمضان أن يكون له أفلام، أو مسلسلات مع ما فيها من اختلاط النساء بالرجال، والموسيقى، وما هو أشنع من ذلك. \n لذلك لا بد من تجديد التوبة في هذا الشهر، فهذه فرصتنا للأسباب التالية: \n\n أ. لأن مردة الشياطين تصفد، كما روى أبو هريرة -رضي الله تعالى عنه- مرفوعاً أتاكم رمضان شهر مبارك فرض الله عز وجل عليكم صيامه، تفتح فيه أبواب السماء، وتغلق فيه أبواب الجحيم، وتغل فيه مردة الشياطين، لله فيه ليلة خير من ألف شهر من حرم خيرها فقد حرم. \n ب. الإقبال النفسي على فعل الخيرات في هذا الشهر ما لا تستطيعه في الأشهر الأخرى. \n ج. أن الصوم في نهار رمضان يمنع من القيام بكثير من المعاصي. ولو كان أمام أعيننا أنه قد يكون آخر رمضان نصومه لسهلت علينا التوبة، فكم من شخص مات قبل أن يبلغه، أما نحن فقد بلغناه الله عز وجل فلندعوه أن يعيننا على صيامه وقيامه. \n\n مقارنة بين أعمارنا وأعمار الأمم السابقة: \n قال صلى الله عليه وسلم فيما رواه عنه أبو هريرة رضي الله تعالى عنه:أعمار أمتي ما بين الستين إلى السبعين وأقلهم من يجوز ذلك. \n كان أعمار السابقين مئات السنين، فهذا نوح -عليه السلام- لبث في قومه يدعوهم ألف سنة إلا خمسين عاماً، وعن أبي هريرة –رضي الله عنه- قال: قال صلى الله عليه وسلم نحن الآخرون السابقون يوم القيامة.\n\n\nفكيف يكون لنا السبق، ونحن أقل أعماراً؟! يكون ذلك باستغلال الفرص والتسابق عليها كما يتسابق الناس على الوظائف، والتسجيل في الجامعات، وعلى التخفيضات أيضاً.\n\n\nومن أعظم هذه الفرص، الحرص على ليالي العشر الأواخر من رمضان، فإن لم يكن، فعلى الأقل ليلة 21، 23، 25، 27، 29 لأن ليلة القدر لن تتعدى إحدى هذه الليالي كما قال صلى الله عليه وسلم:تحروا ليلة القدر في الوتر من العشر الأواخر من رمضان.\n\n\nإلا إذا كان هناك اختلاف بين دول العالم الإسلامي في دخول رمضان، فإن الأحوط العمل كل ليالي العشر.\nقال سبحانه وتعالى:ليلة القدر خير من ألف شهر.\n\n\nمنذ أن يؤذن المغرب إلى أن يؤذن الفجر في الغالب لا يتجاوز 12 ساعة.\n\n\nفكم سنة تعدل ليلة القدر؟ أكثر من ثلاث وثمانين سنة!! فلو حرصت كل الحرص على هذه الليلة فلا تفوتك، وذلك بقيام كل ليالي العشر الأخيرة، واستغلال كل ليلة منها كأحسن ما يكون الاستغلال كقدوتنا وحبيبنا محمد -صلى الله عليه وسلم- كما روت عنه عائشة رضي الله عنها:أنه إذا دخل العشر شد المئزر وأحيا ليله وأيقظ أهله.\n\n\nولنحسب عمر واحد منا حرص على القيام في ليالي الوتر لمدة عشر سنوات، إن هذا يساوي أكثر من 830 سنة بإذن الله، ولو عشت عشرين سنة بعد بلوغك، وكنت ممن يستغل كل ليالي العشر بالعبادة، لكان خير من 1660 سنة بإذن الله، وبهذا نحقق السبق يوم القيامة، وذلك باستغلال فرص لم تكن للأمم السابقة من اليهود والنصارى.\n\n\nلذلك منذ أن يدخل شهر رمضان ادع الله أن يعينك ويوفقك لقيام ليلة القدر، فمن أعانه الله فهو المعان، ومن خذله فهو المخذول.\n\n\n\nماذا تفعل في هذه الليلة؟\n\n\n- الاستعداد لها منذ الفجر، فبعد صلاة الفجر تحرص على أذكار الصباح كلها، ومن بينها احرص على قول:لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير مئة مرة، لماذا؟ لما رواه أبو هريرة -رضي الله تعالى عنه- أن رسول الله صلى الله عليه وسلم قال:من قال لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير في يوم مئة مرة كان له عدل عشر رقاب، وكتبت له مئة حسنة، ومحيت عنه مئة سيئة، وكانت له حرزاً من الشيطان يومه ذلك حتى يمسي، ولم يأت أحد بأفضل مما جاء به إلا أحد عمل أكثر من ذلك. الشاهد: كانت له حرزاً من الشيطان يومه ذلك حتى يمسي حتى لا يدخل عليك الشيطان فيصرفك عن الطاعة.\n\n\n- احرص على أن تفطر صائماً، إما بدعوته، أو بإرسال إفطاره، أو بدفع مال لتفطيره، وأنت بهذا العمل تكون حصلت على أجر صيام شهر رمضان مرتين لو فطرت كل يوم منذ أن يدخل الشهر إلى آخره صائماً لما رواه زيد بن خالد الجهني عن رسول الله -صلى الله عليه وسلم- أنه قال:من فطر صائماً كتب له مثل أجره لا ينقص من أجره شيء.\n\n\n- عند غروب الشمس ادع أيضاً أن يعينك ويوفقك لقيام ليلة القدر.\n\n\n- جهز صدقتك لهذه الليلة من ليالي العشر، وليكن لك ادخار طوال السنة لتخريجه في هذه الليالي الفاضلة فلا تفوتك ليلة من ليالي الوتر إلا وتخرج صدقتها، فالريال إذا تقبله الله في ليلة القدر قد يساوي أكثر من ثلاثين ألف ريال،\n\n\nو 100 ريال تساوي أكثر من 300 ألف ريال وهكذا، وقد روى أبو هريرة -رضي الله تعالى عنه- أن رسول الله صلى الله عليه وسلم قال:من تصدق بعدل تمرة من كسب طيب ولا يقبل الله إلا الطيب، وإن الله يتقبلها بيمينه، ثم يربيها لصاحبه كما يربي أحدكم فلوه، حتى تكون مثل الجبل وروى أبو هريرة أيضاً قال: جاء رجل إلى النبي صلى الله عليه وسلم، فقال: يا رسول الله، أي الصدقة أعظم أجراً؟ قال: أن تصدق وأنت صحيح شحيح تخشى الفقر، وتأمل الغنى ولا تمهل حتى إذا بلغت الحلقوم قلت: لفلان كذا، ولفلان كذا، وقد كان لفلان.\n\n\nفإن أخفيتها كان أعظم لأجرك فتدخل بإذن الله ضمن السبعة الذين يظلهم الله في ظله يوم لا ظل إلا ظله، لما رواه أبو هريرة -رضي الله تعالى عنه- عن النبي صلى الله عليه وسلم أنه قال:سبعة يظلهم الله تعالى في ظله يوم لا ظل إلا ظله.. ورجل تصدق بصدقة فأخفاها حتى لا تعلم شماله ما تنفق يمينه ورجل ذكر الله خالياً ففاضت عيناه .\n\n\n- منذ أن تغرب الشمس احرص على القيام بالفرائض والسنن، فمثلاً منذ أن يؤذن ردد مع المؤذن ثم قل: وأنا أشهد أن لا إله إلا الله وحده لا شريك له وأن محمداً عبده ورسوله، رضيت بالله رباً وبالإسلام ديناً، فمن قال ذلك غُفر له ذنبه كما روي عنه صلى الله عليه وسلم مرفوعاً ثم قل: اللهم رب هذه الدعوة التامة.. إلخ، لما رواه جابر بن عبد الله أن رسول الله -صلى الله عليه وسلم- قال: من قال حين يسمع النداء: اللهم رب هذه الدعوة التامة والصلاة القائمة آت محمداً الوسيلة والفضيلة وابعثه مقاماً محموداً الذي وعدته، حلت له شفاعتي يوم القيامة. \n - ثم بكر بالفطور احتساباً، وعند تقريبك لفطورك ليكن رطباً محتسباً أيضاً، ولا تنس الدعاء في هذه اللحظات، وليكن من ضمن دعائك: اللهم أعني ووفقني لقيام ليلة القدر، ثم توضأ وضوء رسول الله -صلى الله عليه وسلم- ثم بادر بالنافلة بين الأذان والإقامة؛ لما رواه أنس -رضي الله تعالى عنه- أنه قال: كان المؤذن إذا أذن قام ناس من أصحاب النبي -صلى الله عليه وسلم- يبتدرون السواري حتى يخرج النبي -صلى الله عليه وسلم- وهم كذلك يصلون الركعتين قبل المغرب، ولم يكن بين الأذان والإقامة شيء. ثم صل صلاة مودع كلها خشوع واطمئنان، ثم اذكر أذكار الصلاة، ثم صل السنة الراتبة، ثم اذكر أذكار المساء -إن لم تكن قلتها عصراً- ومنها لا إله إلا الله وحده لا شريك له، له الملك وله الحمد وهو على كل شيء قدير مئة مرة؛ لتكون في حرز من الشيطان ليلتك هذه حتى تصبح، كما سبق أن ذكرنا، ثم نوِّع في العبادة:\n\n\n- لا يفتر لسانك من دعائك بـ اللهم إنك عفو تحب العفو فاعف عني.\n\n\n- إن كان لك والدان فبرهما وتقرب منهما، واقض حوائجهما وافطر معهما.\n\n\n- ثم بادر بالذهاب إلى المسجد قبل الأذان، لتصلي سنة دخول المسجد، ولتتهيأ بانقطاعك عن الدنيا ومشاغلها علك تخشع في صلاتك، ثم إذا أذن ردد معه وقل أذكار الأذان ثم صل النافلة، ثم اذكر الله حتى تقام الصلاة، أو اقرأ في المصحف، واعلم أنك ما دمت في انتظار الصلاة فأنت في صلاة كما روى ذلك أبو هريرة -رضي الله تعالى عنه- أن النبي -صلى الله عليه وسلم- قال:إن أحدكم في صلاة ما دامت الصلاة تحبسه، والملائكة تقول اللهم اغفر له وارحمه، ما لم يقم من صلاته أو يحدث.\n\n\n- ثم إذا أقيمت الصلاة صل بخشوع، فكلما قرأ الإمام آية استشعر قراءته، وكن مع كلام ربك حتى ينصرف الإمام.\n\n\n- ثم عد إلى بيتك، ولا يكن هذا هو آخر العهد بالعبادة حتى صلاة القيام، بل ليكن في بيتك أوفر الحظ والنصيب من العبادة سواء بالصلاة أو بغيرها.\n\n\n- ولا تنس -قبل خروجك من المسجد- أن تضع صدقة هذه الليلة، وإذا كان يصعب عليك إخراج صدقة كل ليلة من هذه الليالي فمن الممكن أن تعطي كل صدقتك قبل رمضان أو قبل العشر الأواخر جهة خيرية توكلها بإخراج جزء منها كل ليلة من ليالي العشر.\n\n\n- ولا تنس وأنت في طريقك من وإلى المسجد أن يكون لسانك رطباً من ذكر الله، ولا تنس سيد الاستغفار هذه الليلة:اللهم أنت ربي لا إله إلا أنت خلقتني وأنا عبدك، وأنا على عهدك ووعدك ما استطعت، أعوذ بك من شر ما صنعت، أبوء لك بنعمتك علي، وأبوء بذنبي فاغفر لي إنه لا يغفر الذنوب إلا أنت. قال صلى الله عليه وسلم:من قاله فمات من يومه أو ليلته دخل الجنة، وما بين تهليل وتسبيح وتحميد وتكبير وحوقلة؛ لما رواه أبو سعيد الخدري أن رسول الله صلى الله عليه وسلم قال: استكثروا من الباقيات الصالحات، قيل وما هن يا رسول الله؟ قال: التكبير والتهليل والتسبيح والحمد لله ولا حول ولا قوة إلا بالله وما بين صلاة على رسولنا محمد -صلى الله عليه وسلم- ثم الدعاء بخيري الدنيا والآخرة، فإذا دخلت بيتك تلمَّس حاجة من هم في البيت، سواء والداك أو زوجتك أو إخوانك أو أطفالك، فقم بخدمة الجميع بانشراح الصدر واحتساب واستغل القيام بحوائجهم بقراءة القرآن عن ظهر قلب، فقل هو الله أحد تعدل ثلث القرآن في الأجر، كما روى أبو الدرداء عن النبي -صلى الله عليه وسلم- أنه قال:أيعجز أحدكم أن يقرأ في ليلة ثلث القرآن؟ قال:وكيف يقرأ ثلث القرآن؟ قال: قل هو الله أحد ثلث القرآن. فإذا قرأتها ثلاث مرات حصلت على أجر قراءة القرآن كاملاً، ولكن ليس معنى هذا هجر القرآن، ولكن هذا له أوقات وهذا له أوقات، وقل يا أيها الكافرون تعدل ربع القرآن في الأجر،\n\n\nوآية الكرسي أعظم آية في كتاب الله، أخرجه سعيد بن منصور في سننه، كما قاله عبد الله موقوفاً، ثم قل: لا إله إلا الله وحده لا شريك له له الملك وله الحمد وهو على كل شيء قدير مئة مرة؛ ليكون لك عدل عشر رقاب، ولتكتب لك مئة حسنة، وتمحى عنك مئة سيئة، ولتكن حرزاً لك من الشيطان حتى تصبح ولم يأت بأفضل مما جئت به إلا أحد عمل أكثر من ذلك، واحرص على كل ما ثبت عنه -صلى الله عليه وسلم- من الأذكار ذات الأجور العظيمة، كما قال صلى الله عليه وسلم لعمه:ألا أدلك على ما هو أكثر من ذكرك الله الليل مع النهار تقول: الحمد لله عدد ما خلق، الحمد لله ملء ما خلق، الحمد لله عدد ما في السموات والأرض، الحمد لله عدد ما أحصى كتابه، الحمد لله ملء ما أحصى كتابه، الحمد لله عدد كل شيء والحمد لله ملء كل شيء وتسبح مثلهن، ثم قال: تعلمهن وعلمهن عقبك من بعدك وقال صلى الله عليه وسلم:من قال سبحان الله وبحمده مئة مرة حطت خطاياه وإن كانت مثل زبد البحر\n\n\nوعن أبي هريرة –رضي الله عنه- قال -صلى الله عليه وسلم-: من قال حين يصبح وحين يمسي سبحان الله وبحمده مئة مرة لم يأت أحد يوم القيامة بأفضل مما جاء به إلا أحد قال مثل ما قال أو زاد عليه وفي بعض الروايات سبحان الله العظيم وبحمده مئة مرة وكلما ذُكرت الكفارة أو الغفران – غفران الذنوب- وحط الخطايا، فالمقصود بها الصغائر، أما الكبائر فلا بد من التوبة، أما إن كانت هذه الكبيرة متعلقة بحقوق الآدميين فلا بد من الاستحلال مع التوبة أو المقاصة يوم القيامة؛ لما رواه أبو هريرة -رضي الله تعالى عنه-:من كانت له مظلمة لأخيه من عرضه أو شيء فليتحلله منه اليوم قبل ألا يكون دينار ولا درهم إن كان له عمل صالح أخذ منه بقدر مظلمته، وإن لم يكن له حسنات أخذ من سيئات صاحبه فحمل عليهولا يغرك في الغيبة ما يردده البعض أن كفارة من اغتبته أن تستغفر له، فهذا حديث أقل أحواله أنه شديد الضعف، وهو يعارض الحديث السابق الصحيح، ومن أعظم حقوق الآدميين: الغيبة والنميمة والسخرية، والاستهزاء والسب، والشتم وشهادة الزور، قال صلى الله عليه وسلم:الصلوات الخمس والجمعة إلى الجمعة ورمضان إلى رمضان مكفرات ما بينهن إذا اجتنبت الكبائر .\n\n\nفإذا فرغت من خدمة الجميع والأعمال البدنية، ليكن لك جلسة مع كتاب ربك فتقرأه، وليكن لك قراءتان في شهر رمضان إحداهما سريعة الحدر والأخرى بتأمل مع التفسير إذا أشكل عليك آية، قال ابن عباس رضي الله تعالى عنه:لأن أقرأ سورة أرتلها أحب إلي من أن أقرأ القرآن كله. \n فإذا أنهك جسدك فألقه على السرير وأنت تذكر ربك بالتهليل والتسبيح والتحميد والحوقلة والتكبير والاستغفار والصلاة والسلام على رسولنا الكريم صلى الله عليه وسلم. \n - فإن نمت فأنت مأجور -بإذن الله- ثم استيقظ لصلاة قيام الليل في المسجد، وليكن لك ساعة خلوة مع ربك ساعة السحر فتفكر في عظمة خالقك، ونعمه التي لا تحصى عليك مهما كنت فيه من حال أو شدة فأنت أحسن حالاً ممن هو أشد منك كما قال صلى الله عليه وسلم:انظروا إلى من هو أسفل منكم، ولا تنظروا إلا من هو فوقكم، فهو أجدر أن لا تزدروا نعمة الله. \n - وتذكر هادم اللذات علها تدمع عينك فتكون من السبعة الذين يظلهم الله في ظله يوم لا ظل إلا ظله كما قال صلى الله عليه وسلم:ورجل ذكر الله خالياً ففاضت عيناه.. . \n - وتذكر ما رواه جابر بن سمرة عن رسول الله -صلى الله عليه وسلم- قال:أتاني جبريل، فقال: يا محمد من أدرك شهر رمضان فمات فلم يغفر له فأدخل النار فأبعده الله، قل آمين. فقلت: آمين.. الحديث. فهذه العشر هي والله الغنيمة الباردة، وفي هذا الشهر فرص ومواسم من لم يستغلها تذهب ولا ترجع.. \n - أخيراً وقبيل الفجر لا بد من السحور ولو بماء، مع احتساب العمل بالسنة؛ لما رواه أنس رضي الله تعالى عنه، قال: قال صلى الله عليه وسلم:تسحروا فإن في السحور بركة ثم تسوك وتوضأ واستعد لصلاة الفجر وأنت إما في ذكر أو دعاء أو قراءة قرآن. \n\n - ولا بد من التنبيه على بعض الأخطاء، ومنها: \n 1- أن البعض قد يشيع في ليلة 23 أو 25 أن فلاناً رأى رؤياً، وأن تعبيرها أن ليلة القدر مثلاً ليلة 21 أو 23. فماذا يفعل البطالون؟ يتوقفون عن العمل باقي ليالي العشر، حتى أن البعض قد يكون في مكة فيعود، لماذا؟ انقضت ليلة القدر في نظره. وفي هذا من الأخطاء ما فيها، ومنها: أن هذا قد يكون حلماً وليس رؤياً. أن المعبر حتى وإن عبرها بأنها ليلة 21 أو 23 أو غيرها ليس بشرط أن يكون أصاب، فهذا أبو بكر الصديق -رضي الله تعالى عنه- عبر رؤيا عند رسول الله صلى الله عليه وسلم، فقال له: أصبت بعضاً وأخطأت بعضاً فإذا كان أبو بكر وهو خير الخلق بعد الأنبياء يصيب ويخطئ، فما بالك بغيره. والذي يظهر لي أن هذا من تلبيس إبليس، ليصد المؤمنين عن العمل باقي ليالي العشر. والله أعلم.\n\n\nوأخيراً.. الأيام معدودة، والعمر قصير، ولا تعلم متى يأتيك الأجل، ولا تدري لعلك لا تبلغ رمضان، وإن بلغته لعلك لا تكمله، وإن أكملته لعله يكون آخر رمضان في حياتنا.\n\n\nفهذا يخرج من بيته سليماً معافى فينعى إلى أهله، وهذا يلبس ملابسه ولا يدري هل سينزعها أم ستنزع منه؟\n\n\nلذلك كله علينا أن نستحضر هذه النعمة العظيمة أن بلغنا رمضان ووفقنا لصيامه وقيامه وصالح الأعمال، فكم من شخص مات قبل أن يبلغه، وكم من مريض مر عليه رمضان كغيره من الشهور، وكم من عاص لله ضال عن الطريق المستقيم ما ازداد في رمضان إلا بعداً وخساراً، وأنت يوفقك الله للصيام والقيام، فاحمد الله على هذه النعمة الجليلة، واستغلها أيما استغلال",
    "number-en": "How do you win Laylat al-Qadr?",
    "label-en": "How many years is Laylat al-Qadr? More than eighty-three years!! If you are very keen on this night, do not miss it, by praying all the last ten nights, and making the most of every night, like our role model and our beloved Muhammad - may God bless him and grant him peace - as Aisha, may God be pleased with her, narrated from him: that when the ten days came, he tightened the apron, lived the night, and woke up his family. Praise be to God who imposed fasting this month and made it lawful for us to perform it, and prayers be upon the best of his creation, Muhammad, may God’s prayers and peace be upon him, who did not leave any good without guiding his nation to it. Abu Hurairah - may God Almighty be pleased with him - narrated that he, may God’s prayers and peace be upon him, said: Whoever fasts Ramadan out of faith and seeking reward, his previous sins will be forgiven, and whoever prays the Night of Destiny out of faith and seeking reward, his previous sins will be forgiven, and it was also narrated from him that he said: Ramadan began out of faith and hope that he would be forgiven for his previous sins, and it is depriving to see many Muslims spending these rare moments and opportunities on things that do not benefit them. When the time for resurrection came, their conditions would be between: \n (a) They are asleep. \n (b) They bicker and fall into the backbiting of their Muslim brothers. \n (c) They spend their time in sins, such as watching low-quality satellite channels, and watching Ramadan movies and series - as they call them - and God forbid that Ramadan should have movies or series with the mixing of women with men, music, and anything worse than that. \n Therefore, it is necessary to renew repentance in this month, as this is our opportunity for the following reasons: \n\n A. Because the rebelling devils are chained up, as Abu Hurairah - may God Almighty be pleased with him - narrated with a chain of transmission traceable to the Prophet. Ramadan has come to you, a blessed month, which God Almighty has imposed upon you to fast. In it the gates of heaven are opened, the gates of hell are closed, and the rebelling devils are chained up in it. God has a night in it that is better than a thousand months. Whoever deprives of its goodness is deprived of it. \n for. The psychological desire to do good deeds in this month is what you cannot do in other months. \n C. Fasting during the day in Ramadan prevents one from committing many sins. If it were before our eyes that it might be the last Ramadan that we fast, it would have been easy for us to repent. How many people have died before reaching it, but we have reached it, God Almighty, so let us pray to Him to help us in fasting and praying. \n\n Comparison between our ages and the ages of previous nations: \n He, may God bless him and grant him peace, said, according to what Abu Hurairah, may God Almighty be pleased with him, said: The age of my nation is between sixty and seventy, and the least of them are permissible. The lives of the forerunners were hundreds of years. This Noah - peace be upon him - remained among his people calling on them for a thousand years minus fifty years. On the authority of Abu Hurairah - may God be pleased with him - he said: He, may God’s prayers and peace be upon him, said: We are the others who will be the forerunners on the Day of Resurrection.\n\n\nHow can we have a head start, when we are younger?! This is done by exploiting opportunities and competing for them, just as people compete for jobs, university registration, and discounts as well. One of the greatest of these opportunities is to pay attention to the last ten nights of Ramadan. If not, then at least the nights of the 21st, 23rd, 25th, 27th, and 29th, because Laylat al-Qadr will not exceed one of these nights, as the Prophet, may God’s prayers and peace be upon him, said: Search for Laylat al-Qadr in the odd-numbered night of the last ten nights of Ramadan.\n\n\nUnless there is a difference between the countries of the Islamic world regarding the beginning of Ramadan, it is more prudent to work every ten nights.\nGod Almighty said: The Night of Decree is better than a thousand months.\n\n\nFrom the time the Maghrib call to prayer is called to the dawn call to prayer, it usually does not exceed 12 hours. How many years is Laylat al-Qadr? More than eighty-three years!! If you are very keen on this night, do not miss it, by praying all the last ten nights, and making the most of every night, like our role model and our beloved Muhammad - may God bless him and grant him peace - as Aisha, may God be pleased with her, narrated from him: that when the ten days came, he tightened the apron, lived the night, and woke up his family. Let us calculate the lifespan of one of us who was keen to perform prayers on the nights of Witr for ten years. This equals more than 830 years, God willing. If you lived twenty years after puberty, and were one of those who exploited all ten nights in worship, it would be better than 1660 years, God willing. In this way we will achieve a head start on the Day of Resurrection, by exploiting opportunities that the previous nations of the Jews and Christians did not have.\n\n\nTherefore, since the month of Ramadan begins, pray to God to help you and grant you success in praying Laylat al-Qadr. Whoever God helps is the helper, and whoever abandons him is the forsaken. What are you doing tonight?\n\n\n- Prepare for it since dawn. After the dawn prayer, you should make sure to recite all the morning remembrances, and among them, be careful to say: There is no god but God alone, with no partner. To Him belongs the dominion and to Him is praise, and He is capable of all things a hundred times. Why? As narrated by Abu Hurairah - may God Almighty be pleased with him - that the Messenger of God, may God’s prayers and peace be upon him, said: Whoever says: There is no god but God alone, with no partner, to Him belongs dominion and to Him is praise, and He is capable of all things. In a day a hundred times, he will have the equivalent of ten slaves, a hundred good deeds will be recorded for him, a hundred bad deeds will be erased from him, and it will be a protection for him from Satan on that day until evening. No one came up with anything better than what he did except someone who did more than that. Witness: It was a protection for him from Satan that day until the evening, so that Satan would not enter upon you and distract you from obedience.\n\n\n- Make sure to break the fast of a fasting person, either by inviting him, or by sending him breakfast, or by paying money to break his fast, and by doing this you will have received the reward for fasting the month of Ramadan twice if you broke the fast every day from the beginning of the month until the end of it fasting, as narrated by Zaid bin Khaled Al-Juhani on the authority of the Messenger of God - may God bless him and grant him peace - that he said: Whoever breaks the fast of a fasting person will have his reward written for him, and nothing will be detracted from his reward. - When the sun sets, also pray that He will help you and grant you success in praying Laylat al-Qadr.\n\n\n- Prepare your charity for this night of the ten nights, and have savings throughout the year to spend on these virtuous nights. Do not miss one of the nights of Witr without giving out its charity. A riyal, if God accepts it on Laylat al-Qadr, may be worth more than thirty thousand riyals.\n\n\nAnd 100 riyals is equal to more than 300 thousand riyals, and so on. Abu Hurairah - may God Almighty be pleased with him - narrated that the Messenger of God, may God bless him and grant him peace, said: Whoever gives in charity the equivalent of a date from good earnings, and God does not accept anything but what is good, and God accepts it with His right hand. Then he raises it for his owner as one of you raises his foal, until it becomes like a mountain. Abu Hurairah also narrated that he said: A man came to the Prophet, may God bless him and grant him peace, and said: O Messenger of God, which charity has the greatest reward? He said: To give charity while you are healthy and stingy, fearing poverty, and hoping for wealth, and do not delay until when you reach the throat, you say: To so-and-so, and to so-and-so, and it was to so-and-so. If you hide it, your reward will be greater, so you will be included, God willing, among the seven whom God will shade in His shade on the Day when there is no shade but His shade, according to what Abu Hurairah - may God Almighty be pleased with him - narrated on the authority of the Prophet, may God bless him and grant him peace, that he said: Seven whom God Almighty will shade on the Day when there is no shade but His shade... And a man who gave alms and hid it so that his left hand would not know what his right hand was spending, and a man who mentioned God empty-handed and his eyes filled with tears. - Since the sun sets, be careful to perform the obligations and Sunnahs. For example, since the call to prayer is given, repeat with the muezzin and then say: And I bear witness that there is no god but God alone, with no partner, and that Muhammad is His servant and His Messenger. I am satisfied with God as Lord and with Islam as religion. Whoever says that, his sin will be forgiven, as it was narrated from him, may God’s prayers and peace be upon him, with a chain of transmission traceable to the Prophet, then say: Oh God, Lord of this perfect call. Etc., when it was narrated by Jabir bin Abdullah that the Messenger of God - may God bless him and grant him peace - said: Whoever says when he hears the call: O God, Lord of this perfect call and the established prayer, give Muhammad the means and virtue and raise him to the praiseworthy station that You promised him, my intercession will be permissible for him on the Day of Resurrection. \n - Then get up early with breakfast for the sake of hope, and when you prepare for your breakfast, let it be fresh as well, and do not forget to supplicate in these moments, and let it be among your supplications: O God, help me and grant me success in praying Laylat al-Qadr. Then he performed the ablution of the Messenger of God - may God bless him and grant him peace - and then hastened to perform the voluntary prayer between the call to prayer and the iqama. As narrated by Anas - may God Almighty be pleased with him - that he said: When the muezzin gave the call to prayer, some of the Companions of the Prophet - may God bless him and grant him peace - would stand up and rush to the poles until the Prophet - may God bless him and grant him peace - came out. They would also pray the two rak’ahs before sunset, and there was nothing between the call to prayer and the iqama. Then pray a farewell prayer, complete with humility and reassurance, then recite the remembrances of prayer, then pray the regular Sunnah, then recite the evening remembrances - if you did not say them in the afternoon - and from them there is no god but God alone, with no partner, to Him belongs dominion and to Him is praise, and He is capable of all things a hundred times; To be protected from Satan this night until morning, as we previously mentioned, then vary your worship:\n\n\n- Do not let your tongue falter in your supplication, “O God, You are the Pardoner and You love forgiveness, so forgive me.”\n\n\n- If you have two parents, be kind to them, meet their needs, and break your fast with them. - Then hasten to go to the mosque before the call to prayer, to pray the Sunnah of entering the mosque, and to prepare yourself by being cut off from the world and its concerns so that you may be humble in your prayer. Then, when the call to prayer is called, repeat with him and say the supplications of the call to prayer, then pray the voluntary prayer, then remember God until the prayer is established, or read from the Qur’an, and know that as long as you are waiting for prayer, you are in prayer, as Abu Hurairah - may God Almighty be pleased with him - narrated that the Prophet - may God bless him and grant him peace Peace be upon him - he said: One of you is in prayer as long as the prayer detains him, and the angels say, O God, forgive him and have mercy on him, as long as he does not stand up from his prayer or speak. - Then, when the prayer is performed, pray with humility. Every time the imam recites a verse, he feels his reading, and be with the words of your Lord until the imam leaves.\n\n\n- Then return to your home, and this should not be the last pledge of worship until the prayer of prayer. Rather, let your home have the best luck and share of worship, whether through prayer or otherwise.\n\n\n- And do not forget - before you leave the mosque - to give charity for this night, and if it is difficult for you to give charity for each of these nights, it is possible to give all your charity before Ramadan or before the last ten nights to a charitable organization that you entrust to give a portion of it every night of the ten nights. - And do not forget, on your way to and from the mosque, to keep your tongue moist from the remembrance of God, and do not forget the master of seeking forgiveness tonight: O God, you are my Lord, there is no god but You, you created me and I am your servant, and I adhere to your covenant and promise as much as I can. I seek refuge in you from the evil of what I have done. I acknowledge your grace upon me, and I acknowledge my sin, so forgive me. No one forgives sins except you. He, may God’s prayers and peace be upon him, said: Whoever says it and dies during that day or night will enter Paradise, and what is between Tahlil, Tasbih, Praise, Takbir, and Hawqalah; When Abu Saeed Al-Khudri narrated that the Messenger of God, may God’s prayers and peace be upon him, said: “Make abundant of the remaining good deeds.” It was said, “What are they, O Messenger of God?” He said: Takbir, Tahlil, glorification, praise be to God, and there is no power nor strength except in God, and between praying for our Messenger Muhammad - may God bless him and grant him peace - and then praying for the good things of this world and the hereafter. If you enter your house, you feel the need of those in the house, whether your parents, your wife, your brothers, or your children. So serve everyone with open heartedness and hope, and take advantage of fulfilling their needs by reciting the Qur’an by heart, so say, “He is God, One,” and a third of the Qur’an is equivalent in reward, as Abu Darda narrated on the authority of the Prophet - may God bless him and grant him peace - that he said: Is any of you unable to recite a third of the Qur’an in one night? He said: How is a third of the Qur’an read? He said: Say: He is God, one third of the Qur’an. If you read it three times, you will obtain the reward of reading the entire Qur’an, but this does not mean abandoning the Qur’an, but this has times and this has times, and say, O you disbelievers, it is equivalent to a quarter of the Qur’an in reward.\n\n\nThe Throne Verse is the greatest verse in the Book of God. It was included by Saeed bin Mansour in his Sunan, as Abdullah said it in a suspended sentence. Then say: There is no god but God alone, with no partner to Him. To Him belongs dominion and to Him is praise, and He has power over all things a hundred times. So that you may have the justice of ten slaves, and that a hundred good deeds may be recorded for you, and a hundred bad deeds may be erased from you, and that it may be a protection for you from Satan until morning, and he has not brought anything better than what you have brought except someone who has done more than that. And be keen on everything that has been proven from him - may God bless him and grant him peace - of remembrances that have great rewards, just as he, may God’s prayers and peace be upon him, said to his uncle: Shall I not direct you to something more than your remembrance of God night and day, saying: Praise be to God, the number of what He created, praise be to God, the fullness of what He created, praise be to God, the number of what is in the heavens and the earth, praise be to God, the number of what His Book has counted, Praise be to God, the fullness of what His Book has counted, Praise be to God, the number of everything, and praise be to God, the fullness of everything, and praise be to God like them. Then he said: Learn them and teach them to your successors after you. And he, may God’s prayers and peace be upon him, said: Whoever says Glory be to God and praise be to Him a hundred times, his sins will be forgiven, even if they are like the foam of the sea.\n\n\nOn the authority of Abu Hurairah - may God be pleased with him - he said - may God’s prayers and peace be upon him -: Whoever says in the morning and in the evening, Glory be to God and praise be to Him a hundred times, no one will come on the Day of Resurrection better than what he brought except someone who said the same as what he said or added to it. In some narrations, Glory be to God the Great and praise be to Him a hundred times, and whenever expiation or forgiveness - the forgiveness of sins - is mentioned and sins are mentioned, what is meant by them are minor ones, but as for major sins, it is necessary to Repentance, However, if this major sin is related to the rights of human beings, then it must be made permissible with repentance or settlement on the Day of Resurrection. As narrated by Abu Hurairah - may God Almighty be pleased with him -: Whoever has wronged his brother regarding his honor or something, let him forgive him today before there is no dinar or dirham. If he has done good deeds, it will be taken from him in proportion to the wrong he did, and if he has no good deeds, then some of his companion’s bad deeds will be taken from him and burdened upon him. Do not be tempted into backbiting by what some say is that the atonement for someone you backbite is to ask forgiveness for him. This hadith is at least extremely weak, and it contradicts the previous authentic hadith, and one of the greatest rights of human beings is: Backbiting, gossiping, and sarcasm, Mockery, cursing, cursing, and false testimony. He, may God’s prayers and peace be upon him, said: The five daily prayers, Friday to Friday, and Ramadan to Ramadan, expiate whatever is between them, if major sins are avoided.\n\n\nWhen you have finished serving everyone and doing physical work, have a session with the Book of your Lord and read it, and have two readings in the month of Ramadan, one of them quickly and the other in contemplation with interpretation if you are confused about a verse. Ibn Abbas, may God Almighty be pleased with him, said: For me to recite a surah that I recite is more beloved to me than to recite the entire Qur’an. If your body is exhausted, throw it on the bed while you remember your Lord with rejoicing, praising, praising, praising, humming, saying takbir, seeking forgiveness, and praying and peace be upon our noble Messenger, may God bless him and grant him peace. \n - If you sleep, you will be rewarded - God willing - then wake up to pray the night prayer in the mosque, and have an hour of seclusion with your Lord, the hour of dawn, so you can think about the greatness of your Creator and His countless blessings upon you, no matter what condition or hardship you are in. You are in a better condition than one who is more difficult than you, as the Prophet, may God’s prayers and peace be upon him, said: Look at who is below you, and only look at who is above you, for he is more worthy of not disdaining God’s blessing. - And remember the destroyer of pleasures, lest it bring tears to your eyes and you will be among the seven whom God will shade under His shade on the day when there will be no shade but His shade, as the Prophet, may God’s prayers and peace be upon him, said: And a man who remembered God alone, and his eyes filled with tears.. . \n - And remember what Jabir bin Samra narrated on the authority of the Messenger of God - may God’s prayers and peace be upon him - who said: Gabriel came to me and said: O Muhammad, whoever reaches the month of Ramadan and dies and is not forgiven, then he enters Hell and God keeps him away, say Amen. I said: Amen...the hadith. By God, these ten days are cold spoils, and in this month the opportunities and seasons of those who do not take advantage of them will disappear and will not return. - Finally, before dawn, it is necessary to have suhoor, even with water, while working according to the Sunnah. As narrated by Anas, may God Almighty be pleased with him, he said: He, may God’s prayers and peace be upon him, said: Eat suhoor, for there is a blessing in suhoor. Then you use your suhoor, perform ablution, and prepare for the dawn prayer, while you are either in remembrance, supplication, or reading the Qur’an. \n\n It is necessary to note some errors, including: \n 1- Some may say that on the night of the 23rd or 25th, someone saw a vision, and that it means that Laylat al-Qadr, for example, is the night of the 21st or 23rd. What do unemployed people do? They stop working for the rest of the ten nights, and some may even be in Mecca and return. Why? The Night of Destiny had passed in his view. There are some errors in this, including: This may be a dream and not a vision. Even if he expresses it as the night of the 21st, 23rd, or any other time, it is not necessary that he was correct. This is Abu Bakr Al-Siddiq - may God Almighty be pleased with him - who interpreted a vision with the Messenger of God, may God bless him and grant him peace, and he said to him: I was correct in some and I was wrong in some, so if Abu Bakr, who is the best of creation after the prophets, is right and wrong, then what about others. What appears to me is that this is a deception of Satan, to prevent believers from working for the rest of the ten nights. And God knows best.\n\n\nFinally, the days are numbered, and life is short, and you do not know when your deadline will come, and you do not know that you may not reach Ramadan, and if you reach it, you may not complete it, and if you complete it, perhaps it will be the last Ramadan in our lives.\n\n\nThis person leaves his house safe and sound and is returned to his family, while this person puts on his clothes and does not know whether he will take them off or whether they will be taken off him?\n\n\nTherefore, we all have to remember this great blessing if we reach Ramadan and succeed in fasting, praying, and doing good deeds. How many people died before reaching it. How many sick people have passed through Ramadan like other months, and how many disobedient people have strayed from the straight path. Ramadan has only increased distance and loss. And may God grant you success in fasting and praying, so thank God for this great blessing, and make full use of it."
  },
  {
    "number": "العشر الأواخر من رمضان ",
    "text": "",
    "label": "عن عائشة رضي الله عنها، قالت: { كان رسول الله صلى الله عليه و سلم إذا دخل العشر شدّ مئزره، وأحيا ليله، وأيقظ أهله } وفي رواية: { أحيا الليل، وأيقظ أهله، وجد، وشد المئزر } [رواه البخاري ومسلم]. \n\n الأعمال الخاصة بالعشر الأواخر من رمضان \n كان النبي صلى الله عليه و سلم يخص العشر الأواخر من رمضان بأعمال لا يعملها في بقية الشهر: \n فمنها: إحياء الليل؛ فيحتمل أن المراد إحياء الليل كله، ففي حديث عائشة قالت: { كان النبي صلى الله عليه و سلم يخلط العشرين بصلاة ونوم، فإذا كان العشر - يعني الأخير - شمّر وشدّ المئزر } [رواه أحمد]. ويحتمل أن يريد بإحياء الليل إحياء غالبه، ويؤيده ما في صحيح مسلم عن عائشة، قالت: { ما أعلمه صلى الله عليه و سلم قام ليلة حتى الصباح }. \n ومنها: أن النبي صلى الله عليه و سلم كان يوقظ أهله للصلاة في ليالي العشر دون غيره من الليالي، قال سفيان الثوري: أحب إليّ إذا دخل العشر الأواخر أن يتهجد بالليل، ويجتهد فيه، ويُنهض أهله وولده إلى الصلاة إن أطاقوا ذلك. وقد صح عن النبي صلى الله عليه و سلم أنه كان يطرق فاطمة وعلياً ليلاً فيقول لهما: { ألا تقومان فُتصليان } [رواه البخاري ومسلم]. \n وكان يوقظ عائشة بالليل إذا قضى تهجده وأراد أن يُوتر. وورد الترغيب في إيقاظ أحد الزوجين صاحبه للصلاة، ونضح الماء في وجهه. وفي الموطأ أن عمر بن الخطاب كان يصلي من الليل ما شاء الله أن يصلي، حتى إذا كان نصف الليل أيقظ أهله للصلاة، يقول لهم: الصلاة الصلاة، ويتلو هذه الآية: وَأْمُرْ أَهْلَكَ بِالصَّلَاةِ وَاصْطَبِرْ عَلَيْهَا [طه:132]. \n وكانت امرأة أبي محمد حبيب الفارسي تقول له بالليل: ( قد ذهب الليل وبين أيدينا طريق بعيد، وزادنا قليل، وقوافل الصالحين قد سارت قدامنا، ونحن قد بقينا ). \n\n يا نائماً بالليل كم ترقد *** قم ياحبيبي قد دنا الموعد \n وخُذ من الليل وأوقاته *** ورِداً إذا ما هجع الرّقد \n من نام حتى ينقضي ليله *** ثم يبلغ المنزل أو يجهد \n ومنها: أن النبي صلى الله عليه و سلم كان يشدّ المئزر. واختلفوا في تفسيره ؛ فمنهم من قال: هو كناية عن شدة جدِّه واجتهاده في العبادة، وهذا فيه نظر، والصحيح أن المراد اعتزاله للنساء، وبذلك فسره السلف والأئمة المتقدمون منهم سفيان الثوري، وورد تفسيره بأنه لم يأوِِ إلى فراشه حتى ينسلخ رمضان. وفي حديث أنس: {وطوى فراشه، واعتزل النساء }. \n وقد قال طائفة من السلف في تفسير قوله تعالى: فَالآنَ بَاشِرُوهُنَّ وَابْتَغُواْ مَا كَتَبَ اللّهُ لَكُمْ [البقرة:187]: إنه طلب ليلة القدر. والمعنى في ذلك أن الله تعالى لما أباح مباشرة النساء في ليالي الصيام إلى أن يتبين الخيط الأبيض من الخيط الأسود، أمر مع ذلك بطلب ليلة القدر؛ لئلا يشتغل المسلمون في طول ليالي الشهر بالاستماع المباح، فيفوتهم طلب ليلة القدر، فأمر مع ذلك بطلب ليلة القدر بالتهجد من الليل، خصوصاً في الليالي المرجو فيها ليلة القدر، فمن ها هنا كان النبي صلى الله عليه و سلم يصيب من أهله في العشرين من رمضان، ثم يعتزل نساءه ويتفرغ لطلب ليلة القدر في العشر الأواخر. \n ومنها: تأخيره للفطور إلى السحر: رُوي عنه من حديث عائشة وأنس أنه النبي صلى الله عليه و سلم كان في ليالي العشر يجعل عشاءه سحوراً. ولفظ حديث عائشة: { كان رسول الله النبي صلى الله عليه و سلم إذا كان رمضان قام ونام، فإذا دخل العشر شدّ المئزر، واجتنب النساء، واغتسل بين الأذانين، وجعل العشاء سحوراً } [رواه ابن أبي عاصم]. وعن أبي سعيد الخدري، عن النبي صلى الله عليه و سلم ، قال: { لا تواصلوا، فأيكم أراد أن يواصل فليواصل إلى السحر }، قالوا: فإنك تواصل يا رسول الله؟ قال: { إني لست كهيئتكم، إني أبيت لي مُطعم يُطعمني وساقٍ يسقيني } [رواه البخاري]. \n وظاهر هذا يدل على أنه النبي صلى الله عليه و سلم كان يواصل الليل كله، وقد يكون إنما فعل ذلك لأنه النبي صلى الله عليه و سلم رآه أنشط له على الاجتهاد في ليالي العشر، ولم يكن ذلك مضعفاً له عن العمل؛ فإن الله كان يطعمه ويسقيه. \n ومنها: اغتساله النبي صلى الله عليه و سلم بين العشاءين، وقد تقدم من حديث عائشة: { واغتسل بين الأذانين } والمراد: أذان المغرب والعشاء، قال ابن جرير: كانوا يستحبون أن يغتسلوا كل ليلة من ليالي العشر الأواخر. وكان النخعي يغتسل في العشر كل ليلة، ومنهم من كان يغتسل ويتطيب في الليالي التي تكون أرجى لليلة القدر. وكان أيوب السختياني يغتسل ليلة ثلاث وعشرين وأربع وعشرين، ويلبس ثوبين جديدين، ويستجمر ويقول: ليلة ثلاث وعشرين هي ليلة أهل المدينة، والتي تليها ليلتنا، يعني البصريين. \n فتبين بهذا أنه يستحب في الليالي التي ترجى فيها ليلة القدر التنظف والتزين، والتطيب بالغسل والطيب واللباس الحسن، كما يشرع ذلك في الجُمع والأعياد. وكذلك يُشرع أخذ الزينة بالثياب في سائر الصلوات، ولا يكمل التزين الظاهر إلا بتزين الباطن بالتوبة والإنابة إلى الله تعالى، وتطهيره من أدناس الذنوب؛ فإن زينة الظاهر مع خراب الباطن لا تغني شيئاً. \n ولا يصلح لمناجاة الملوك في الخلوات إلا من زين ظاهره وباطنه وطهرهما، خصوصاً ملك الملوك الذي يعلم السر وأخفى، وهو لا ينظر إلى صوركم، وإنما ينظر إلى قلوبكم وأعماكم، فمن وقف بين يديه فليزين له ظاهره باللباس، وباطنه بلباس التقوى. \n إذا المرء لم يلبس ثياباً من التقوى *** تقلب عُرياناً وإن كان كاسياً \n ومنها: الاعتكاف، ففي الصحيحين عن عائشة رضي الله عنها أن النبي صلى الله عليه و سلم كان يعتكف العشر الأواخر من رمضان حتى توفاه الله تعالى. وفي صحيح البخاري عن أبي هريرة رضي الله عنه، { كان رسول الله صلى الله عليه و سلم يعتكف في كل رمضان عشرة أيام، فلما كان العام الذي قُبض فيه اعتكف عشرين }. وإنما كان يعتكف النبي صلى الله عليه و سلم في هذه العشر التي يُطلب فيها ليلة القدر، قطعاً لأشغاله، وتفريغاً لباله، وتخلياً لمناجاة ربه وذكره ودعائه. \n فالمعتكف قد حبس نفسه على طاعة الله وذكره، وقطع عن نفسه كل شاغل يشغله عنه، وعكف بقلبه وقالبه على ربه وما يقربه منه، فما بقى له هم سوى الله وما يُرضيه عنه. وكما قويت المعرفة والمحبة له والأنس به أورثت صاحبها الانقطاع إلى الله تعالى بالكلية على كل حال. \n\n ليلة القدر \n قال تعالى: إِنَّا أَنزَلْنَاهُ فِي لَيْلَةِ الْقَدْرِ (1) وَمَا أَدْرَاكَ مَا لَيْلَةُ الْقَدْرِ (2) لَيْلَةُ الْقَدْرِ خَيْرٌ مِّنْ أَلْفِ شَهْرٍ [القدر:1-3]. وعن أبي هريرة رضي الله عنه عن النبي صلى الله عليه و سلم أنه قال في شهر رمضان: { فيه ليلة خير من ألف شهر، منَ حُرم خيرها فقد حُرم } [رواه أحمد والنسائي]. وقال مالك: بلغني أن رسول الله صلى اللّه عليه وسلم أُرِي أعمار الناس قبله، أو ما شاء الله من ذلك، فكأنه تقاصر أعمار أمته ألا يبلغوا من العمل الذي بلغ غيرهم في طول العُمر، فأعطاه الله ليلة القدر خيراً من ألف شهر. \n وأما العمل في ليلة القدر فقد ثبت عن النبي صلى الله عليه و سلم أنه قال: { من قام ليلة القدر إيماناً واحتساباً غُفر له ما تقدم من ذنبه } وقيامها إنما هو إحياؤها بالتهجد فيها والصلاة، وقد أمر عائشة بالدعاء فيها أيضاً. \n قال سفيان الثوري: الدعاء في تلك الليلة أحب إليَّ من الصلاة. ومراده أن كثرة الدعاء أفضل من الصلاة التي لا يكثر فيها الدعاء، وإن قرأ ودعا كان حسناً. وقد كان النبي صلى الله عليه و سلم يتهجد في ليالي رمضان، ويقرأ قراءة مرتلة، لا يمر بآية فيها رحمة إلا سأل، ولا بآية فيها عذاب إلا تعوذ، فيجمع بين الصلاة والقراءة والدعاء والتفكير. وهذا أفضل الأعمال وأكملها في ليالي العشر وغيرها. \n وقالت عائشة رضي الله عنها للنبي : أرأيت إن وافقت ليلة القدر، ما أقول فيها؟ قال: { قولي: اللهم إنك عفو تحب العفو فأعفُ عني } والعفو من أسماء الله تعالى، وهو المتجاوز عن سيئات عباده، الماحي لآثارها عنهم، وهو يُحبُ العفو ؛ فيحب أن يعفو عن عباده، ويحب من عباده أن يعفو بعضهم عن بعض ؛ فإذا عفا بعضهم عن بعض عاملهم بعفوه، وعفوه أحب إليه من عقوبته. وكان النبي صلى الله عليه و سلم يقول: { أعوذ برضاك من سخطك، وعفوك من عقوبتك } [رواه مسلم]. \n وإنما أمر بسؤال العفو في ليلة القدر بعد الاجتهاد في الأعمال فيها وفي ليالي العشر؛ لأن العارفين يجتهدون في الأعمال، ثم لا يرون لأنفسهم عملاً صالحاً ولا حالاً ولا مقالاً، فيرجعون إلى سؤال العفو الُمذنب المقصر. \n\n أسباب المغفرة في رمضان \n عن أبي هريرة رضي الله عنه، عن النبي صلى عليه وسلم قال: { من صام رمضان إيماناً واحتساباً غفر له ما تقدم من ذنبه، ومن قام ليلة القدر إيماناً واحتساباً غُفر له ما تقدم من ذنبه } وعنه رضي الله عنه قال: قال صلى الله عليه و سلم: { من قام رمضان إيماناً واحتساباً غُفر له ما تقدم من ذنبه } [ رواهما البخاري ومسلم ]. \n دل حديث أبي هريرة رضي الله عنه على أن هذه الأسباب الثلاثة كل واحد منها مكفر لما سلف من الذنوب، وهي صيام رمضان، وقيامه، وقيام ليلة القدر، فقيام ليلة القدر بمجرده يكفر الذنوب لمن وقعت له، سواء كانت في أول العشر أو أوسطه أو آخره، وسواء شعر بها أو لم يشعر، ولا يتأخر تكفير الذنوب بها إلى انقضاء الشهر. \n وأما صيام رمضان وقيامه فيتوقف التكفير بهما على تمام الشهر، فإذا تم الشهر فقد كمل للمؤمن صيام رمضان وقيامه، فيترتب له على ذلك مغفرة ما تقدم من ذنبه بتمام السببين، وهما صيام رمضان وقيامه. \n فإذا كمل الصائمون صيام رمضان وقيامه فقد وفوا ما عليهم من العمل، وبقى ما لهم من الأجر وهو المغفرة؛ فإذا خرجوا يوم عيد الفطر إلى الصلاة قُسمت عليهم أجورهم، فرجعوا إلى منازلهم وقد استوفوا الأجر واستكملوه، ومن نقص من العمل الذي عليه نُقص من الأجر بحسب نَقصِه، فلا يَلُم إلا نفسه. قال سلمان: الصلاة مكيال، فمن وفى وفي له، ومن طفف فقد علمتم ما قيل في المطففين. فالصيام وسائر الأعمال على هذا المنوال؛ من وفاها فهو من خيار عباد الله الموفين، ومن طفف فيها فويل للمطففين. أما يستحي من يستوفي مكيال شهواته، ويطفف في مكيال صيامه وصلاته. \n\n غداً تُوفّى النفوس ما كسبت *** ويحصد الزارعون ما زرعوا \n إن أحسنوا أحسنوا لأنفسهم *** وإن أساءوا فبئس ما صنعوا \n\n كان السلف الصالح يجتهدون في إتمام العمل وإكماله وإتقانه، ثم يهتمون بعد ذلك بقبوله، ويخافون من رده، وهؤلاء الذين يُؤتُونَ مَاآتَوا وَقُلُوبُهُم وَجِلَةٌ [المؤمنون:60]. رُوي عن علي رضي اللّه عنه، قال: كونوا لقبول العمل أشد اهتماماً منكم بالعمل، ألم تسمعوا الله عز وجل يقول: إِنَّمَا يَتَقَبَّلُ اللّهُ مِنَ الْمُتَّقِينَ [المائدة:27]. \n وعن الحسن قال: ( إن الله جعل شهر رمضان مضماراً لخلقه، يستبقون فيه بطاعته إلى مرضاته، فسبق قوم ففازوا، وتخلف آخرون فخابوا ). فالعجب من اللاعب الضاحك في اليوم الذي يفوز فيه المحسنون ويخسر فيه المبطلون. \n ومن أسباب المغفرة فيه أيضاً: تفطير الصوام، والتخفيف عن المملوك، ومنها الذكر، ومنها الاستغفار، والاستغفار طلب المغفرة، ودعاء الصائم يستجاب في صيامه وعند فطره، ومنها استغفار الملائكة للصائمين حتى يفطروا، فلما كثرت أسباب المغفرة في رمضان كان الذي تفوته المغفرة فيه محروماً غاية الحرمان. \n فمتى يُغفر لمن لا يغفر له في هذا الشهر؟ متى يُقبل من رُد في ليلة القدر؟ متى يصلح من لا يصلح في رمضان؟ متى يصح من كان به فيه من داء الجهالة والغفلة مرضان؟ كلّ ما لا يثمر من الأشجار في أوان الثمار فإنه يُقطع ثم يوقد في النار، من فرط في الزرع في وقت البِذار لم يحصد يوم الحصاد غير الندم والخسار. \n\n رمضان شهر العتق من النيران \n وأما آخر الشهر فُيعتق فيه من النار من أوبقته الأوزار، واستوجب النار بالذنوب الكبار، فإذا كان يوم الفطر من رمضان أعتق الله فيه أهل الكبائر من الصائمين من النار، فيلتحق فيه المذنبون بالأبرار. \n ولما كانت المغفرة والعتق من النار كل منهما مرتباً على صيام رمضان وقيامه، أمر الله سبحانه وتعالى عند إكمال العدة بتكبيره وشكره، فقال: وَلتُكمِلُوا العِدةَ وَلِتُكَبِرُوا اللّه عَلَى مَا هَدَاكُم وَلَعَلَكُم تَشكُرُنَ [البقرة:185]. فشُكرُ من أنعم على عباده بتوفيقهم للصيام وإعانتهم عليه، ومغفرته لهم به، وعتقهم من النار، أن يذكروه ويشكروه ويتقوه حق تقاته. \n يا من أعتقه مولاه من النار! إياك أن تعود بعد أن صرت حراً إلى رق الأوزار، أيبعدك مولاك عن النار وأنت تتقرب منها؟ وينقذك منها وأنت توقع نفسك فيها ولا تحيد عنها؟ ! \n فينبغي لمن يرجو العتق في شهر رمضان من النار أن يأتي بأسباب توجب العتق من النار، وهي متيسرة في هذا الشهر؛ ففي صحيح ابن خزيمه: ( فاستكثروا فيه من أربع خصال: خصلتان تُرضون بهما ربكم، وخصلتين لا غناء بكم عنهما. فأما الخصلتان اللتان ترضون بهما ربكم فشهادة أن لا إله إلا الله والإستغفار. وأما اللتان لا غناء لكم عنهما فتسألون الله الجنة، وتعوذون به من النار ). \n فهذه الخصال الأربع المذكورة في هذا الحديث كل منها سبب للعتق والمغفرة. فأما كلمة التوحيد فإنها تهدم الذنوب وتمحوها محواً، ولا تبقي ذنباً، ولا يسبقها عمل، وهي تعدل عتق الرقاب الذي يوجب العتق من النار. وأما كلمة الاستغفار فمن أعظم أسباب المغفرة، فإن الاستغفار دعاء بالمغفرة، ودعاء الصائم مستجاب في حال صيامه وعند فطره، وأنفع الاستغفار ما قارنته التوبة، فمن استغفر بلسانه وقلبه على المعصية معقود، وعزمه أن يرجع إلى المعاصي بعد الشهر ويعود، فصومه عليه مردود، وباب القبول عنه مسدود. وأما سؤال الجنة والاستعاذة من النار فمن أهم الدعاء، وقد قال النبي : { حولهما نُدَندنُ } [رواه أبو داود وابن ماجة]. \n\n وداعاً رمضان \n عباد الله، إن شهر رمضان قد عزم على الرحيل، ولم يبق منه إلا القليل، فمن منكم أحسن فيه فعليه التمام، ومن كان فرط فليختمه بالحسنى، فالعمل بالختام، فاستمتعوا منه فيما بقى من الليالي اليسيرة والأيام، واستودعوه عملاً صالحاً يشهد لكم به عند الملك العلام، وودِّعُوه عند فراقه بأزكى تحية وسلام. \n يا شهر رمضان ترفّق، دموع المحبين تُدفَق، قلوبهم من ألم الفراق تَشَقّق، عسى وقفة للوداع تطفىء من نار الشوق ما أحرق، عسى ساعة توبة وإقلاع ترفو من الصيام كل ما تخرّق، عسى منقطع عن ركب المقبولين يلحق، عسى أسير الأوزار يُطلَق، عسى من استوجب النار يُعتق، عسى رحمة المولى لها العاصي يُوفّق. \n وصلى الله وسلم على سيدنا محمد وعلى آله وصحبه وسلم. ",
    "number-en": "The last ten days of Ramadan",
    "label-en": "On the authority of Aisha, may God be pleased with her, she said: {When the ten days of prayer came, the Messenger of God, may God’s prayers and peace be upon him, would tighten his apron, live the night, and wake up his family} and in a narration: {He revived the night, woke up his family, found himself, and tightened the apron} [Narrated by Al-Bukhari and Muslim]. \n\n Actions related to the last ten days of Ramadan \n The Prophet, may God bless him and grant him peace, used to dedicate the last ten days of Ramadan to tasks that he would not do during the rest of the month: \n Among them: reviving the night; It is possible that what is meant is to live the whole night, as in the hadith of Aisha she said: {The Prophet, may God bless him and grant him peace, used to mix the twenty days with prayer and sleep. When it is the last ten days - he should roll up the apron and tighten the apron} [Narrated by Ahmad]. It is possible that by reviving the night he means reviving the majority of it, and this is supported by what is in Sahih Muslim on the authority of Aisha, who said: {I do not know that the Prophet, may God’s prayers and peace be upon him, stayed up all night until the morning}. \n Among them: The Prophet, may God’s prayers and peace be upon him, used to wake up his family for prayer on the ten nights and not on any other night. Sufyan al-Thawri said: I love that when the last ten nights enter, he performs the Hajj at night, works hard in it, and gets his family and children up for prayer if they are able to do so. It has been authenticated on the authority of the Prophet, may God bless him and grant him peace, that he used to knock on Fatima and Ali at night and say to them: “Will you not get up and pray?” [Narrated by Al-Bukhari and Muslim]. \n He used to wake Aisha up at night when he had finished his Tahajjud and wanted to pray Witr. It was encouraged that one of the spouses wake up his partner to pray and sprinkle water on his face. In Al-Muwatta’, Omar ibn Al-Khattab used to pray as long as God wanted him to pray during the night, until when it was midnight he woke up his family to pray, saying to them: Prayer is prayer, and he recited this verse: And command your family to pray and be patient in it [Taha: 132]. The wife of Abu Muhammad Habib Al-Farsi used to say to him at night: (The night has passed and we have a long road ahead of us, and we have little more, and the caravans of the righteous have gone ahead of us, and we have stayed behind). \n\n O sleeper at night, how long do you sleep? Arise, my beloved, the time has come \n And take a robe from the night and its times when you fall asleep \n Whoever sleeps until his night is over, then reaches home or becomes exhausted \n Among them: The Prophet, may God bless him and grant him peace, used to tighten the apron. They differed in its interpretation. Some of them said: It is a metaphor for his severity and diligence in worship, and this is subject to consideration, and the correct view is that what is meant is his seclusion from women, and thus it was interpreted by the predecessors and the earlier imams, including Sufyan al-Thawri, and it was interpreted as saying that he did not go to bed until Ramadan had passed. In the hadith of Anas: “He folded his bed and isolated himself from women.” \n A group of the predecessors said in the interpretation of the Almighty’s saying: “So now have peace with them and seek what God has ordained for you” [Al-Baqarah: 187]: It is a request for the Night of Decree. The meaning of this is that when God Almighty permitted intercourse with women during the nights of fasting until the white thread was distinguished from the black thread, He nevertheless commanded seeking Laylat al-Qadr. So that the Muslims would not be busy during the long nights of the month with permissible listening, and they would miss the request for Laylat al-Qadr, so he ordered, nevertheless, to ask for Laylat al-Qadr by praying Tahajjud from the night, especially on the nights in which Laylat al-Qadr was hoped for. Hence, the Prophet, may God’s prayers and peace be upon him, would visit his family on the twentieth of Ramadan, then isolate himself from his wives and devote himself to seeking Laylat al-Qadr in the last ten nights. Among them: his delaying breakfast until dawn: It was narrated from him from the hadith of Aisha and Anas that the Prophet, may God bless him and grant him peace, used to make his dinner suhoor on the ten nights. And the wording of the hadith of Aisha: {When Ramadan came, the Messenger of God, the Prophet, may God bless him and grant him peace, would stand up and sleep, and when the ten days came, he would tighten his apron, avoid women, wash himself between the calls to prayer, and make dinner a suhoor} [Narrated by Ibn Abi Asim]. On the authority of Abu Saeed Al-Khudri, on the authority of the Prophet, may God’s prayers and peace be upon him, he said: {Do not continue, for whoever of you wants to continue, let him continue until magic}. They said: So you continue, O Messenger of God? He said: {I am not like you. I have a restaurant to feed me and a shepherd to drink.} [Narrated by Al-Bukhari]. \n This apparently indicates that the Prophet, may God’s prayers and peace be upon him, used to continue all night, and he may have only done that because the Prophet, may God’s prayers and peace be upon him, saw it as more motivating for him to work hard on the ten nights, and it did not weaken him from work. God was feeding him and giving him water. Among them: The Prophet, may God’s prayers and peace be upon him, took a bath between the two evening prayers. It was previously mentioned from the hadith of Aisha: {And he took a bath between the two call to prayers} and what is meant is: the Maghrib and Isha call to prayer. Ibn Jarir said: They used to prefer to take a bath every night of the last ten nights. Al-Nakha’i used to bathe every night on the ten days of prayer, and some of them used to bathe and apply perfume on the nights that were most likely for Laylat al-Qadr. Ayoub al-Sakhtiani used to wash himself on the night of the twenty-third and twenty-four, put on two new clothes, and perform his ritual cleansing and said: The night of the twenty-third is the night of the people of Medina, and the next is our night, meaning the Basranis. Thus, it becomes clear that on the nights in which Laylat al-Qadr is hoped for, it is desirable to clean oneself and adorn oneself, and to wear perfume by washing and wearing perfume and to wear good clothing, just as this is prescribed for Friday prayers and holidays. Likewise, it is prescribed to adorn one’s clothes during all prayers, and the outward adornment is not complete except by adornment of the inward through repentance and turning to God Almighty, and purifying it from the filth of sins. The beauty of the exterior with the ruin of the interior is of no avail. No one is fit to converse with kings in private except one who has beautified and purified his outward and inward parts, especially the King of kings who knows the secrets and what is hidden, and he does not look at your appearances, rather he looks at your hearts and your blindness. So whoever stands before him, let him adorn his outward appearance with clothing, and his inwardness with the clothing of piety. \n If a person does not wear clothes of piety, he will be naked, even if he is clothed \n Among them: Itikaf. In the Two Sahihs on the authority of Aisha, may God be pleased with her, that the Prophet, may God’s prayers and peace be upon him, used to perform i’tikaf during the last ten days of Ramadan until God Almighty took his death. And in Sahih Al-Bukhari on the authority of Abu Hurairah, may God be pleased with him, {The Messenger of God, may God bless him and grant him peace, used to seclude ten days every Ramadan, but when the year in which he died came, he secluded twenty days}. Rather, the Prophet, may God’s prayers and peace be upon him, would seclude himself during these ten days, during which he sought Laylat al-Qadr, to cut off his preoccupations, to empty his mind, and to devote himself to communicating with his Lord, remembering him, and praying to him. \n The person who is in seclusion has confined himself to obedience to God and remembrance of Him, and has cut off from himself every preoccupation that distracts him from Him, and devoted his heart and mind to his Lord and what brings him closer to Him, so he has no worries left except God and what pleases him with Him. Just as it strengthened knowledge, love for Him, and familiarity with Him, it bequeathed to its possessor complete devotion to God Almighty in every situation. \n\n Night of Destiny \n God Almighty said: Indeed, We sent it down in the Night of Destiny (1) And what makes you know what the Night of Destiny is? (2) The Night of Destiny is better than a thousand months [Al-Qadr: 1-3]. On the authority of Abu Hurairah, may God be pleased with him, on the authority of the Prophet, may God’s prayers and peace be upon him, that he said in the month of Ramadan: “In it is a night better than a thousand months. Whoever is deprived of its goodness has been deprived” [Narrated by Ahmad and Al-Nasa’i]. Malik said: I have heard that the Messenger of God, may God bless him and grant him peace, was shown the lives of people before him, or whatever God willed of that. It is as if the lifespan of his nation was shortened so that they did not achieve the deeds that others had achieved in terms of longevity, so God gave him the Night of Decree that is better than a thousand months. \n As for actions during Laylat al-Qadr, it has been proven from the Prophet, may God bless him and grant him peace, that he said: {Whoever stands up for Laylat al-Qadr out of faith and seeking reward, his previous sins will be forgiven} and standing up for it is only to revive it by reciting tahajjud and prayer, and he commanded Aisha to pray during it as well. \n Sufyan Al-Thawri said: The supplication on that night is more beloved to me than prayer. What he means is that a lot of supplication is better than a prayer in which there is not a lot of supplication, and if he recites and supplicates, it is good. The Prophet, may God’s prayers and peace be upon him, used to perform tahajjud on the nights of Ramadan, and recite a recited recitation. He would not come across a verse containing mercy without asking, or a verse containing punishment without seeking refuge, so he would combine prayer, reading, supplication, and contemplation. This is the best and most complete deed on the ten nights and elsewhere. Aisha, may God be pleased with her, said to the Prophet: What do you think if it coincides with Laylat al-Qadr, what should I say about it? He said: {Say: O God, You are the Pardoner and You love pardon, so pardon me.} Pardon is one of the names of God Almighty, and He is the One who overlooks the misdeeds of His servants, the One who erases their traces from them, and He loves forgiveness. He loves to pardon His servants, and He loves His servants to forgive one another. If some of them forgive others, he treats them with his forgiveness, and his forgiveness is more beloved to him than his punishment. The Prophet, may God bless him and grant him peace, used to say: {I seek refuge in Your satisfaction from Your anger, and Your forgiveness from Your punishment} [Narrated by Muslim]. Rather, he was commanded to ask for forgiveness on Laylat al-Qadr after working diligently in deeds during it and on the ten nights. Because the knowledgeable people strive hard to do deeds, and then they do not see for themselves a good deed, a situation, or a solution, so they return to asking for forgiveness from the guilty person who has fallen short. \n\n Reasons for forgiveness in Ramadan \n On the authority of Abu Hurairah, may God be pleased with him, on the authority of the Prophet, may God bless him and grant him peace, he said: {Whoever fasts Ramadan out of faith and seeking reward from Allah, his previous sins will be forgiven. And whoever stands in Laylat al-Qadr out of faith and in the hope of reward, his previous sins will be forgiven. On his authority, may God be pleased with him, he said: He, peace and blessings of God be upon him, said: {Whoever stands in Ramadan in faith and in the hope of reward, his previous sins will be forgiven} [Narrated by Al-Bukhari and Muslim]. \n The hadith of Abu Hurairah, may God be pleased with him, indicates that these three reasons, each one of them expiates previous sins, which are fasting in Ramadan, praying in prayer, and praying in Laylat al-Qadr. The mere act of praying in Laylat al-Qadr expiates the sins of the one who committed them, whether they occurred at the beginning, middle, or end of the ten days, and whether he felt them or did not feel them, and expiation of sins by them does not delay until the end of the month. As for fasting and praying in Ramadan, expiation for them depends on the completion of the month. If the month is completed, the fasting and prayer of Ramadan has been completed for the believer, and this results in him having his previous sins forgiven by completing the two reasons, which are fasting and praying in Ramadan. \n If the fasting people complete the fasts and prayers of Ramadan, they have fulfilled their duties, and their reward remains, which is forgiveness. If they go out to pray on the day of Eid al-Fitr, their wages are divided among them, and they return to their homes having received and completed the wage. Whoever is short of the work he owes will be short of the reward according to his shortfall, and he has no one to blame but himself. Salman said: Prayer is a measure, so whoever fulfills it, it will be fulfilled for him, and whoever is generous, you know what was said about those who are generous. Fasting and other deeds are like this; Whoever pays it is one of the best of God’s servants to fulfill it, and whoever is frivolous in it, woe to the frivolous. Isn’t he ashamed of the one who fulfills the measure of his desires and neglects the measure of his fasting and prayer? \n\n Tomorrow, souls will be paid what they have earned, and farmers will reap what they sowed \n If they do good, they do good for themselves, and if they do evil, then wretched is what they have done \n\n The righteous predecessors would strive to complete the work, perfect it, and master it, but after that they would be concerned about accepting it and fear its rejection. And these are those who give what they have given, and their hearts are in fear [Al-Mu’minun: 60]. It was narrated on the authority of Ali, may God be pleased with him, who said: Be more concerned with the acceptance of work than with the work. Have you not heard God Almighty say: God only accepts from the pious [Al-Maeda: 27]. \n On the authority of Al-Hasan, he said: (God made the month of Ramadan a track for His creation, in which they would stay ahead of themselves by obeying Him to please Him. Some people excelled and won, and others lagged behind and were disappointed.) It is astonishing at the laughing player on the day when the doers of good win and the invalids lose. Among the reasons for forgiveness in Ramadan are: breaking the fast of the fasting person, making it easier for the slaves, including remembrance, including seeking forgiveness, asking for forgiveness, asking for forgiveness, and the supplication of the fasting person is answered during his fasting and when he breaks his fast, and among them is the angels asking forgiveness for those who are fasting until they break their fast. When the reasons for forgiveness in Ramadan were many, the one who missed forgiveness in it was deprived to the utmost deprivation. When will those who are not forgiven be forgiven in this month? When will someone who is rejected on Laylat al-Qadr be accepted? When can those who are not fit be corrected during Ramadan? When will someone who has two diseases of ignorance and negligence become healthy? All the trees that do not bear fruit at the time of fruiting are cut down and then burned in the fire. Whoever plants too much at the time of sowing will reap nothing but regret and loss on the day of harvest. Ramadan is the month of liberation from flames \n As for the end of the month, those who have been burdened by sins are freed from the Fire, and the Fire is made necessary by major sins. If it is the day of Ramadan, God frees those who fast from the Fire from the Fire, and the sinners join the righteous. \n Since forgiveness and liberation from Hell are both linked to Ramadan fasting and prayers, God Almighty commanded upon completing the waiting period to glorify and thank Him, saying: And you should complete the waiting period and glorify Allah for having guided you and that you may be grateful [Al-Baqarah: 185]. So thanks be to Him who bestowed His blessings upon His servants by granting them success in fasting, helping them with it, forgiving them through it, and freeing them from Hell, for remembering Him, thanking Him, and fearing Him as He should be feared. \n O he whom his Master freed from Hell! Beware of returning to slavery after you have become free. Will your master keep you away from Hell while you are approaching it? And He saves you from it while you fall into it and do not deviate from it? ! \n Whoever hopes to be freed from Hell during the month of Ramadan should come up with reasons that necessitate liberation from Hell, and they are available in this month. In the Sahih of Ibn Khuzaymah: “So increase yourselves in four qualities: two qualities with which you will please your Lord, and two qualities that you cannot do without. As for the two qualities with which you please your Lord, they are bearing witness that there is no god but God and seeking forgiveness. As for the two things you have no need of, you ask God for Paradise and seek refuge in Him from Hell.) \n These four qualities mentioned in this hadith, each of them is a reason for emancipation and forgiveness. As for the word of monotheism, it destroys sins and erases them completely, and does not leave a sin behind, and no action precedes it, and it is equivalent to freeing slaves, which necessitates freedom from Hell. As for the word asking for forgiveness, it is one of the greatest reasons for forgiveness. Asking forgiveness is a supplication for forgiveness, and the supplication of the fasting person is answered when he is fasting and when he breaks his fast. The most beneficial request for forgiveness is that which is compared to repentance. Whoever seeks forgiveness with his tongue and heart tied to sin, and his resolve is to return to sin after the month and return, then his fast will be rejected, and the door to acceptance for him is closed. As for asking for Paradise and seeking refuge from Hell, it is one of the most important supplications, and the Prophet said: “Around them we hum” [Narrated by Abu Dawud and Ibn Majah]. Goodbye Ramadan \n Servants of God, the month of Ramadan has decided to depart, and only a little of it remains, so whoever among you has done well in it must complete it, and whoever has neglected it should conclude it with goodness, so work with completion, so enjoy it in the short nights and days that remain, and entrust it with good deeds that will bear witness to you before the All-Knowing King, and bid it farewell upon its parting with the most sincere greetings and peace. O month of Ramadan, be gentle, may the tears of lovers flow, their hearts split from the pain of separation, may a pause for farewell extinguish the fire of longing that has been burned, may the hour of repentance and renunciation free from fasting all that has been broken, may the one cut off from the ranks of those accepted be reunited, may the prisoner of burdens be released, may the one who deserved the fire be liberated, may the mercy of the Lord grant success to the sinner. \n May God’s blessings and peace be upon our master Muhammad and his family and companions."
  },
  {
    "number": "المداومة علي العمل الصالح ",
    "text": "",
    "label": "إليك أخي 10 وسائل للمداومة على العمل الصالح بعد رمضان \n\n 1- أولاً وقبل كل شي طلب العون من الله – عز وجل - على الهداية والثبات وقد أثنى الله على دعاء الراسخين في العلم  رَبَّنَا لا تُزِغْ قُلُوبَنَا بَعْدَ إِذْ هَدَيْتَنَا وَهَبْ لَنَا مِنْ لَدُنْكَ رَحْمَةً إِنَّكَ أَنْتَ الْوَهَّابُ  \n 2- الإكثار من مُجالسة الصالحين والحرص على مجالس الذكر العامة كالمحاضرات والخاصة كالزيارات . \n 3- التعرف على سير الصالحين من خلال القراءة للكتب أو استماع الأشرطة وخاصة الاهتمام بسير الصحابة فإنها تبعث في النفس الهمة والعزيمة . \n 4- الإكثار من سماع الأشرطة الإسلامية المؤثرة كالخطب والمواعظ وزيارة التسجيلات الإسلامية بين وقت وآخر . \n 5- الحرص على الفرائض كالصلوات الخمس وقضاء رمضان فان في الفرائض خير عظيم . \n 6- الحرص على النوافل ولو القليل المُحبب للنفس فان أحب الأعمال إلى الله أدومه وإن قل كما قال صلى الله عليه وسلم . \n 7- البدء بحفظ كتاب الله والمداومة على تلاوته وأن تقرأ ما تحفظ في الصلوات والنوافل . \n 8- الإكثار من ذكر الله والاستغفار فإنه عمل يسير ونفعه كبير يزيد الإيمان ويُقوي القلب . \n 9- البعد كل البعد عن مفسدات القلب من أصحاب السوء و أجهزة التلفاز والدش والاستماع للغناء والطرب والنظر في المجلات الخليعة . \n 10- وأخيرا أوصيك أخي الحبيب بالتوبة العاجلة .. التوبة النصوح التي ليس فيها رجوع بإذن الله فإن الله يفرح بعبده إذا تاب أشد الفرح . \n أخي المبارك لا تكن من أولئك القوم الذين لا يعرفون الله إلا في رمضان لقد قال فيهم السلف  بئس القوم لا يعرفون الله إلا في رمضان  وداعاً أيها الحبيب إلى رمضان آخر وأنت في صحة وعافية واستقامة على دين الله إن شاء الله . \n هذه وصايا قيمة مفيدة لمن قرأها وعمل بها فنوصي بنشرها والحرص على تطبيقها رجاء الانتفاع والتلذذ بالعبادة . ",
    "number-en": "Continuing the good work",
    "label-en": "Here, my brother, are 10 ways to continue doing good deeds after Ramadan \n\n 1- First and foremost, seeking help from God - the Almighty - for guidance and steadfastness. God has praised the supplication of those who are firmly rooted in knowledge. Our Lord, do not let our hearts deviate after You have guided us. Grant us mercy from Yourself. Indeed, You are the Giver.  \n 2- Sitting with righteous people frequently and being keen on public dhikr gatherings, such as lectures, and private ones, such as visits. \n 3- Learning about the biographies of the righteous through reading books or listening to tapes, especially paying attention to the biographies of the Companions, as they inspire courage and determination in the soul. \n 4- Listening to influential Islamic tapes a lot, such as sermons and sermons, and visiting Islamic recordings from time to time. \n 5- Be careful about the obligatory prayers, such as the five daily prayers and making up for Ramadan, for there is great goodness in the obligatory prayers. \n 6- Being keen on doing voluntary deeds, even if they are small, is pleasing to the soul. For the most beloved deeds to God are those that are performed consistently, even if they are few, as he, may God’s prayers and peace be upon him, said. \n 7- Start by memorizing the Book of God, continue its recitation, and recite what you have memorized in prayers and voluntary prayers. \n 8- Remembrance of God and seeking forgiveness a lot, for it is an easy task and its benefit is great, it increases faith and strengthens the heart. \n 9- Staying completely away from those who corrupt the heart, such as evil people, television sets, showers, listening to singing and singing, and looking at pornographic magazines. \n 10- Finally, I advise you, my beloved brother, to repent quickly... sincere repentance that has no going back, God willing, for God is extremely happy with His servant when he repents. \n My blessed brother, do not be one of those people who do not know God except in Ramadan. The predecessors said about them: “What a miserable people they do not know God except in Ramadan.” Farewell, my beloved, until another Ramadan, and you are in good health and integrity in following God’s religion, God willing. \n These are valuable commandments that are useful to those who read them and act upon them, so we recommend disseminating them and being careful to implement them in the hope of benefiting and enjoying worship."
  },
  {
    "number": "أحكام وآداب العيد",
    "text": "",
    "label": "العيد شعيرة إسلامية جليلة ، العيد مناسبة إيمانية جميلة ، العيد موعد ولقاء تتجلى فيه معان الإنسانية والاجتماعية والنفسية ، نعم .. العيد مظهر من مظاهر العبودية لله تعالى ، صلاة وذكر ودعاء ، تصافح وتآلف وتألق وتعانق , ود وصفاء وأخوّة ووفاء ، لقاء ات مغمورة بالشوق والعطاء والمحبة والنقاء . \n إن هذا العيد جـاء ناشراً فينا الإخـاء **** نازعاً أشجار حقـد مصلحاً مهدي الصفاء \n العيد واحة سرور وبهجة وسط صحراء الحياة الجادة اللاهبة ، العيد واحة وارفة يستقبله المسلم بالفرح والعطاء والابتسامة والهناء ، نعم .. إنه عيد يغمر نفوس الصغار بالفرح والمرح ، والكبار بالشكر والذكر ، والمحتاجين بالسعة واليسر ، والأغنياء بالعطاء والمدّ ، يُمللأ القلوب بهجا وأنسا ، والنفوس صفاء وحبا ، فتُنسى فيه الأحقاد والضغائن ، ويحصل الجمع بعد الفراق ، والصفاء بعد الكدر ، والتصافح بعد التقابض ، نعم .. عيد تتجدد فيه أواصر الحب ودواعي القرب ، فلا تشرق شمس ذاك اليوم إلا والبسمة تعلو كل شفة ، والبهجة تغمر كل قلب .. عيد تبتسم له الدنيا ، أرضها وسماؤها ، شمسها وضياؤها ، فما أجمل العيد وما أجمل داعيه .. \n\n * أحكام وآداب العيد .. \n\n 1. الفرح بنعمة الله تعالى بإكمال الطاعة وإتمامها والثقة بوعد الله تعالى بفضله ومغفرته  قل بفضله وبرحمته فبذلك فليفرحوا هو خير مما يجمعون  \n 2. مشروعية التوسعة على العيال في أيام العيد بأنواع ما يحصل لهم من بسط النفس ، كإظهار السرور وترويح البدن من كلف العبادة وغير ذلك في حدود الضوابط الشرعية . \n 3. مشروعية التكبير من غروب شمس ليلة العيد إلى دخول الإمام في مصلاه  ولتكملوا العدة ولتكبروا الله على ما هداكم ولعلكم تشكرون  وكان ابن عمر رضي الله عنهما يكبر حتى يأتي المصلى ويكبر حتى يأتي الإمام [ رواه الدار قطني ] وصفته  الله أكبر ، الله أكبر ، لا إله إلا الله ، الله أكبر ، الله أكبر ولله الحمد  \n 4. إخراج الزكاة وأنها طعمة للمساكين وطهرة للصائم من اللغو والرفث ، وأفضلية وقتها قبيل صلاة العيد ، ويجوز إخراجها قبل العيد بيوم أو يومين . \n 5. استحباب الاغتسال والتطيب ولبس أحسن الثياب ، عن ابن عمر رضي الله عنهما قال : أخذ عمر جبة من إستبرق تباع في السوق ، فأخذها فأتى رسول الله صلى الله عليه وسلم فقال : يا رسول الله ، ابتع هذه تجمل بها للعيد والوفود..  الحديث [ رواه البخاري ] .\n\n\n6. الأكل قبل صلاة عيد الفطر ، عن أنس رضي الله عنه قال : كان رسول الله صلى الله عليه وسلم لا يغدو يوم الفطر حتى يأكل تمرات  وفي رواية : ويأكلهن وترا [ رواه البخاري ] .\n\n\n7. العيد من أعظم الخيرات ، لذا يستحب التبكير في الخروج للصلاة أخذا بقول الله تعالى  فاستبقوا الخيرات  .\n\n\n8. الخروج إلى المصلى ماشيا ، لأنه أقرب إلى التواضع فعن عثمان بن عفان رضي الله عنه قال من السنة أن يخرج إلى العيد ماشيا  [ رواه الترمذي ] .\n\n\n9. التهنئة بالعيد ، كقول  تقبل الله منا ومنك  وقد كان أصحاب رسول الله صلى الله عليه وسلم إذا التقوا يوم العيد يقول بعضهم لبعض : تقبل الله منا ومنك . \n 10. الحرص على تحقيق السنة كمخالفة الطريق لما روى جابر بن عبد الله رضي الله عنه كان النبي صلى الله عليه وسلم إذا كان يوم عيد خالف الطريق  \n 11. حثّ الأبناء والصغار للخروج إلى المصلى وكذلك الحيّض وذوات الخدور من النساء ليشهدن الخير ودعوة المسلمين \n 12. تفقد الفقراء والمساكين وذوي الحاجة لزيارتهم وسد حاجتهم والوقوف بجانبهم ومشاركتهم فرحتهم \n 13. زيارة الأحباب والأصدقاء وأولى الناس بالتواصل والتزوار في هذا العيد المبارك أولوا الأرحام و من أحب أن يُبَسط له في رزقه ويُنْسأ له في أثره فليصل رحمه . \n\n * أخي المسلم .. تذكر وأنت تغادر منزلك صبيحة العيد وقد اجتمع أهلك واللتمّ شملك في أمن وآمان ورغد عيش وطيب حنان فالزوجة الحسناء بجوارك ، والأطفال الصغار من حولك ، وأنت في ظل ظليل ، ومنزل بالخير عميم ، متكئ على فراش وثير ، نعم .. تذكر أن هناك دموعا غارقة في لجج الليالي ، لا تعرف عيدا ولا العيد يعرفهم ، يتامى لا يجدون حنان أب ، وأيامى فقدوا رحمة زوج ، وجموعا كاثرة من إخوانك في العقيدة والدين شردهم الطغيان ، ومزقتهم الحروب ، يفترشون الغبراء ، ويلتحفون الخضراء ، ويتضورون في العراء ، يذوقون من البأس ألوانا ، وتجرعون من العلقم كيزانا ، فقر مدقع ، ومطالب قاسية ، يأتي العيد عليهم حسرةً في القلوب ودموعا تنهمر على الخدود ، فكن أخي المسلم أهلَ عطفٍ وإحسانٍ وكرم وجود ، امسح بكفيك الكريمتين الناعمتين دموعَ أولئك الحيارى ، وقدم لهم خيرًا وإحسانًا { وَمَا تُقَدّمُواْ لأَنفُسِكُمْ مّنْ خَيْرٍ تَجِدُوهُ عِندَ اللَّهِ هُوَ خَيْراً وَأَعْظَمَ أَجْراً } ليكن لهم من عيدك نصيبا ، و  من نفّس عن مؤمن كربة من كرب الدنيا نفس الله عنه كربة من كرب يوم القيامة والله في عون العبد ما كان العبد في عون أخيه  جعل الله عيدنا وعيدك فوزاً برضاه ، ونجاة من ناره ولظاه ، وأن يجعلنا ممن قبل طاعاتهم وأعتق رقابهم .. آمين . وصلى الله وسلم نبيه ورسوله محمد وعلى آله وصحبه وسلم تسليما كثيرا إلى يوم نلقاه . ",
    "number-en": "Rulings and etiquette of Eid",
    "label-en": "Eid is a solemn Islamic ritual. Eid is a beautiful occasion of faith. Eid is a date and meeting in which the meanings of humanity, social and psychological manifestations are evident. Yes... Eid is a manifestation of servitude to God Almighty, prayer, remembrance and supplication, shaking hands, coming together, sparkling and embracing, friendship, serenity, brotherhood and loyalty, meetings immersed in longing, giving, love and purity. This Eid has come to spread brotherhood among us, uprooting the trees of hatred, and reforming the Mahdi of purity. \n Eid is an oasis of happiness and joy in the midst of the burning desert of serious life. Eid is a lush oasis that the Muslim receives with joy, giving, smiles and contentment. Yes... it is an Eid that fills the souls of the young with joy and joy, and the adults with gratitude and remembrance, and those in need of abundance and ease, and the rich with giving and abundance. It fills the hearts with joy and peace, and the souls with purity and love, in which grudges and grudges are forgotten. Reunion occurs after separation, serenity after turmoil, and shaking hands after touching hands. Yes... A holiday in which the bonds of love and the reasons for closeness are renewed. The sun does not rise on that day without a smile on every lip, and joy overwhelms every heart. A holiday at which the world smiles, its earth and its sky, its sun and its light. \n\n * Rulings and etiquette of Eid.. \n\n 1. Rejoicing in the grace of God Almighty by completing and fulfilling obedience and trusting in the promise of God Almighty by His grace and forgiveness. Say, by His grace and mercy, so let them rejoice in this. It is better than what they gather.  \n 2. It is permissible to be generous to one’s children during the days of Eid with all kinds of pleasures that bring them pleasure, such as showing happiness and relieving the body from the burdens of worship, and other things, within the limits of Sharia controls. \n 3. The permissibility of saying “Allahu Akbar” from sunset on the night of Eid until the imam enters his prayer place. And you must complete the number and glorify God for having guided you, and perhaps you will be grateful. Ibn Omar, may God be pleased with them both, used to say “Allahu Akbar” until he came to the prayer place and “Allahu Akbar” until the imam came [Narrated by Al-Daraqutni] She described him as God is Great, God is Great, There is no god but God, God is Great, God is Great, and praise be to God.  \n 4. Paying zakat, as it is a food for the poor and purifies the fasting person from idle talk and obscenity, and it is preferable to time it before the Eid prayer, and it is permissible to pay it a day or two before the Eid. \n 5. The desirability of bathing, applying perfume, and wearing the best clothes. On the authority of Ibn Omar, may God be pleased with them both, he said: Omar took a cloak made of brocade that was sold in the market, so he took it and came to the Messenger of God, may God bless him and grant him peace, and said: O Messenger of God, buy this to beautify yourself with it for the Eid and the delegations.. Hadith [Narrated by Al-Bukhari].\n\n\n6. Eating before the Eid al-Fitr prayer, on the authority of Anas, may God be pleased with him, said: The Messenger of God, may God’s prayers and peace be upon him, would not eat dates in the morning until he had eaten dates, and in a narration: And he would eat them at an odd number [narrated by al-Bukhari].\n\n\n7. Eid is one of the greatest good deeds, so it is recommended to go out early to pray, taking into account the words of God Almighty, so be sure of the good deeds.\n\n\n8. Going out to the prayer place walking, because it is closer to humility. On the authority of Othman bin Affan, may God be pleased with him, he said it is Sunnah to go out to the Eid walking [Narrated by Al-Tirmidhi].\n\n\n9. Congratulations on Eid, such as saying: May God accept from us and from you. When the companions of the Messenger of God, may God bless him and grant him peace, met on the day of Eid, they would say to each other: May God accept from us and from you. \n 10. Ensuring the fulfillment of the Sunnah is like disobeying the road, according to what Jabir bin Abdullah, may God be pleased with him, narrated. If it was an Eid day, the Prophet, may God bless him and grant him peace, would disobey the road.  \n 11. Urging children and young people to go out to the prayer place, as well as menstruating and pregnant women, to witness goodness and to invite Muslims. \n 12. Visit the poor, the needy, and those in need, to visit them, meet their needs, stand by them, and share their joy. \n 13. Visiting loved ones, friends, and the people closest to communicating and visiting on this blessed Eid are those who are close to relatives, and whoever wants his livelihood to be expanded and his trail to be forgotten, let him maintain his ties of kinship. \n\n * My Muslim brother, remember as you leave your home on the morning of Eid, and your family has gathered and you are reunited in safety, security, prosperity, and good living. The beautiful wife is next to you, and the young children are around you, and you are in a shady shade, and your home is full of goodness, reclining on a comfortable bed. Yes.. Remember that there are tears drowned in the depths of the nights, who do not know a holiday and the holiday does not know them, orphans who do not find the tenderness of a father, and in my days they lost the mercy of a husband, and large crowds of your brothers in faith and religion displaced by tyranny, and torn by wars, sleeping in dust, wrapped in green, and starving in the open, tasting the colors of misery, and drinking of gall. A lot of poverty, extreme poverty, and harsh demands. Eid comes to them with grief in their hearts and tears streaming down their cheeks. So, my Muslim brother, be a person of kindness, benevolence, and generosity of presence. Wipe away the tears of those who are bewildered with your generous, soft palms. And provide them with goodness and kindness {And whatever good you put forward for yourselves of good, you will find it with God. It is better and greater in reward} May they have a share of your feast. Helping the servant as long as the servant is helping his brother. May God make our Eid and your Eid a victory for His pleasure and salvation from His fire and scourge, and to make us among those who accept their obedience and free their necks.. Amen. May God’s blessings and peace be upon His Prophet and Messenger Muhammad and his family and companions and grant him peace until the day we meet him."
  }
]